{
    "status": "ok",
    "totalResults": 434,
    "fetchedResults": 100,
    "cleanedResults": 82,
    "articles": [
        {
            "source": {
                "id": null,
                "name": "BBC News"
            },
            "author": null,
            "title": "Europe’s deadly floods are glimpse of future climate",
            "description": "A new study shows that the record-breaking rainfall was made more likely and intense by climate change.",
            "url": "https://www.bbc.com/news/articles/cn5zx2zx5xvo",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/09d0/live/a9752f60-7aea-11ef-bf0c-9107d5571f2a.jpg",
            "publishedAt": "2024-09-25T03:06:20Z",
            "content": "Local residents rescue a woman from rising flood waters in the Romanian village of Slobozia Conachi\r\nCentral Europe's devastating floods were made much worse by climate change and offer a stark glimp… [+5380 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "NPR"
            },
            "author": "Alejandra Borunda",
            "title": "Europe's intense rainfall in September twice as likely thanks to climate change",
            "description": "Extensive early warnings and years of adaptation made the floods less deadly than they otherwise might have been.",
            "url": "https://www.npr.org/2024/09/25/nx-s1-5123674/europes-intense-rainfall-in-september-twice-as-likely-thanks-to-climate-change",
            "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2000x1125+0+168/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4d%2Fbf%2F1839ea454f0a876a4462ea948adf%2Fap24261387968427.jpg",
            "publishedAt": "2024-09-25T09:01:00Z",
            "content": "Massive rainfall inundated parts of Central and Eastern Europe in mid-September, dumping as much as two-thirds of some cities annual rain in just a few days.\r\nThe rainfall from the weather system, ca… [+5353 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Yahoo Entertainment"
            },
            "author": "Reuters Videos",
            "title": "Belgian climate scientists grow the pears of the future",
            "description": "STORY: A group of climate scientists in Belgium are currently exploring what the pears of the future might be like.\"...the pears tend to be less firm and...",
            "url": "https://www.yahoo.com/news/belgian-climate-scientists-grow-pears-095044724.html",
            "urlToImage": "https://media.zenfs.com/en/video.reutersnews.com/fdf689f04bf1bdddbf3f12a6ffecb88b",
            "publishedAt": "2024-09-25T09:50:44Z",
            "content": "STORY: A group of climate scientists in Belgium are currently exploring what the pears of the future might be like.\r\n\"...the pears tend to be less firm and have more sugar.\"\r\n:: THIS EARTH\r\n:: Maasme… [+2133 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "CNET"
            },
            "author": "Erin Gobler",
            "title": "How to Protect Your Home During Hurricanes and Other Major Storms",
            "description": "Hurricanes may be getting stronger due to climate change. We'll show you how to keep yourself and your home safe.",
            "url": "https://www.cnet.com/home/energy-and-utilities/how-to-protect-your-home-during-hurricanes-and-other-major-storms/",
            "urlToImage": "https://www.cnet.com/a/img/resize/37ef3d5b70953f6e3a3289c40ff5fcc7cb5b4d1c/hub/2021/05/03/3cc69ed9-e9c4-482d-9208-450086b4c04e/gettyimages-677500065.jpg?auto=webp&fit=crop&height=675&width=1200",
            "publishedAt": "2024-09-25T21:00:07Z",
            "content": "Though we're nearing the end of hurricane season for the East Coast of the US, an August report from the National Oceanic and Atmospheric Administration predicted four to seven more hurricanes for th… [+5735 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Science Daily"
            },
            "author": null,
            "title": "Thinking about the future: Examining the exacerbating and attenuating factors of despair-induced climate burnout",
            "description": "New research explored the exacerbating and attenuating factors of despair-induced climate burnout to learn how people can overcome despair and maintain motivation to fight climate change.",
            "url": "https://www.sciencedaily.com/releases/2024/09/240925123634.htm",
            "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png",
            "publishedAt": "2024-09-25T16:36:34Z",
            "content": "As the occurrence of weather extremes continues to escalate, the climate change movement now grapples with a new challenge, 'climate burnout'.The troubling trend of despair and fatigue among those wh… [+2762 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Gizmodo.com"
            },
            "author": "Adam Kovac",
            "title": "The Surprising Ingredient That Helped Polynesians Conquer the Pacific",
            "description": "Ancient Polynesians were encouraged to settle new territories because they had a reliable and hardy crop, new research suggests.",
            "url": "https://gizmodo.com/the-surprising-ingredient-that-helped-polynesians-conquer-the-pacific-2000503199",
            "urlToImage": "https://gizmodo.com/app/uploads/2024/09/Screenshot-2024-09-25-at-11.57.36-AM.jpg",
            "publishedAt": "2024-09-25T23:01:34Z",
            "content": "Sweet potatoes are a very versatile tuber. You can roast them. You can bake them into a pie. You can turn them into the third best type of french fry. And apparently, you can make them an integral pa… [+2849 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Science Daily"
            },
            "author": null,
            "title": "One in two El Niño events could be extreme by mid-century",
            "description": "Climate change from greenhouse gas emissions could make extreme El Nino events more frequent, according to new research.",
            "url": "https://www.sciencedaily.com/releases/2024/09/240925123647.htm",
            "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png",
            "publishedAt": "2024-09-25T16:36:47Z",
            "content": "With the climate pattern known as El Niño in full force from mid-2023 to mid-2024, global temperatures broke records for 12 months in a row. As one of the strongest El Niño events on record, it was l… [+4839 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Science Daily"
            },
            "author": null,
            "title": "Deep-sea discovery shines light on life in the twilight zone",
            "description": "A new study could change the way scientists view microbial processes in the deep ocean. The unexpected findings expand our understanding of the impacts of climate change, including how and where the ocean stores carbon.",
            "url": "https://www.sciencedaily.com/releases/2024/09/240925123650.htm",
            "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png",
            "publishedAt": "2024-09-25T16:36:50Z",
            "content": "The ocean's twilight zone is deep, dark, and -- according to new research -- iron deficient.No sunlight reaches this region 200 to 1,000 meters below the sea surface, where levels of iron, a key micr… [+3035 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Armand Hernández, Olga Margalef",
            "title": "How coral and sediments helped to reconstruct 2.6 million years of climate history",
            "description": "Today's climate change is man-made. The consensus in the climate science community is unequivocal, but in order to determine just how exceptional current climate change is, we have had to contextualize the present on a much longer time scale. To do this, scie…",
            "url": "https://phys.org/news/2024-09-coral-sediments-reconstruct-million-years.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/how-ice-trees-coral-an.jpg",
            "publishedAt": "2024-09-25T16:27:13Z",
            "content": "Today's climate change is man-made. The consensus in the climate science community is unequivocal, but in order to determine just how exceptional current climate change is, we have had to contextuali… [+6998 chars]"
        },
        {
            "source": {
                "id": "time",
                "name": "Time"
            },
            "author": "Olivia B. Waxman",
            "title": "The Challenge of Making a More Resilient, Sustainable Energy Grid",
            "description": "Panelists at a TIME100 Talks event discussed how the U.S. will meet its energy needs in an equitable, sustainable, and affordable way.",
            "url": "https://time.com/7022995/energy-trilemma-sustainable-grid/",
            "urlToImage": "https://api.time.com/wp-content/uploads/2024/09/time-100-talk-energy.jpg?quality=85&w=1200&h=628&crop=1",
            "publishedAt": "2024-09-25T17:49:15Z",
            "content": "In Manhattans Times Square, known for its flashy electric billboards, business leaders gathered on Sep. 25 for a panel on making the U.S. power grid more sustainable.\r\nThe event was part of Climate W… [+3808 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Flinders University",
            "title": "Investigating 'climate burnout' to learn how people can maintain motivation to fight climate change",
            "description": "As the occurrence of weather extremes continues to escalate, the climate change movement now grapples with a new challenge, \"climate burnout.\"",
            "url": "https://phys.org/news/2024-09-climate-burnout-people.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/6-climatechange.jpg",
            "publishedAt": "2024-09-25T16:30:01Z",
            "content": "As the occurrence of weather extremes continues to escalate, the climate change movement now grapples with a new challenge, \"climate burnout.\"\r\nThe troubling trend of despair and fatigue among those … [+3517 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "University of New Hampshire",
            "title": "New research reveals climate change impact on Northeastern forests may be lower than expected",
            "description": "New England's forests confront multiple environmental challenges like rising temperatures due to climate change and increased atmospheric nitrogen deposits from burning fossil fuels. Scientists have previously studied the impact of both independently, but for…",
            "url": "https://phys.org/news/2024-09-reveals-climate-impact-northeastern-forests.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/new-research-reveals-c.jpg",
            "publishedAt": "2024-09-25T17:33:17Z",
            "content": "New England's forests confront multiple environmental challenges like rising temperatures due to climate change and increased atmospheric nitrogen deposits from burning fossil fuels. Scientists have … [+4278 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "FAPESP",
            "title": "Brazil must reinforce protection of forests to meet climate change mitigation goals, study warns",
            "description": "As it prepares to host the 30th Conference of the Parties to the United Nations Framework Convention on Climate Change (UNFCCC COP 30, the first COP to be held in the Amazon) in November 2025, Brazil is at a crucial moment. Its greenhouse gas emission reducti…",
            "url": "https://phys.org/news/2024-09-brazil-forests-climate-mitigation-goals.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/brazil-must-reinforce.jpg",
            "publishedAt": "2024-09-25T19:44:52Z",
            "content": "As it prepares to host the 30th Conference of the Parties to the United Nations Framework Convention on Climate Change (UNFCCC COP 30, the first COP to be held in the Amazon) in November 2025, Brazil… [+10446 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Planetary Science Institute",
            "title": "Frozen in time: Rock fossils hint at Mars's ancient climate",
            "description": "Long ago, flowing wind and water shaped Mars's malleable sand and sediment into dunes, ripples and other landscape patterns, called bedforms. Over billions of years, some of these landforms hardened into rock—scientists then call them paleo-bedforms. Frozen i…",
            "url": "https://phys.org/news/2024-09-frozen-fossils-hint-mars-ancient.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/frozen-in-time-rock-fo.jpg",
            "publishedAt": "2024-09-25T20:44:21Z",
            "content": "Long ago, flowing wind and water shaped Mars's malleable sand and sediment into dunes, ripples and other landscape patterns, called bedforms. Over billions of years, some of these landforms hardened … [+4731 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Suman Naishadham",
            "title": "Deadly flooding in Central Europe made twice as likely by climate change",
            "description": "Human-caused climate change doubled the likelihood and intensified the heavy rains that led to devastating flooding in Central Europe earlier this month, a new flash study found.",
            "url": "https://phys.org/news/2024-09-deadly-central-europe-climate.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/deadly-flooding-in-cen.jpg",
            "publishedAt": "2024-09-25T08:01:50Z",
            "content": "Human-caused climate change doubled the likelihood and intensified the heavy rains that led to devastating flooding in Central Europe earlier this month, a new flash study found.\r\nTorrential rain in … [+4070 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Cardiff University",
            "title": "Manifesto outlines plankton's role in tackling triple planetary crisis",
            "description": "A Cardiff University researcher is among the expert contributors to a landmark document highlighting the critical role of plankton in addressing the interlinked global crises of climate change, pollution, and biodiversity loss.",
            "url": "https://phys.org/news/2024-09-manifesto-outlines-plankton-role-tackling.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/plankton.jpg",
            "publishedAt": "2024-09-25T19:42:32Z",
            "content": "A Cardiff University researcher is among the expert contributors to a landmark document highlighting the critical role of plankton in addressing the interlinked global crises of climate change, pollu… [+2938 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "University of Arizona",
            "title": "Ice age clues and advanced climate modeling shed light on how El Niño weather patterns might change",
            "description": "The last ice age peaked around 20,000 years ago and was marked by extensive glaciation and dramatic climate shifts that reshaped Earth's oceans, landscapes and ecosystems. A study led by the University of Arizona suggests that Earth's last ice age may provide…",
            "url": "https://phys.org/news/2024-09-ice-age-clues-advanced-climate.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/ice-age-clues-point-to.jpg",
            "publishedAt": "2024-09-25T15:00:01Z",
            "content": "The last ice age peaked around 20,000 years ago and was marked by extensive glaciation and dramatic climate shifts that reshaped Earth's oceans, landscapes and ecosystems. A study led by the Universi… [+5242 chars]"
        },
        {
            "source": {
                "id": "new-scientist",
                "name": "New Scientist"
            },
            "author": null,
            "title": "Geoengineering is now essential to saving the Arctic's ice",
            "description": "If we want to preserve the dwindling ice in the Arctic, cutting our emissions is no longer enough – we also need to use geoengineering to refreeze this precious ecosystem",
            "url": "https://www.newscientist.com/article/mg26335103-600-geoengineering-is-now-essential-to-saving-the-arctics-ice/",
            "urlToImage": "https://images.newscientist.com/wp-content/uploads/2024/09/24165845/SEI_222886960.jpg",
            "publishedAt": "2024-09-25T18:00:00Z",
            "content": "Shutterstock/elRoce\r\nThe first explorers known to have reached the North Pole spent weeks dragging their sleds across the rough pack ice. Now, people can travel most of the way there from the comfort… [+2040 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "NASA"
            },
            "author": "Anthony Greicius",
            "title": "NASA Analysis Shows Irreversible Sea Level Rise for Pacific Islands",
            "description": "Climate change is rapidly reshaping a region of the world that’s home to millions of people. In the next 30 years, Pacific Island nations such as Tuvalu, Kiribati, and Fiji will experience at least 8 inches (15 centimeters) of sea level rise, according to an …",
            "url": "https://www.nasa.gov/earth/climate-change/nasa-analysis-shows-irreversible-sea-level-rise-for-pacific-islands/",
            "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/09/1-kanton-kiribati-nasa.jpg",
            "publishedAt": "2024-09-25T15:39:13Z",
            "content": "Climate change is rapidly reshaping a region of the world thats home to millions of people.\r\nIn the next 30 years, Pacific Island nations such as Tuvalu, Kiribati, and Fiji will experience at least 8… [+5015 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Charlotte Morris",
            "title": "Study defines a safe operating space for major rivers in the Ganges Delta, India",
            "description": "An international study led by the University of Glasgow is the first to define a safe operating space (SOS) for major rivers in the Ganges Delta, which will enhance resilience in one of the world's most vulnerable deltas to global climate change.",
            "url": "https://phys.org/news/2024-09-safe-space-major-rivers-ganges.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/study-defines-a-safe-o.jpg",
            "publishedAt": "2024-09-25T19:50:58Z",
            "content": "An international study led by the University of Glasgow is the first to define a safe operating space (SOS) for major rivers in the Ganges Delta, which will enhance resilience in one of the world's m… [+3855 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "NASA",
            "title": "NASA analysis shows irreversible sea level rise for Pacific islands",
            "description": "In the next 30 years, Pacific Island nations such as Tuvalu, Kiribati, and Fiji will experience at least 8 inches (15 centimeters) of sea level rise, according to an analysis by NASA's sea level change science team. This amount of rise will occur regardless o…",
            "url": "https://phys.org/news/2024-09-nasa-analysis-irreversible-sea-pacific.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/nasa-analysis-shows-ir.jpg",
            "publishedAt": "2024-09-25T19:43:42Z",
            "content": "In the next 30 years, Pacific Island nations such as Tuvalu, Kiribati, and Fiji will experience at least 8 inches (15 centimeters) of sea level rise, according to an analysis by NASA's sea level chan… [+5238 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Ranjit Devraj",
            "title": "Climate scientists sound alarm over Asia's rising seas",
            "description": "Immediate action is needed at all levels to protect communities in the Asia Pacific from sea levels that are rising significantly faster than the global average, say climate scientists ahead of the next key UN climate summit.",
            "url": "https://phys.org/news/2024-09-climate-scientists-alarm-asia-seas.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/ocean.jpg",
            "publishedAt": "2024-09-25T18:57:04Z",
            "content": "Immediate action is needed at all levels to protect communities in the Asia Pacific from sea levels that are rising significantly faster than the global average, say climate scientists ahead of the n… [+4753 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Forbes"
            },
            "author": "Bill Frist, Contributor, \n Bill Frist, Contributor\n https://www.forbes.com/sites/billfrist/",
            "title": "Giving States The Tools To Decide For Themselves How To Fight Climate Change Is The Right Approach",
            "description": "Climate Pollution Reduction Grants enacted by Congress are giving states the tools to address their own unique climate and extreme weather needs.",
            "url": "https://www.forbes.com/sites/billfrist/2024/09/25/giving-states-the-tools-to-decide-for-themselves-how-to-fight-climate-change-is-the-right-approach/",
            "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/66f4431031aa236ed9489c76/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "publishedAt": "2024-09-25T17:20:53Z",
            "content": "Everyone across the country feels the effects of our changing climate, but were not all feeling them in the same way. In Tennessee, were seeing more heavy, sudden rain and flooding. Throughout the su… [+6414 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Forbes"
            },
            "author": "Cheryl Robinson, Contributor, \n Cheryl Robinson, Contributor\n https://www.forbes.com/sites/cherylrobinson/people/cherylrobinson5/",
            "title": "Sound Future CIO Shares The State Of Climate Career Opportunities",
            "description": "Working in climate change is more than manual labor; it’s understanding the industry and unveiling a positive impact. Kelci Zile of Sound Future shares her experience.",
            "url": "https://www.forbes.com/sites/cherylrobinson/2024/09/25/sound-future-cio-shares-the-state-of-climate-career-opportunities/",
            "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/66f42cf50560a03540522cd9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "publishedAt": "2024-09-25T15:45:06Z",
            "content": "Climate jobs are fast growing in the U.S. with individuals wanting to protect the planet. \r\ngetty\r\nSustainability initiatives are becoming more popular across corporate America. Advances in technolog… [+6877 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "University of New South Wales",
            "title": "Current economic system fails examination by sustainability experts",
            "description": "Our current economic system is based on poor science and should not be used to guide government decision-making when faced with threats to existence like climate change. That's the conclusion of a new paper led by UNSW Sydney sustainability scientists that fi…",
            "url": "https://phys.org/news/2024-09-current-economic-sustainability-experts.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/current-economic-syste.jpg",
            "publishedAt": "2024-09-25T16:40:14Z",
            "content": "Our current economic system is based on poor science and should not be used to guide government decision-making when faced with threats to existence like climate change. That's the conclusion of a ne… [+6679 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Da Vinci Labs",
            "title": "Researchers explore novel approach to map forest dieback in satellite images",
            "description": "Forests and woodlands cover one third of Earth's surface and play a critical role in carbon sequestration, water regulation, timber production, soil protection, and biodiversity conservation. Accelerated by climate change, the decline of these and other key f…",
            "url": "https://phys.org/news/2024-09-explore-approach-forest-dieback-satellite.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/researchers-explore-no.jpg",
            "publishedAt": "2024-09-25T20:15:03Z",
            "content": "Forests and woodlands cover one third of Earth's surface and play a critical role in carbon sequestration, water regulation, timber production, soil protection, and biodiversity conservation. Acceler… [+3386 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Science Daily"
            },
            "author": null,
            "title": "Harvests, wildfires, epidemics: How the jet stream has shaped extreme weather in Europe for centuries",
            "description": "Tree-ring data reveal that periodic shifts in strong winds high above the Earth's surface have driven opposite climates in different parts of Europe for the past 700 years and likely much longer, resulting in contrasting patterns in weather, agricultural and …",
            "url": "https://www.sciencedaily.com/releases/2024/09/240925122847.htm",
            "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png",
            "publishedAt": "2024-09-25T16:28:47Z",
            "content": "During her summer travels to her native Belgium, University of Arizona professor Valerie Trouet noticed something that turned casual curiosity into a major scientific discovery: When the sun hid behi… [+5789 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Manaaki Whenua - Landcare Research",
            "title": "Heat, animal illness and erosion risks to affect NZ agriculture with changing climate",
            "description": "Scientists at Manaaki Whenua—Landcare Research have worked closely with researchers from NIWA, AgResearch and Plant & Food Research to model the likely risks of a warming climate across different agricultural sectors in New Zealand. The study is published in …",
            "url": "https://phys.org/news/2024-09-animal-illness-erosion-affect-nz.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/dry-crops.jpg",
            "publishedAt": "2024-09-25T18:55:03Z",
            "content": "Scientists at Manaaki WhenuaLandcare Research have worked closely with researchers from NIWA, AgResearch and Plant &amp; Food Research to model the likely risks of a warming climate across different … [+3391 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Max Planck Institute for Demographic Research",
            "title": "Study finds extreme temperatures increase mortality rates, with heat disproportionately affecting minorities",
            "description": "A new study examined how extreme temperatures in the United States significantly affect mortality among different racial groups and found that both cold and hot days increase mortality rates, with the latter disproportionately affecting underrepresented popul…",
            "url": "https://phys.org/news/2024-09-extreme-temperatures-mortality-disproportionately-affecting.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/hardest-hit-by-heat.jpg",
            "publishedAt": "2024-09-25T20:02:43Z",
            "content": "A new study examined how extreme temperatures in the United States significantly affect mortality among different racial groups and found that both cold and hot days increase mortality rates, with th… [+3594 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Scientific American"
            },
            "author": "Andrea Thompson",
            "title": "Hurricane Helene Will Bring Strong Winds, Flash Flooding and Storm Surge",
            "description": "Hurricane Helene is a large storm set to bring substantial storm surge to the coast of Florida, as well as wind and rain-driven flooding up into Tennessee and South Carolina",
            "url": "https://www.scientificamerican.com/article/hurricane-helene-will-bring-strong-winds-flash-flooding-and-storm-surge/",
            "urlToImage": "https://static.scientificamerican.com/dam/m/567c82955c8e3001/original/florida_man_places_plywood_on_window_ahead_of_hurricane_helene.jpg?w=1200",
            "publishedAt": "2024-09-25T19:00:00Z",
            "content": "Hurricane season isn’t done with the Gulf Coast, it seems. Yet another storm, Helene, is heading for Florida a little more than two weeks after Francine walloped Louisiana. Helene is big—and is set t… [+5348 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Longreads.com"
            },
            "author": "Cheri Lucas Rowlands",
            "title": "Can Your Stomach Handle a Meal at Alchemist?",
            "description": "\"At the Copenhagen restaurant, diners are served raw jellyfish—and freeze-dried lamb brain served in a fake cranium—while videos about climate change swirl on the ceiling. Is it 'gastronomic opera,' or sensory overload?\"",
            "url": "http://longreads.com/2024/09/25/can-your-stomach-handle-a-meal-at-alchemist/",
            "urlToImage": null,
            "publishedAt": "2024-09-25T12:00:00Z",
            "content": "An eyeball. A human tongue. A bald head filled with brains. These are a few of the unconventional dishes served up at Alchemist, the restaurant of innovative Danish chef Rasmus Munk. Eating at this C… [+1841 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "CNA"
            },
            "author": null,
            "title": "How climate change can increase the risk of sinkholes — and survival tips you may need",
            "description": "With all the construction work underway in Singapore, the programme Talking Point explores the concerns about geological safety when it comes to sinkholes and finds out what you can do if the earth swallows you.",
            "url": "https://www.channelnewsasia.com/cna-insider/sinkholes-climate-change-increase-risk-survival-tips-safety-measures-4632846",
            "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--CI85CipN--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2024/09/25/picture4.jpg?itok=w8rq9IVm",
            "publishedAt": "2024-09-25T22:00:00Z",
            "content": "For example, when rainfall saturates the soil, it can undermine the integrity of the ground beneath Singapores concrete jungle. And with structural weakening, there is the potential for more holes in… [+859 chars]"
        },
        {
            "source": {
                "id": "cbs-news",
                "name": "CBS News"
            },
            "author": "CBS News",
            "title": "Helene gaining strength from climate change effects",
            "description": "Tropical Storm Helene is gaining strength from warmer waters in the Gulf of Mexico, an effect linked to climate change that appears to make hurricanes and storms more powerful. CBS News Los Angeles meteorologist Marina Jurica has more.",
            "url": "https://www.cbsnews.com/video/helene-is-getting-stronger-from-climate-change-effects/",
            "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/25/5f331436-69c0-42bc-962b-a4433a9c3b57/thumbnail/1200x630/b9befe5ceff27b19c09975a863ffd2e7/cbsn-fusion-helene-is-getting-stronger-from-climate-change-effects-thumbnail.jpg?v=36448e13600c4b59440e954caff28fc1",
            "publishedAt": "2024-09-25T15:22:00Z",
            "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Science X",
            "title": "UN chief says sea level rise threatens 'rising tide of misery'",
            "description": "United Nations Secretary-General Antonio Guterres warned on Wednesday that rising sea levels threaten to create \"a rising tide of misery\" for millions, with intense storm surges, coastal erosion and coastal flooding increasingly likely.",
            "url": "https://phys.org/news/2024-09-chief-sea-threatens-tide-misery.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/since-the-start-of-the.jpg",
            "publishedAt": "2024-09-25T14:38:27Z",
            "content": "United Nations Secretary-General Antonio Guterres warned on Wednesday that rising sea levels threaten to create \"a rising tide of misery\" for millions, with intense storm surges, coastal erosion and … [+1486 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Dezeen"
            },
            "author": "Ruby Betts",
            "title": "Ten student design projects selected from Dezeen's Pinterest",
            "description": "As the 2024/2025 academic year begins, we present some of the most striking and intriguing design projects from last year's students that feature on the Dezeen School Shows Pinterest board. Read more",
            "url": "https://www.dezeen.com/2024/09/25/design-projects-students-dezeens-pinterest-schoolshow/",
            "urlToImage": "https://static.dezeen.com/uploads/2024/09/pinterst-roundup-hero-sq-dezeen-schoolshows_dezeen_2364_col_1-600x600.jpg",
            "publishedAt": "2024-09-25T16:00:18Z",
            "content": "As the 2024/2025 academic year begins, we present some of the most striking and intriguing design projects from last year's students that feature on the Dezeen School Shows Pinterest board.\r\nThis rou… [+4866 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Space.com"
            },
            "author": "Monisha Ravisetti",
            "title": "Hurricane Helene could yield major flooding, tornadoes and 'devastating' winds, experts warn",
            "description": "Tropical Storm Helene reached hurricane status on Wednesday (Sept. 25), and scientists warn that its damage could be life-threatening.",
            "url": "https://www.space.com/hurricane-helene-storm-september-2024",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/xFwpjbYnshXHoAiKwKurEP-1200-80.gif",
            "publishedAt": "2024-09-25T17:48:23Z",
            "content": "On Wednesday (Sept. 25), the U.S. National Hurricane Center (NHC) announced that Helene — a major storm currently inundating Mexico's Yucatan Peninsula and Western Cuba —  has reached Category 1 hurr… [+4526 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Anne BEADE, Kiyoko METZLER with AFP bureaus",
            "title": "Restoring nature, 'adaptation' helped limit Storm Boris impact",
            "description": "The restoration of a creek in Vienna reduced the impact of flooding caused by Storm Boris, authorities say, one of many projects experts believe helped central Europe endure the deluge better than in previous years.",
            "url": "https://phys.org/news/2024-09-nature-limit-storm-boris-impact.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/austrian-officials-say.jpg",
            "publishedAt": "2024-09-25T16:50:01Z",
            "content": "The restoration of a creek in Vienna reduced the impact of flooding caused by Storm Boris, authorities say, one of many projects experts believe helped central Europe endure the deluge better than in… [+4522 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "University of Melbourne",
            "title": "Climatologists develop more accurate El Niño Southern Oscillation forecasts",
            "description": "Australian climatologists closely monitor atmospheric and oceanic conditions to assess the risk of El Niño Southern Oscillation (ENSO) events occurring, which can lead to devastating natural disasters, however these predictions have become somewhat delayed in…",
            "url": "https://phys.org/news/2024-09-climatologists-accurate-el-nio-southern.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/storm-clouds.jpg",
            "publishedAt": "2024-09-25T16:50:01Z",
            "content": "Australian climatologists closely monitor atmospheric and oceanic conditions to assess the risk of El Niño Southern Oscillation (ENSO) events occurring, which can lead to devastating natural disaster… [+4165 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Forbes"
            },
            "author": "Jamie Hailstone, Contributor, \n Jamie Hailstone, Contributor\n https://www.forbes.com/sites/jamiehailstone/",
            "title": "Shipping Off Track To Meet Zero-Emission Fuel Target, Study Warns",
            "description": "The study warns the next 12 months are critical to avoid shipping falling behind its climate goals.",
            "url": "https://www.forbes.com/sites/jamiehailstone/2024/09/25/shipping-off-track-to-meet-zero-emission-fuel-target-study-warns/",
            "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/66f3c63bf8e186cd542f83fd/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "publishedAt": "2024-09-25T08:47:02Z",
            "content": "OAKLAND, CA - AUGUST 16: Container ships are positioned under cranes at the Port of Oakland August ... [+] 16, 2010 in Oakland, California. The International Monetary Fund is predicting that China wi… [+4318 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "MIT Technology Review"
            },
            "author": "Rhiannon Williams",
            "title": "The Download: how to connect the US’s grids, and OpenAI’s new voice mode",
            "description": "This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. Why one developer won’t quit fighting to connect the US’s grids Michael Skelly hasn’t learned to take no for an answer. F…",
            "url": "https://www.technologyreview.com/2024/09/25/1104462/the-download-how-to-connect-the-uss-grids-and-openais-new-voice-mode/",
            "urlToImage": "https://wp.technologyreview.com/wp-content/uploads/2024/09/240924_TheWesternSpirittransmissionline_embed.jpg?resize=1200,600",
            "publishedAt": "2024-09-25T12:10:00Z",
            "content": "Michael Skelly hasnt learned to take no for an answer. For much of the last 15 years, the energy entrepreneur has worked to develop long-haul transmission lines to carry wind power across the Great P… [+1461 chars]"
        },
        {
            "source": {
                "id": "al-jazeera-english",
                "name": "Al Jazeera English"
            },
            "author": "Al Jazeera",
            "title": "Ecuador battles wildfires near capital as drought grips South America",
            "description": "About 2,000 firefighters, rescue workers and members of the military are fighting blazes around Quito.",
            "url": "https://www.aljazeera.com/news/2024/9/25/ecuador-battles-wildfires-near-capital-as-drought-grips-south-america",
            "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/09/2024-09-25T173949Z_470808282_RC2O7AACUV1I_RTRMADP_3_ECUADOR-WILDFIRE-1727302888.jpg?resize=1920%2C1440",
            "publishedAt": "2024-09-25T22:50:26Z",
            "content": "Firefighters in Ecuador are working to contain a number of wildfires outside the countrys capital, as several South American nations struggle with the effects of widespread drought and record-setting… [+2617 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Metafilter.com"
            },
            "author": "chariot pulled by cassowaries",
            "title": "Lamprey fish found in Queensland waterways",
            "description": "Lamprey fish found in Queensland waterways. The finding bucks the belief that lamprey fish live in cold climates and gives researchers hope the species could be resistant to climate change.",
            "url": "https://www.metafilter.com/205639/Lamprey-fish-found-in-Queensland-waterways",
            "urlToImage": "https://cdn.mefi.us/images/mefi/apple-touch-icon.png",
            "publishedAt": "2024-09-25T15:33:04Z",
            "content": "MetaFilter is a weblog that anyone can contribute a link or a comment to. A typical weblog is one person posting their thoughts on the unique things they find on the web. This website exists to break… [+120 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "UK Centre for Ecology & Hydrology",
            "title": "Scientists' win-win solutions to global nitrogen crisis are good for the pocket and planet",
            "description": "The most comprehensive scientific review of the global nitrogen cycle has outlined 150 \"win-win\" measures to significantly reduce nitrogen pollution while saving billions in costs across a range of industries.",
            "url": "https://phys.org/news/2024-09-scientists-solutions-global-nitrogen-crisis.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/cows-1.jpg",
            "publishedAt": "2024-09-25T19:40:27Z",
            "content": "The most comprehensive scientific review of the global nitrogen cycle has outlined 150 \"win-win\" measures to significantly reduce nitrogen pollution while saving billions in costs across a range of i… [+5946 chars]"
        },
        {
            "source": {
                "id": "cbs-news",
                "name": "CBS News"
            },
            "author": "Grace Manthey",
            "title": "Quiz: See how your views on climate change compare to others in your area",
            "description": "A Yale poll found two-thirds of Americans say they're worried about climate change. Answer questions from the survey to see how your views compare to others in your area and the nation.",
            "url": "https://www.cbsnews.com/news/climate-change-survey-questions/",
            "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2020/08/24/dbd9f2fd-cd8d-4374-bd01-6ea24ad713b2/thumbnail/1200x630/06cece67d44e4021256586d83eeba1b8/climate-split.jpg?v=36448e13600c4b59440e954caff28fc1",
            "publishedAt": "2024-09-25T11:10:00Z",
            "content": "About two-thirds of Americans say they are worried about climate change. Nearly 8 in 10 Americans support funding research into renewable energy, and 3 out of 4 support regulating carbon emissions. M… [+1430 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "University of Arizona",
            "title": "Tree-ring data reveal how the jet stream has shaped extreme weather in Europe for centuries",
            "description": "During her summer travels to her native Belgium, University of Arizona professor Valerie Trouet noticed something that turned casual curiosity into a major scientific discovery: when the sun hid behind an overcast sky and people around her put on sweaters ins…",
            "url": "https://phys.org/news/2024-09-tree-reveal-jet-stream-extreme.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/harvests-wildfires-epi.jpg",
            "publishedAt": "2024-09-25T15:00:01Z",
            "content": "During her summer travels to her native Belgium, University of Arizona professor Valerie Trouet noticed something that turned casual curiosity into a major scientific discovery: when the sun hid behi… [+6495 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Forbes"
            },
            "author": "Chris Perugini, Contributor, \n Chris Perugini, Contributor\n https://www.forbes.com/sites/chrisperugini/",
            "title": "In Search Of Texas Whiskey’s True Identity",
            "description": "Extreme climate conditions in Texas have a unique effect on the maturation of whiskey. An exploration of local distilleries reveals the identity struggle of Texas whiskey.",
            "url": "https://www.forbes.com/sites/chrisperugini/2024/09/25/in-search-of-texas-whiskeys-true-identity/",
            "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/66f41b69dfec6ec168f11006/0x0.jpg?format=jpg&crop=6103,3435,x0,y369,safe&height=900&width=1600&fit=bounds",
            "publishedAt": "2024-09-25T14:42:23Z",
            "content": "The \"Dance Hall\" warehouse at Garrison Brothers Distillery\r\nChris Perugini\r\nIts 10:00 am on a clear August morning in the Texas Hill Country and it is already abundantly clear that consumption of dir… [+8843 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Science X",
            "title": "Six hurt in Ecuador as firefighters battle blazes choking capital",
            "description": "Firefighters and helicopters were battling five forest fires Wednesday on the outskirts of Quito that have left six people injured and led to the evacuation of over 100 families.",
            "url": "https://phys.org/news/2024-09-ecuador-firefighters-blazes-capital.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/smoke-from-a-bushfire.jpg",
            "publishedAt": "2024-09-25T17:00:01Z",
            "content": "Firefighters and helicopters were battling five forest fires Wednesday on the outskirts of Quito that have left six people injured and led to the evacuation of over 100 families.\r\nAsh and smoke from … [+2855 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Nakedcapitalism.com"
            },
            "author": "Yves Smith",
            "title": "How Cities Run Dry",
            "description": "How afflicted cities are trying to cope with water shortages.",
            "url": "https://www.nakedcapitalism.com/2024/09/how-cities-run-dry.html",
            "urlToImage": "https://www.nakedcapitalism.com/wp-content/uploads/2024/09/00-water-.webp",
            "publishedAt": "2024-09-25T10:36:49Z",
            "content": "Yves here. Yours truly has been under-reporting in Links the number and severity of bad climate change effect stories, since if I did merely a pretty good job, they would eat up all of Links. On top … [+8294 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Science X",
            "title": "Storm Helene on track to hit Florida as major hurricane",
            "description": "The US state of Florida on Tuesday was preparing for the arrival of Storm Helene, due to make landfall later in the week as a powerful Category 3 hurricane.",
            "url": "https://phys.org/news/2024-09-storm-helene-track-florida-major.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/people-secure-their-bo.jpg",
            "publishedAt": "2024-09-25T08:09:30Z",
            "content": "The US state of Florida on Tuesday was preparing for the arrival of Storm Helene, due to make landfall later in the week as a powerful Category 3 hurricane.\r\nHelene, currently churning over the Carib… [+1978 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Grist"
            },
            "author": "Gautama Mehta",
            "title": "Net-zero targets are everywhere. But to be effective, they need accountability.",
            "description": "Without a single standard, countries and companies are promising a lot of different things.",
            "url": "http://grist.org/accountability/net-zero-targets-are-everywhere-but-to-be-effective-they-need-accountability/",
            "urlToImage": "https://grist.org/wp-content/uploads/2024/09/net-zero.jpg?quality=75&strip=all",
            "publishedAt": "2024-09-25T08:15:00Z",
            "content": "Averting a worst-case global warming scenario will require the worlds largest institutions to reduce their emissions of greenhouse gases, and do it fast. Over the last decade and a half, a standard f… [+5058 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Vox"
            },
            "author": "Benji Jones",
            "title": "One chart shows how Hurricane Helene could turn into a monstrous storm",
            "description": "An enormous tropical storm named Helene, now a Category 1 hurricane, is churning across the Caribbean near Cuba and Mexico’s Yucatan Peninsula. Forecasters predict the hurricane — which as of Wednesday morning has maximum sustained winds of 80 miles per hour …",
            "url": "https://www.vox.com/climate/373874/hurricane-helene-florida-forecast-warm-ocean-water",
            "urlToImage": "https://platform.vox.com/wp-content/uploads/sites/2/2024/09/1250x750-1.jpg?quality=90&strip=all&crop=21.60390625,39.361307576129,59.30859375,52.848494304183",
            "publishedAt": "2024-09-25T16:33:05Z",
            "content": "An enormous tropical storm named Helene, now a Category 1 hurricane, is churning across the Caribbean near Cuba and Mexicos Yucatan Peninsula. Forecasters predict the hurricane which as of Wednesday … [+3893 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "TechSpot"
            },
            "author": "Alfonso Maruccia",
            "title": "Ocean acidification is approaching a new critical phase, scientists warn",
            "description": "According to the latest study from the Potsdam Institute for Climate Impact Research (PIK), ocean acidification is approaching a critical threshold. The researchers warn that the seventh planetary boundary has almost been breached, making it extremely difficu…",
            "url": "https://www.techspot.com/news/104864-ocean-acidification-approaching-new-critical-phase-scientists-warn.html",
            "urlToImage": "https://www.techspot.com/images2/news/bigimage/2024/09/2024-09-25-image-31.jpg",
            "publishedAt": "2024-09-25T19:44:00Z",
            "content": "TL;DR: A new report on planetary boundaries indicates that we are nearing a dangerous threshold that could render Earth's environment unsustainable for human life. Ocean waters are rapidly decreasing… [+2718 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Maryam Imani",
            "title": "Opinion: Torrential rain represents an opportunity to build a better society",
            "description": "A month's worth of rain has poured down in just a few hours in parts of central and southern England. More than 300 flood-related emergency calls were made, major roads were submerged, trains were delayed, and an enormous sinkhole opened up on a football pitc…",
            "url": "https://phys.org/news/2024-09-opinion-torrential-opportunity-society.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/rain-water.jpg",
            "publishedAt": "2024-09-25T20:57:04Z",
            "content": "A month's worth of rain has poured down in just a few hours in parts of central and southern England. More than 300 flood-related emergency calls were made, major roads were submerged, trains were de… [+5619 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Dartmouth College",
            "title": "Ice cores show pollution's impact on Arctic atmosphere",
            "description": "A Dartmouth-led study on ice cores from Alaska and Greenland found that air pollution from the burning of fossil fuels reaches the remote Arctic in amounts large enough to alter its fundamental atmospheric chemistry. The findings illustrate the long reach of …",
            "url": "https://phys.org/news/2024-09-ice-cores-pollution-impact-arctic.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/ice-cores-show-polluti.jpg",
            "publishedAt": "2024-09-25T18:07:04Z",
            "content": "A Dartmouth-led study on ice cores from Alaska and Greenland found that air pollution from the burning of fossil fuels reaches the remote Arctic in amounts large enough to alter its fundamental atmos… [+7496 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Forbes"
            },
            "author": "Mary Meehan, Contributor, \n Mary Meehan, Contributor\n https://www.forbes.com/sites/marymeehan/",
            "title": "What If We’re Not As Divided And Polarized As We Think?",
            "description": "Social and news media may have led us to believe we are more divided than we are. It turns out, we all share more values and have more in common than we think.",
            "url": "https://www.forbes.com/sites/marymeehan/2024/09/25/what-if-were-not-as-divided-and-polarized-as-we-think/",
            "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/66f46a9c91ef2cf45fe102b0/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "publishedAt": "2024-09-25T20:17:33Z",
            "content": "The difference between being blue and red is not as distinct as we think. \r\nKatelyn Perry-NP8Go-KkeSs-unsplash\r\nAs we get closer and closer to the election, the insults are getting more heated, and t… [+4760 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "The Conversation Africa"
            },
            "author": "Olga Anikeeva, Research Fellow, School of Public Health, University of Adelaide, Jessica Stanhope, Lecturer, School of Allied Health Science and Practice, University of Adelaide, Peng Bi, Professor, School of Public Health, University of Adelaide, Philip Weinstein, Professorial Research Fellow, School of Public Health, University of Adelaide",
            "title": "Why are we seeing more pandemics? Our impact on the planet has a lot to do with it",
            "description": "When human activities disrupt and unbalance ecosystems, such as by way of climate change and biodiversity loss, things go wrong.",
            "url": "https://theconversation.com/why-are-we-seeing-more-pandemics-our-impact-on-the-planet-has-a-lot-to-do-with-it-226827",
            "urlToImage": "https://images.theconversation.com/files/604248/original/file-20240702-17-ozb5m3.jpg?ixlib=rb-4.1.0&rect=0%2C0%2C6375%2C3187&q=45&auto=format&w=1356&h=668&fit=crop",
            "publishedAt": "2024-09-25T20:34:39Z",
            "content": "ImageFlow/Shutterstock\r\nPandemics – the global spread of infectious diseases – seem to be making a comeback. In the Middle Ages we had the Black Death (plague), and after the first world war we had t… [+6563 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Insurance Journal"
            },
            "author": "Admin",
            "title": "Climate Change Made Europe’s Deadly Floods Worse and More Likely",
            "description": "Record rainfall leading to flooding that killed 24 people in Europe earlier in September was twice as likely due to manmade climate change, a study has found. The flooding took place across central Europe after Storm Boris stalled over the …",
            "url": "https://www.insurancejournal.com/news/international/2024/09/25/794288.htm",
            "urlToImage": "https://www.insurancejournal.com/app/uploads/2024/09/river-gauge-shows-level-of-rising-oder-river-in-germany-getty-scaled.jpg",
            "publishedAt": "2024-09-25T08:09:34Z",
            "content": "Record rainfall leading to flooding that killed 24 people in Europe earlier in September was twice as likely due to manmade climate change, a study has found.\r\nThe flooding took place across central … [+2337 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "The Federalist"
            },
            "author": "Paula Rinehart",
            "title": "3 Ways Democrats Manipulate Christians’ Goodwill For Partisan Ends",
            "description": "A stream of faith leaders have lined up behind leftist issues, such as climate change, ongoing vaccinations, and immigration.",
            "url": "https://thefederalist.com/2024/09/25/3-ways-democrats-manipulate-christians-goodwill-for-partisan-ends/",
            "urlToImage": "https://thefederalist.com/wp-content/uploads/2024/09/Screenshot-2024-09-23-at-11.03.02 AM-1024x600.png",
            "publishedAt": "2024-09-25T11:26:50Z",
            "content": "Professing evangelical David French made heads spin recently when his New York Times opinion article claimed that the way to save conservatism was to elect Kamala Harris, the most radical pro-abortio… [+7123 chars]"
        },
        {
            "source": {
                "id": "newsweek",
                "name": "Newsweek"
            },
            "author": "Rachel Dobkin",
            "title": "Climate Change Doubled Likelihood, Intensified Deadly Europe Floods: Study",
            "description": "The rainfall was \"by far\" the heaviest ever recorded in central Europe, according to World Weather Attribution.",
            "url": "https://www.newsweek.com/europe-floods-climate-change-study-1959227",
            "urlToImage": "https://d.newsweek.com/en/full/2480265/europe-floods.jpg",
            "publishedAt": "2024-09-25T15:15:46Z",
            "content": "A new study found that human-caused climate change doubled the likelihood and intensified the heavy rains that led to the recent deadly floods in Europe.\r\nEarlier this month, central Europe—including… [+3980 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Gianrigo MARLETTA",
            "title": "Florida girds for arrival of Helene as powerful hurricane",
            "description": "Thousands of residents on Wednesday began evacuating parts of coastal Florida as the US state braces for Hurricane Helene, forecast to barrel ashore as a powerful, potentially deadly storm.",
            "url": "https://phys.org/news/2024-09-florida-girds-helene-powerful-hurricane.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/this-image-from-the-na.jpg",
            "publishedAt": "2024-09-25T17:10:04Z",
            "content": "Thousands of residents on Wednesday began evacuating parts of coastal Florida as the US state braces for Hurricane Helene, forecast to barrel ashore as a powerful, potentially deadly storm.\r\nHelene s… [+3589 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Wattsupwiththat.com"
            },
            "author": "Anthony Watts",
            "title": "Climate Change goes SkyNet. Bigger computers, more power, to ‘make decisions’ for us.",
            "description": "From the Climatic SkyNet department comes news of this upcoming climate-model-supercomputer hootenanny at the University of Illinois in October. What could go wrong if we let a supercomputer make decisions for us?",
            "url": "https://wattsupwiththat.com/2024/09/24/climate-change-goes-skynet-bigger-computers-more-power-to-make-decisions-for-us/",
            "urlToImage": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2024/09/climate-model-countdown.webp?fit=1024%2C434&ssl=1",
            "publishedAt": "2024-09-25T01:00:00Z",
            "content": "From the Climatic SkyNet department comes news of this upcoming climate-model-supercomputer hootenanny at the University of Illinois next week. What could go wrong if we let a supercomputer make deci… [+5118 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Project Syndicate"
            },
            "author": "Sanjay Kathuria",
            "title": "Pakistan Should Restructure Its Debt Now",
            "description": "Even though the Pakistani government now appears to recognize its debt problem, it has failed to acknowledge the severity of the situation. Instead of seeking a debt reprofiling or taking yet another loan from the IMF, the country must undertake a preemptive …",
            "url": "https://www.project-syndicate.org/commentary/pakistan-needs-public-debt-restructuring-by-sanjay-kathuria-1-2024-09",
            "urlToImage": "https://webapi.project-syndicate.org/library/c9c90c96d02d761201c6cb94dce177aa.2-1-super.1.jpg",
            "publishedAt": "2024-09-25T08:05:40Z",
            "content": "Even though the Pakistani government now appears to recognize its debt problem, it has failed to acknowledge the severity of the situation. Instead of seeking a debt reprofiling or taking yet another… [+6256 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Project Syndicate"
            },
            "author": "Kaushik Basu",
            "title": "Economics, Empathy, and the US Election",
            "description": "Although both Kamala Harris and Donald Trump’s policies are expected to increase US deficits and debt over the next decade, the consequences of Trump’s proposed tariffs threaten to cause far more damage. At a time of heightened uncertainty, the United States …",
            "url": "https://www.project-syndicate.org/commentary/why-kamala-harris-better-leader-than-donald-trump-by-kaushik-basu-2024-09",
            "urlToImage": "https://webapi.project-syndicate.org/library/5935a5fd8876fdaf3169ff52aa0d56bb.2-1-super.1.jpg",
            "publishedAt": "2024-09-25T09:16:12Z",
            "content": "Although both Kamala Harris and Donald Trumps policies are expected to increase US deficits and debt over the next decade, the consequences of Trumps proposed tariffs threaten to cause far more damag… [+5583 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Foreign Policy"
            },
            "author": "Amy Mackinnon and Jack Detsch",
            "title": "The United Nations Is Still the Biggest Platform for Global Cooperation",
            "description": "Despite its failure to stop wars, the U.N. has made progress on issues from disease eradication to climate change.",
            "url": "https://foreignpolicy.com/2024/09/25/the-united-nations-is-still-the-biggest-platform-for-global-cooperation/",
            "urlToImage": "https://foreignpolicy.com/wp-content/uploads/2024/09/GettyImages-2173566683.jpg?w=1000",
            "publishedAt": "2024-09-25T23:45:02Z",
            "content": "Welcome back to Foreign Policys Situation Report. Its day three of the high-level week here at the United Nations, and everything is still gridlocked, from the traffic outside to the Security Council… [+12205 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Niels Bohr Institute",
            "title": "Do you feel eco-guilt or eco-shame? Emotions reveal how much we care about the environment",
            "description": "Air travel, meat in the shopping cart, waste sorting, plastic toys—consumers are faced with a barrage of everyday decisions and priorities when navigating environmental concerns. But what drives these choices?",
            "url": "https://phys.org/news/2024-09-eco-guilt-shame-emotions-reveal.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/shame.jpg",
            "publishedAt": "2024-09-25T18:52:04Z",
            "content": "Air travel, meat in the shopping cart, waste sorting, plastic toysconsumers are faced with a barrage of everyday decisions and priorities when navigating environmental concerns. But what drives these… [+5247 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Hoover.org"
            },
            "author": "September 25, 2024",
            "title": "Climate Change Is Not an Apocalyptic Threat— Let’s Address It Smartly",
            "description": "“Climate Change Is Not an Apocalyptic Threat—Let’s Address It Smartly,” an essay by Bjorn Lomborg, challenges the widespread belief that climate change poses an existential threat to humanity. Lomborg argues for a more measured approach to addressing climate …",
            "url": "https://www.hoover.org/research/climate-change-not-apocalyptic-threat-lets-address-it-smartly-0",
            "urlToImage": "https://www.hoover.org/sites/default/files/styles/facebook/public/research/images/thinkstockphotos-186964421.jpg?itok=OTTyH3gR",
            "publishedAt": "2024-09-25T00:00:00Z",
            "content": "Climate Change Is Not an Apocalyptic ThreatLets Address It Smartly, an essay by Bjorn Lomborg, challenges the widespread belief that climate change poses an existential threat to humanity. Lomborg ar… [+201 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "VOA News"
            },
            "author": "VOA",
            "title": "Climate change doubles chance of floods like those in Central Europe, report says",
            "description": "WARSAW, Poland — Climate change has made downpours like the one that caused devastating floods in central Europe this month twice as likely to occur, a report said on Wednesday, as its scientific authors urged policymakers to act to stop global warming.\n\n\nThe…",
            "url": "https://www.voanews.com/a/climate-change-doubles-chance-of-floods-like-those-in-central-europe-report-says/7798449.html",
            "urlToImage": "https://gdb.voanews.com/CB6350B3-DF0B-4CAC-8F10-CCF45BFEBA00.jpg",
            "publishedAt": "2024-09-25T03:52:09Z",
            "content": "WARSAW, Poland  Climate change has made downpours like the one that caused devastating floods in central Europe this month twice as likely to occur, a report said on Wednesday, as its scientific auth… [+1687 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Globalsecurity.org"
            },
            "author": "John Pike",
            "title": "At UN meetings, China focuses on Taiwan, security, climate change",
            "description": "This year's United Nations General Assembly meeting, which opened Tuesday, takes place against a backdrop of intense competition between the United States and China, mounting geopolitical and security challenges, and pressing issues such as climate change and…",
            "url": "https://www.globalsecurity.org/wmd/library/news/china/2024/09/china-240924-voa01.htm",
            "urlToImage": null,
            "publishedAt": "2024-09-25T07:40:51Z",
            "content": "By Legu Zhang September 24, 2024\r\nThis year's United Nations General Assembly meeting, which opened Tuesday, takes place against a backdrop of intense competition between the United States and China,… [+5651 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Wattsupwiththat.com"
            },
            "author": "Anthony Watts",
            "title": "Media Confirms the Earth Is Not Abnormally Warm, Rather It Is in Its Coldest Period in 485 Million Years",
            "description": "All of these media outlets predict doom and gloom in our immediate future due to climate change, but in doing so, they completely ignore the bigger picture presented by the study.",
            "url": "https://wattsupwiththat.com/2024/09/25/media-confirms-the-earth-is-not-abnormally-warm-rather-it-is-in-its-coldest-period-in-485-million-years/",
            "urlToImage": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2024/09/wapo-485-million.webp?fit=628%2C512&ssl=1",
            "publishedAt": "2024-09-25T17:00:00Z",
            "content": "Recently, many media outlets touted a new scientific study A 485-million-year history of Earths surface temperature as proof that the current modest rise in temperature over the last 150 years is goi… [+6687 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "NASA"
            },
            "author": "Milan Loiacono",
            "title": "2024 SARP West Atmospheric Aerosols Group",
            "description": "Faculty Advisors: Dr. Andreas Beyersdorf, California State University, San Bernardino & Dr. Ann Marie Carlton, University of California Graduate Mentor: Madison Landi, University of California, Irvine Madison Landi, Graduate Mentor Maya Niyogi A Comparative A…",
            "url": "https://www.nasa.gov/general/2024-sarp-west-atmospheric-aerosols-group/",
            "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/08/sarpwest2024-loiacono-1505.jpg",
            "publishedAt": "2024-09-25T21:08:11Z",
            "content": "Faculty Advisors: Dr. Andreas Beyersdorf, California State University, San Bernardino &amp; Dr. Ann Marie Carlton, University of California\r\nGraduate Mentor: Madison Landi, University of California, … [+10513 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Project Syndicate"
            },
            "author": "Stephen S. Roach",
            "title": "China Is Missing in America’s Election Debate",
            "description": "The US presidential campaign has mostly avoided discussion about what could well be America’s most consequential foreign-policy issue of the twenty-first century: relations with China. Shouldn’t the candidates be pushed to debate constructive solutions to the…",
            "url": "https://www.project-syndicate.org/commentary/us-presidential-campaign-harris-trump-overlooking-china-by-stephen-s-roach-2024-09",
            "urlToImage": "https://webapi.project-syndicate.org/library/d55b5d1a14d7017e494487591927ebf4.2-1-super.1.jpg",
            "publishedAt": "2024-09-25T16:18:12Z",
            "content": "The US presidential campaign has mostly avoided discussion about what could well be Americas most consequential foreign-policy issue of the twenty-first century: relations with China. Shouldnt the ca… [+6493 chars]"
        },
        {
            "source": {
                "id": "newsweek",
                "name": "Newsweek"
            },
            "author": null,
            "title": "As Hurricane Helene Hits Florida, Trump's Climate Policy Ducks for Cover | Opinion",
            "description": "A massive storm, Hurricane Helene, made larger and more destructive due to super-heated ocean temperatures caused by climate change, is due to slam into Florida Thursday.",
            "url": "https://www.newsweek.com/hurricane-helene-hits-florida-trumps-climate-policy-ducks-cover-opinion-1959405",
            "urlToImage": "https://d.newsweek.com/en/full/2480586/getting-ready.jpg",
            "publishedAt": "2024-09-25T20:51:55Z",
            "content": "A massive storm, Hurricane Helene, made larger and more destructive due to super-heated ocean temperatures caused by climate change, is due to slam into Florida Thursday. The enormity of this storm (… [+5308 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Hoover.org"
            },
            "author": "September 25, 2024",
            "title": "Climate Change Is Not an Apocalyptic Threat— Let’s Address It Smartly",
            "description": "Among people in rich countries, 60 percent believe unmitigated climate change will lead to the end of humanity. This is highly misleading: climate change is a problem, but not the end of the world. Strong climate policies have much greater costs than benefits…",
            "url": "https://www.hoover.org/research/climate-change-not-apocalyptic-threat-lets-address-it-smartly",
            "urlToImage": "https://www.hoover.org/sites/default/files/styles/facebook/public/research/images/gettyimages_174525514.jpg?h=d3e64048&itok=RtdbiZ3X",
            "publishedAt": "2024-09-25T00:00:00Z",
            "content": "Dr. Bjorn Lomborg, visiting fellow at the Hoover Institution, researches the smartest ways to do good. With his think tank, the Copenhagen Consensus, he has worked with hundreds of the worlds top eco… [+166 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "NASA"
            },
            "author": "Milan Loiacono",
            "title": "SARP West 2024 Terrestrial Ecology Group",
            "description": "Faculty Advisor: Dr. Dan Sousa, San Diego State University Graduate Mentor: Megan Ward-Baranyay, San Diego State University Megan Ward-Baranyay, Graduate Mentor Gerrit Hoving Predicting Ammonia Plume Presence at Feedlots in the San Joaquin Valley from VSWIR S…",
            "url": "https://www.nasa.gov/general/sarp-west-2024-terrestrial-ecology-group/",
            "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/08/sarpwest2024-loiacono-1509.jpg",
            "publishedAt": "2024-09-25T21:08:29Z",
            "content": "Faculty Advisor: Dr. Dan Sousa, San Diego State University\r\nGraduate Mentor: Megan Ward-Baranyay, San Diego State University\r\nMegan Ward Baranyay, graduate student mentor for the 2024 SARP West Land … [+12378 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Wattsupwiththat.com"
            },
            "author": "Guest Blogger",
            "title": "The New Campaign for Climate Patriotism",
            "description": "This allegedly scientific study is not about preserving our way of life. But it certainly provides a base from which to launch a barrage of new messaging.",
            "url": "https://wattsupwiththat.com/2024/09/25/the-new-campaign-for-climate-patriotism/",
            "urlToImage": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2024/09/Kamala_Harris__I_Want_to_Hear_From_You__cropped.webp?fit=1024%2C512&ssl=1",
            "publishedAt": "2024-09-25T21:00:00Z",
            "content": "By Michael O’Sullivan\r\nWhen I wrote last week on the clever (and misleading) statement from Vice President Harris linking the pursuit of diverse energy sources with freedom from foreign oil dependenc… [+4881 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Hoover.org"
            },
            "author": "September 25, 2024",
            "title": "The Factual Context for Climate and Energy Policy",
            "description": "“The Factual Context for Climate and Energy Policy,” an essay by Steven E. Koonin, reviews scientific, economic, and societal facts that should inform climate and energy policy decisions. Koonin argues that large and rapid reductions in emissions are unnecess…",
            "url": "https://www.hoover.org/research/factual-context-climate-and-energy-policy-0",
            "urlToImage": "https://www.hoover.org/sites/default/files/styles/facebook/public/greenworld_141219210.jpg?itok=Vy0hScGL",
            "publishedAt": "2024-09-25T00:00:00Z",
            "content": "The Factual Context for Climate and Energy Policy, an essay by Steven E. Koonin, reviews scientific, economic, and societal facts that should inform climate and energy policy decisions. Koonin argues… [+261 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "BBC News"
            },
            "author": null,
            "title": "UK economic growth 'robust' in 2024, think tank says",
            "description": "A think tank says it expects UK economic growth grow by 1.1%, the same rate as Canada and France.",
            "url": "https://www.bbc.com/news/articles/c0lw07l7p70o",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/a4ca/live/8c52b690-7acd-11ef-a8be-850b207eb8c2.jpg",
            "publishedAt": "2024-09-25T09:57:10Z",
            "content": "The UK has risen in the rankings of a group of wealthy nations to have the joint-second highest economic growth for this year, a think tank has predicted.\r\nThe economy is now expected to grow by 1.1%… [+2488 chars]"
        },
        {
            "source": {
                "id": "cbs-news",
                "name": "CBS News"
            },
            "author": "Alex Sundby, David Yeomans",
            "title": "Hurricane Helene on path for Florida with significant strengthening expected",
            "description": "Helene​ strengthened into a hurricane as it was leaving the Caribbean Sea on a path​ for Florida's Gulf Coast.",
            "url": "https://www.cbsnews.com/news/hurricane-helene-path-florida/",
            "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/09/25/bdfb1a4c-1e91-46dc-9c34-99e0f958e129/thumbnail/1200x630/f21eb07915ccc61a9f5bf7b30465cd59/tropical-storm-helene-20240925-910.jpg?v=36448e13600c4b59440e954caff28fc1",
            "publishedAt": "2024-09-25T15:08:18Z",
            "content": "Helene strengthened into a hurricane Wednesday as it was leaving the Caribbean Sea on a path for Florida's Gulf Coast. The hurricane was expected to become more powerful as it moves through the warm … [+2626 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Sally Younger",
            "title": "Arctic sea ice near historic low; Antarctic ice continues decline",
            "description": "Arctic sea ice retreated to near-historic lows in the Northern Hemisphere this summer, likely melting to its minimum extent for the year on Sept.11, 2024, according to researchers at NASA and the National Snow and Ice Data Center (NSIDC). The decline continue…",
            "url": "https://phys.org/news/2024-09-arctic-sea-ice-historic-antarctic.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/arctic-sea-ice-near-hi.jpg",
            "publishedAt": "2024-09-25T16:28:17Z",
            "content": "Arctic sea ice retreated to near-historic lows in the Northern Hemisphere this summer, likely melting to its minimum extent for the year on Sept.11, 2024, according to researchers at NASA and the Nat… [+5265 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Yahoo Entertainment"
            },
            "author": "Jose Karlo Mari Tottoc",
            "title": "Jim Cramer on PG&E Corporation (PCG): ‘That Stock Is A Good One, Rate Increase Or Not’",
            "description": "We recently compiled a list of the Jim Cramer’s 10 Stock Picks That Could Change Your Investment Game. In this article, we are going to take a look at where ...",
            "url": "https://finance.yahoo.com/news/jim-cramer-pg-e-corporation-044603954.html/",
            "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png",
            "publishedAt": "2024-09-25T04:46:03Z",
            "content": "We recently compiled a list of the Jim Cramer's 10 Stock Picks That Could Change Your Investment Game. In this article, we are going to take a look at where PG&amp;E Corporation (NYSE:PCG) stands aga… [+4794 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Daily Signal"
            },
            "author": "Diana Furchtgott-Roth",
            "title": "Phasing Out Fossil Fuels Will Leave the Globe Poor, Hungry, and Sick",
            "description": "It’s Climate Week at the United Nations in New York, and the U.N. General Assembly on Sunday voted to phase out fossil fuels, at the... Read More\nThe post Phasing Out Fossil Fuels Will Leave the Globe Poor, Hungry, and Sick appeared first on The Daily Signal.",
            "url": "https://www.dailysignal.com/2024/09/25/phasing-out-fossil-fuels-will-leave-the-globe-poor-hungry-and-sick/",
            "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/09/20240925_UNFossilFuels.jpg",
            "publishedAt": "2024-09-25T17:58:56Z",
            "content": "Its Climate Week at the United Nations in New York, and the U.N. General Assembly on Sunday voted to phase out fossil fuels, at the same time abandoning its sustainable development goals of eliminati… [+3853 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "BBC News"
            },
            "author": null,
            "title": "Prince William says make peace with nature",
            "description": "The Prince of Wales has issued an urgent call to end the destruction of the environment.",
            "url": "https://www.bbc.com/news/articles/c62rgmrjy6eo",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/4e14/live/ce9d8500-7b29-11ef-8c1a-df523ba43a9a.jpg",
            "publishedAt": "2024-09-25T11:24:15Z",
            "content": "The Prince of Wales has issued an urgent call to end environmental destruction and to \"make peace with nature\".\r\n\"We are living at odds with the natural world - and it is buckling under the pressure … [+2053 chars]"
        }
    ]
}