[
    {
        "ID": "1gqdr0v",
        "Title": "America is going nuclear. What are your thoughts? ",
        "Author": "MoneyTheMuffin-",
        "Upvotes": 594,
        "Created": "2024-11-13 15:11:49",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://i.redd.it/e00mb416eo0e1.jpeg",
        "CommCount": 499,
        "Comments": [
            {
                "ID": "lwx3nyo",
                "Author": "sheeroz9",
                "Upvotes": 245,
                "Content": "I am for it"
            },
            {
                "ID": "lwx4v4u",
                "Author": "Bioshnev",
                "Upvotes": 116,
                "Content": "Honestly the cleanest energy we can produce at the moment."
            },
            {
                "ID": "lwx7lv0",
                "Author": "Sven4president",
                "Upvotes": 109,
                "Content": "Kinda surprised and relieved Trump supports it."
            },
            {
                "ID": "lwxjtl3",
                "Author": "AI-ArtfulInsults",
                "Upvotes": 84,
                "Content": "The issue is that this is primarily new power to support new demand, not replacing existing fossil fuel power production. Ideally increased nuclear power reduces the cost due to economies of scale in a way that might allow us to more easily phase out fossils, but any phasing-out of fossils is merely a speculative side-effect rather than stated intent."
            },
            {
                "ID": "lwxjbny",
                "Author": "darkweaseljedi",
                "Upvotes": 80,
                "Content": "I'm for it - sort of concerned for the safety implications if they take off the regulator rails though"
            },
            {
                "ID": "lwymmr8",
                "Author": "Jake0024",
                "Upvotes": 33,
                "Content": "Electricity is a fungible commodity. It is not meaningful to say the nuclear power will be used for new demand rather than replacing existing demand. The new demand will exist either way, and total demand needs to be met. If it's not met by green sources, it will be met by carbon based sources."
            },
            {
                "ID": "lwy6pp4",
                "Author": "Due_Satisfaction2167",
                "Upvotes": 29,
                "Content": "I mean, he loves any boondoggle project that lets him stuff dollars in his pocket, and nuclear power is great for corrupt government officials to siphon loads of money into their own pocket. "
            },
            {
                "ID": "lwx90la",
                "Author": "AmbulanceChaser12",
                "Upvotes": 26,
                "Content": "Every time I ask a conservative what they want to do about climate change, I get either sneering, a laugh react and some puerile insult, or “go nuclear.” \n\nSo I guess on balance, this is what has the best chance of success, since it’s the one plan we can get Democrats and Republicans together on. (Well, those Republicans who graduated from sandbox at least.)"
            },
            {
                "ID": "lwxev9x",
                "Author": "omgtinano",
                "Upvotes": 17,
                "Content": "You disagreed with the statement that nuclear is the cleanest we have right now, then didn’t explain why that isn’t true, and instead complained about getting downvoted."
            },
            {
                "ID": "lwyihtw",
                "Author": "AmbulanceChaser12",
                "Upvotes": 16,
                "Content": "OK, well, the left didn't win maximally, so compromise is necessary."
            },
            {
                "ID": "lwx9ix7",
                "Author": "Lopsided_Custard3429",
                "Upvotes": 13,
                "Content": "Better than oil, coal and gas"
            },
            {
                "ID": "lwyfihu",
                "Author": "ZucchiniMore3450",
                "Upvotes": 13,
                "Content": "They only count CO2, of course it is not clean in any other way.\n\n\n\nNot only that China added 200GW of solar in 2023., US will get that in 25 years. They have that power now. Solar and wind are the fastest to install too.\n\n\n\nI really think these are just bots run by some lobby group."
            },
            {
                "ID": "lwx8j7o",
                "Author": "elspiderdedisco",
                "Upvotes": 12,
                "Content": "a link to the article would be nice. microreactors? canceling plans to shut down reactors? or building new big ones? these are all pretty different....large scale reactors just aren't cost feasible anymore"
            },
            {
                "ID": "lwx8hjy",
                "Author": "WingedTorch",
                "Upvotes": 12,
                "Content": "I'ld rather see that money go into hydrogen gas power plants and more solar/wind/hydro, but its still better news than fossil fuels."
            },
            {
                "ID": "lwxgg3s",
                "Author": "SnooOnions3339",
                "Upvotes": 12,
                "Content": "Agreed. It’s better than enhanced geothermal for deployment options as well. The mining impact of massive nuclear deployment will be substantially lower than the rollout of wind, solar, and storage necessary for meeting baseload requirements. Plus, the embodied carbon footprint of nuclear (caveat: conventional reactors since that’s what’s been built) is lower than that of solar and about that of wind (https://www.ipcc.ch/site/assets/uploads/2018/02/ipcc_wg3_ar5_annex-iii.pdf#page=7 - embodied CO2 is on page 7). \n\nFor cost, SMRs have the potential to bring down costs, and other countries (China, South Korea, Canada) have much lower costs to build than Vogtle, showing that we can learn how to build reactors better. \n\nMy opinion is that we should be building nuclear like mad. "
            },
            {
                "ID": "lwyevfe",
                "Author": "blackflag89347",
                "Upvotes": 11,
                "Content": "Onshore wind narrowly edges it out at 11 g CO2eq / Kwh produced for wind vs. 12 g CO2eq / Kwh produced for nuclear according to the IPCC."
            },
            {
                "ID": "lwxda2l",
                "Author": "electrical-stomach-z",
                "Upvotes": 11,
                "Content": "Hydrogen is unviable."
            },
            {
                "ID": "lwx66ep",
                "Author": "Barragin",
                "Upvotes": 11,
                "Content": "Purpose is to supplement renewables, no? ie at night or when the wind doesn't blow."
            },
            {
                "ID": "lwyhf59",
                "Author": "GarethBaus",
                "Upvotes": 11,
                "Content": "I suspect he mostly supports it as a way to distract from renewables, but it would be a pleasant surprise if he actually supports it."
            },
            {
                "ID": "lwydm48",
                "Author": "greenman5252",
                "Upvotes": 8,
                "Content": "We will have to pay big electric to build the plants and then pay big electric for the power, and then pay for anything that goes run, and then pay for decommissioning, and then pay for spent fuel rods storage. It’s another facet to skim money from the masses into the pockets of the elite."
            },
            {
                "ID": "lwx9t57",
                "Author": "Moldoteck",
                "Upvotes": 8,
                "Content": "new 200gw of all types. Large scale are feasible. Don't look at vogtle alone. A lot of things went wrong there. Check out DOE liftoff report"
            },
            {
                "ID": "lwzopok",
                "Author": "blackflag89347",
                "Upvotes": 8,
                "Content": "So do nuclear plants. \nhttps://www.tandfonline.com/doi/full/10.1080/1943815X.2012.746993#d1e312"
            },
            {
                "ID": "lx1383l",
                "Author": "TrashManufacturer",
                "Upvotes": 8,
                "Content": "No regulations means 3 mile Chernobyl"
            },
            {
                "ID": "lwxkq7z",
                "Author": "TheNecroticPresident",
                "Upvotes": 7,
                "Content": "Far better than doing nothing"
            },
            {
                "ID": "lx2smy0",
                "Author": "GreatHamBeano",
                "Upvotes": 7,
                "Content": "Nuclear power is also great for countries with power consumption rates that surpass power production rates"
            },
            {
                "ID": "lwx8x69",
                "Author": "yomdiddy",
                "Upvotes": 7,
                "Content": "Where is the hydrogen? How’s it getting produced? How’s it getting transported?"
            },
            {
                "ID": "lx0yoyg",
                "Author": "RF-blamo",
                "Upvotes": 6,
                "Content": "Better than 50 new coal plants."
            },
            {
                "ID": "lwzu685",
                "Author": "ptfc1975",
                "Upvotes": 6,
                "Content": "It seems odd to pretend as if there is nothing that can be done about new demand. The new demand is as much of a human choice as the ways the supply can be made."
            },
            {
                "ID": "lwxf03w",
                "Author": "electrical-stomach-z",
                "Upvotes": 6,
                "Content": "Sounds like a peaker. could work well in conjunction with solar and nuclear."
            },
            {
                "ID": "lwx9d6o",
                "Author": "Moldoteck",
                "Upvotes": 6,
                "Content": "green h2 is more unrealistic at this point than deploying a new ap1000 on time..."
            }
        ]
    },
    {
        "ID": "1h2edyf",
        "Title": "Denmark will plant 1 billion trees and convert 10% of farmland into forest",
        "Author": "acrane55",
        "Upvotes": 395,
        "Created": "2024-11-29 06:12:44",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.independent.co.uk/news/ap-copenhagen-denmark-conservatives-social-democrats-b2649063.html",
        "CommCount": 4,
        "Comments": [
            {
                "ID": "lzjm2wl",
                "Author": "GuazzabuglioMaximo",
                "Upvotes": 19,
                "Content": "It was 15% last week but hey, I like it anyway! Go Denmark!"
            },
            {
                "ID": "lzkz6li",
                "Author": "krakende",
                "Upvotes": 11,
                "Content": "Awesome! Imagine people being against this."
            },
            {
                "ID": "lzordwa",
                "Author": "JeremyWheels",
                "Upvotes": 6,
                "Content": "I'm very pro rewilding and using less farmland. But unless people start eating less (or less meat) will that food production not just have to be offshored to somewhere else.  So no net benefit? Or am i being daft?"
            },
            {
                "ID": "m31ch7v",
                "Author": "mbrown_0911",
                "Upvotes": 1,
                "Content": "Probably will make prices go up on groceries."
            }
        ]
    },
    {
        "ID": "1g15uiu",
        "Title": "A restoration project to revitalise the Atlantic forest is making the city a much more liveable place in the face of increasingly frequent heatwaves",
        "Author": "fireisfire9090",
        "Upvotes": 251,
        "Created": "2024-10-11 11:31:17",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.theguardian.com/global-development/2024/oct/10/i-think-boy-im-a-part-of-all-this-how-local-heroes-reforested-rios-green-heart?ref=fixthenews.com",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "lrdyqsu",
                "Author": "fireisfire9090",
                "Upvotes": 38,
                "Content": "I know we have a lot of lurkers but look at the images in this article the difference that has happened is so good to see"
            },
            {
                "ID": "lrevkf3",
                "Author": "Spartacus90210",
                "Upvotes": 8,
                "Content": "It’s awesome to see tangible impact yeah"
            }
        ]
    },
    {
        "ID": "1g9ll81",
        "Title": "Electric Buses for a Cleaner Future: EPA Rolls Out $965M for School Districts Across US",
        "Author": "Bitter-Lengthiness-2",
        "Upvotes": 231,
        "Created": "2024-10-22 17:57:26",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.wgbh.org/news/local/2024-10-04/good-news-for-climate-efforts-new-funding-for-electric-buses-and-clean-energy-in-new-england",
        "CommCount": 11,
        "Comments": [
            {
                "ID": "lt6uys6",
                "Author": "Bitter-Lengthiness-2",
                "Upvotes": 16,
                "Content": "The new funding through the EPA’s Clean School Bus Rebate Program is a major win for communities, offering up to $965 million to help school districts nationwide transition from diesel to battery-electric buses. \n\nThis initiative not only tackles environmental justice by reducing pollution in historically impacted areas, but it also creates practical benefits for drivers and students. Quieter electric buses are making a noticeable difference, from improving communication for bus drivers to providing a calmer environment for students. These steps show real momentum toward a cleaner, healthier future for all."
            },
            {
                "ID": "lt85br9",
                "Author": "G07V3",
                "Upvotes": 6,
                "Content": "Kids not being able to read and write at a certain age isn’t a money problem. That’s a technology and social problem. Parents aren’t being strict enough with their kids with their devices and they’re letting their kids play on them constantly. Plus the language that we see online is very simple text and it isn’t advanced like some books are."
            },
            {
                "ID": "lt84ysf",
                "Author": "G07V3",
                "Upvotes": 5,
                "Content": "This is from my experience. When I was in middle school the school bus company would mostly drive newer bus models that would be less than 5 years old. In some cases they would drive older buses from the early 2000s if a bus was being repaired or couldn’t be used. Those older busses were extremely dirty. In the back of the bus you could smell the diesel exhaust and then the bus was accelerating you could see the exhaust was a slight gray color. I hope my school district got some electric busses."
            },
            {
                "ID": "lt8juxt",
                "Author": "DonMan8848",
                "Upvotes": 4,
                "Content": "Looks like electric school buses run around $300k-$400k. That tracks with the cost of a city bus being around half a million dollars."
            },
            {
                "ID": "ltiie8y",
                "Author": "SARstar367",
                "Upvotes": 3,
                "Content": "Neat!  Please don’t sell these to your communities on “environmental justice.”  That doesn’t sell!   These are 1- cheaper to fuel, 2- far cheaper to maintain, 3- quieter for students and driver, 4- safer AND 5-these funds have nothing to do with educational funds! (It’s a totally different pot of money the program draws from.) Also note that modern EVs don’t have issues with cold and being heavy on the bottom (battery pack) makes them safer than a standard (ICE) bus."
            },
            {
                "ID": "lt7bffy",
                "Author": "MerchantMrnr",
                "Upvotes": 2,
                "Content": "How much does a bus cost? How many buses will this reasonably end up supplying?"
            },
            {
                "ID": "lw1qpq3",
                "Author": "lukfi89",
                "Upvotes": 1,
                "Content": "More importantly, what is the daily mileage of a school bus?"
            },
            {
                "ID": "lzyxbs1",
                "Author": "Weekly_Error_2933",
                "Upvotes": 1,
                "Content": "130 miles max.  So unless the route is extremely small, this will end up being the most useless $400k a school could spend...I guarantee the maintenance costs for the next 5 years will be astronomical since the only people that can actual work on it will be the retrofit company that did it.  They know its govt money so it will cost 10x more because they know they can get away with charging that much."
            },
            {
                "ID": "lt92h8s",
                "Author": "Lord_Vesuvius2020",
                "Upvotes": -1,
                "Content": "I live in Upstate NY also. The fast approaching 2027 EV school bus mandate will be a huge problem. It’s cold up here and that affects battery performance. We’re not rich and paying higher school taxes will NOT be popular. And if a teacher, aid, school nurse, coach gets laid off so we can have EV buses the s**t will hit the fan. And I might add that it’s hilly as well as cold."
            },
            {
                "ID": "lt7ehws",
                "Author": "PinkFloydSorrow",
                "Upvotes": -5,
                "Content": "One district in upstate NY will need a new substation to power their bus fleet, estimated cost of conversion $30 million plus. Seems silly when many kids are unable to read and write at their age level. But who cares about the students grades as long as they have electric buses."
            }
        ]
    },
    {
        "ID": "1fy45i0",
        "Title": "First solar panel recycling plant in Queensland opens, expected to recycle 240,000 panels a year",
        "Author": "fireisfire9090",
        "Upvotes": 234,
        "Created": "2024-10-07 12:10:48",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.abc.net.au/news/2024-10-07/solar-panel-recycling-plant-landfill-glass-precious-metals-/104440218?utm_source=abc_news_app&utm_medium=content_shared&utm_campaign=abc_news_app&utm_content=other",
        "CommCount": 3,
        "Comments": [
            {
                "ID": "lqr79n3",
                "Author": "fireisfire9090",
                "Upvotes": 29,
                "Content": "One of the biggest arguments people against renewable energy use other than something dumb like wind mills are an eyesore is that solar produces too much waste\n\nits possible for that not to be true hopefully plants like this are one of many. Reduce. Reuse. Recyle"
            },
            {
                "ID": "lqrl3ll",
                "Author": "lowrads",
                "Upvotes": 9,
                "Content": "Panels only degrade about 1% each year.  The used panel market should be fairly strong."
            },
            {
                "ID": "lr1wawu",
                "Author": "Free_Return_2358",
                "Upvotes": 2,
                "Content": "I’ve had this idea for a while, nice that somebody is actually putting it into action."
            }
        ]
    },
    {
        "ID": "1h7bg5w",
        "Title": "Fed Seaweed, Grazing Cattle Produce 40 Percent Less Methane",
        "Author": "YaleE360",
        "Upvotes": 178,
        "Created": "2024-12-05 16:16:25",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://e360.yale.edu/digest/cows-seaweed-methane",
        "CommCount": 8,
        "Comments": [
            {
                "ID": "m0m048u",
                "Author": "Only1Sully",
                "Upvotes": 5,
                "Content": "Is there any incentive for farmers to do it?"
            },
            {
                "ID": "m0vvyh6",
                "Author": "SupremelyUneducated",
                "Upvotes": 2,
                "Content": "For every one ton of wild mammal on land and in the sea, there are 10 tons of cow. The apparatus of getting seaweed to earth's 1.5 billion cows would be akin to feeding all of Europe with food grown in the Americas."
            },
            {
                "ID": "m1h3phi",
                "Author": "twohammocks",
                "Upvotes": 2,
                "Content": "add to that the PFAS levels found in oceans is very high https://www.science.org/doi/10.1126/sciadv.adl1026\n\nAnd pfas found in cows milk\nhttps://www.consumerreports.org/pfas/pfas-forever-chemicals-found-in-some-milk-including-organic-a1101576034/\n\nmaybe its not so safe to feed seaweed if its high in pfas"
            },
            {
                "ID": "m0rxwgo",
                "Author": "Legal_Description720",
                "Upvotes": 1,
                "Content": "If the research is sound, somebody please have it approved by the FDA and have it passed into California law that all cow feeds need to have so much seaweed pellet formula as one of the ingredients in the feed for it to be sold. Cow feed manufacturers will swiftly comply to keep clients and it can spread throughout the rest of the country from there. I think this can be quite promising. Farmers and government officials have done well to prevent soil erosion and to curb chemical fertilizer pollution these last couple decades. There are plenty of farmers and government initiatives out there that DO want to farm responsibly. Just have to get the word out."
            },
            {
                "ID": "m3ds3v9",
                "Author": "Alarming_Award5575",
                "Upvotes": 1,
                "Content": "This is helpful, but impractical if the cattle graze at pasture vs a managed feed program."
            },
            {
                "ID": "m0k9qg1",
                "Author": "cmv1",
                "Upvotes": 1,
                "Content": "Red algae or whatever.  Yeah, this pops up from time to time."
            },
            {
                "ID": "m3jzzdv",
                "Author": "McQuoll",
                "Upvotes": 1,
                "Content": "Exactly!"
            }
        ]
    },
    {
        "ID": "1gaaqsg",
        "Title": "White House announces new decarbonization commitments as Buy Clean momentum grows",
        "Author": "One_Click_LCA",
        "Upvotes": 163,
        "Created": "2024-10-23 15:36:37",
        "Content": "Read more about it: [https://oneclicklca.com/en/resources/articles/white-house-announces-new-decarbonization-commitments](https://oneclicklca.com/en/resources/articles/white-house-announces-new-decarbonization-commitments)",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1gaaqsg/white_house_announces_new_decarbonization/",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "ltcbc2h",
                "Author": "showmeyourkitteeez",
                "Upvotes": 12,
                "Content": "Faster please."
            },
            {
                "ID": "ltrfnxx",
                "Author": "Unknown",
                "Upvotes": 2,
                "Content": "FASTER"
            }
        ]
    },
    {
        "ID": "1g15jlz",
        "Title": "Northern Forest: 1.9 million trees planted in 2023",
        "Author": "fireisfire9090",
        "Upvotes": 137,
        "Created": "2024-10-11 11:07:34",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.bbc.com/news/articles/c4gdnd4je8ko?ref=fixthenews.com",
        "CommCount": 10,
        "Comments": [
            {
                "ID": "lrdwrpm",
                "Author": "fireisfire9090",
                "Upvotes": 25,
                "Content": "I am not sure about anyone else but seeing images of nature restoration fills me with a lot of hope"
            },
            {
                "ID": "lrepx57",
                "Author": "agreatbecoming",
                "Upvotes": 14,
                "Content": "More september good climate news - [https://climatehopium.substack.com/p/positive-climate-news-from-september](https://climatehopium.substack.com/p/positive-climate-news-from-september)"
            },
            {
                "ID": "lrf3w76",
                "Author": "Spartacus90210",
                "Upvotes": 5,
                "Content": "But like, on a map. I love seeing tangible impacts myself, [like this](https://restor.eco/)."
            },
            {
                "ID": "lrewdu7",
                "Author": "Spartacus90210",
                "Upvotes": 4,
                "Content": "This is awesome to hear, but my question is - can we see them?"
            },
            {
                "ID": "lrf3fgd",
                "Author": "Fanatic97",
                "Upvotes": 1,
                "Content": "...no."
            },
            {
                "ID": "lrf3j3g",
                "Author": "Spartacus90210",
                "Upvotes": 1,
                "Content": "That’s a shame :("
            },
            {
                "ID": "lrf3ohz",
                "Author": "Fanatic97",
                "Upvotes": 1,
                "Content": "Advf. Sorry, my brain went to the steamed hams meme lol. \n\n\nI'm sure there's pictures somewhere..."
            },
            {
                "ID": "lrf42uw",
                "Author": "Fanatic97",
                "Upvotes": 1,
                "Content": "Oh, that's marvelous!! "
            },
            {
                "ID": "lrf4b5k",
                "Author": "Spartacus90210",
                "Upvotes": 1,
                "Content": "Indeed! In an industry full of greenwashing, it’s refreshing to see tangible projects where we can track the trees from space."
            },
            {
                "ID": "lrf4egc",
                "Author": "Fanatic97",
                "Upvotes": 1,
                "Content": "Gives me a little hope "
            }
        ]
    },
    {
        "ID": "1g4omjw",
        "Title": "'ZeroCAL' cement production process takes CO2 out of the equation",
        "Author": "coolbern",
        "Upvotes": 133,
        "Created": "2024-10-16 04:04:11",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://newatlas.com/materials/zerocal-cement-production-co2/",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "ls7lj7k",
                "Author": "twclimateunified",
                "Upvotes": 10,
                "Content": "Great News!\n\nCongratulations to the teams working on carbon reduction.\n\nWe need to support these researchers and companies partnering to help.\n\nCollectively we can all make our future better with carbon reduction.\n\nFor more ideas on how check out Climate Unified.org.\n\n[Climate Unified.org](https://www.climateunified.org)"
            }
        ]
    },
    {
        "ID": "1gzi6mn",
        "Title": "A programmer estimated he cut thousands of tonnes of emissions just by removing a few lines of code ",
        "Author": "sailonthruthestorm",
        "Upvotes": 120,
        "Created": "2024-11-25 13:56:07",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.thereengineer.pro/p/the-tiny-software-tweaks-that-could",
        "CommCount": 6,
        "Comments": [
            {
                "ID": "lz0e997",
                "Author": "Skateboard_Raptor",
                "Upvotes": 21,
                "Content": "If (emitEmission) {\n\n     dont() ;\n\n};"
            },
            {
                "ID": "lz214de",
                "Author": "brutalspoon",
                "Upvotes": 6,
                "Content": "Yes, specifically Pretty High Pollution 8.3"
            },
            {
                "ID": "lzcfsgs",
                "Author": "gavin_shaka",
                "Upvotes": 4,
                "Content": "As a developer who works on building a corporate greenhouse gas emissions calculator & targets product for climate consultants to use, cheers dude. Sometimes it really is that easy."
            },
            {
                "ID": "lzi4fyq",
                "Author": "ramakrishnasurathu",
                "Upvotes": 3,
                "Content": "Sometimes less is more, cutting code for a cleaner score!"
            },
            {
                "ID": "lz1n91t",
                "Author": "sailonthruthestorm",
                "Upvotes": 2,
                "Content": "Is that PHP?"
            }
        ]
    },
    {
        "ID": "1g6mjsk",
        "Title": "10 Significant & Recent Climate Wins",
        "Author": "Bitter-Lengthiness-2",
        "Upvotes": 118,
        "Created": "2024-10-18 18:38:03",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.greenpeace.org/international/story/69461/good-news-alert-10-climate-wins-to-inspire-change/",
        "CommCount": 4,
        "Comments": [
            {
                "ID": "lsjtxtk",
                "Author": "Bitter-Lengthiness-2",
                "Upvotes": 33,
                "Content": "1. UK Supreme Court ruling: Decision to consider climate impact in fossil fuel projects.\n\n2. Protection of Karipuna Indigenous land: Brazil’s authorities expelled illegal loggers.\n\n3. G20 tax justice breakthrough: A commitment to tax the ultra-rich.\n\n4. Pacific islands secure oceans treaty: A global treaty to protect marine biodiversity.\n\n5. California’s clean transportation: Phasing out gas-powered cars by 2035.\n\n6. Global deforestation decline: Countries unite to restore ecosystems.\n\n7. Court halts oil exploration in the Arctic: A legal victory against Shell’s drilling efforts.\n\n8. New Zealand bans fossil fuel projects: The government stops offshore fossil fuel permits.\n\n9. Indonesia protects rainforest: A moratorium on clearing primary forest extended.\n\n10. EU achieves plastic reduction: Single-use plastics are now largely banned in Europe."
            },
            {
                "ID": "lsjx57n",
                "Author": "Utoko",
                "Upvotes": 27,
                "Content": "+ so many big countries investing in nuclear."
            },
            {
                "ID": "lslrm8l",
                "Author": "Crazycook99",
                "Upvotes": 3,
                "Content": "NZ operations on the smoke and mirror platform \nThey’re set to destroy more land w/ 150 new projects that bypass environmental regulations. “A dozen projects are associated with $500,000 in political donations to the coalition parties.”\n\n[https://www.nzgeo.com/stories/whats-the-point-of-the-fast-track-bill/](https://www.nzgeo.com/stories/whats-the-point-of-the-fast-track-bill/)"
            },
            {
                "ID": "lslzzr9",
                "Author": "WaywardPatriot",
                "Upvotes": 2,
                "Content": "This \\^\\^\\^"
            }
        ]
    },
    {
        "ID": "1gnndrh",
        "Title": "Germany sets new record for renewable power",
        "Author": "SarumanWizard",
        "Upvotes": 111,
        "Created": "2024-11-10 00:47:29",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://ember-energy.org/latest-insights/germany-sets-new-record-for-renewable-power/",
        "CommCount": 7,
        "Comments": [
            {
                "ID": "lweei6w",
                "Author": "Moldoteck",
                "Upvotes": 2,
                "Content": "I mean, look at Germany's grid these days. Not only coal was ramped up to 20GW and gas to 15GW, but oil was ramped up from 0.3 to 0.6GW for some time and imports are in 6-10-15gw ballpark..."
            },
            {
                "ID": "lwt5qsx",
                "Author": "uujjuu",
                "Upvotes": 2,
                "Content": "Please would you explain how the dependance on Persian exports leads to vulnerability to Israeli extortion? I can believe it reading the insane media reporting here in Germany, but I'd appreciate understand your reading of that underlying dynamic "
            },
            {
                "ID": "lwtbm4b",
                "Author": "lowrads",
                "Upvotes": 2,
                "Content": "If Israel attacks Iranian export depots, Iran will retaliate by targeting Iraqi, Saudi, or UAE depots, curtailing exports from the Persian gulf.  Europe is highly dependent upon those imports for electricity, which is needed for industry.  This will have a direct impact on their ability to supply war materiel to Ukraine."
            },
            {
                "ID": "lwxhamg",
                "Author": "WingedTorch",
                "Upvotes": 1,
                "Content": "and renewables more than 170 GW in total"
            },
            {
                "ID": "lwxhrcw",
                "Author": "Moldoteck",
                "Upvotes": 0,
                "Content": "that's great!"
            },
            {
                "ID": "lwdsasv",
                "Author": "lowrads",
                "Upvotes": -2,
                "Content": "Germany now gets 25% of their electricity from coal, having reignited their dirty lignite plants after disastrous policies on the premature and possibly irreversible shutdown of nuclear plants. \n\nThey bear principle responsibility for the collapse of industry across Europe, and enablement of the geopolitical position of Russia in Ukraine, and now of dependence upon Persian gulf exports.  As a consequence, they are vulnerable to extortion from Israel, and every political and materiel demand the latter can make of them.\n\nGermany was a disaster for the liberal world and scientific positivism in the early twentieth century, and now again in the twenty first."
            },
            {
                "ID": "lwdw9ib",
                "Author": "Pleiadez",
                "Upvotes": -3,
                "Content": "Funny because these are very old tech solar panels. Very inefficient compared to newer variety."
            }
        ]
    },
    {
        "ID": "1gp2rbz",
        "Title": "Europe to install 110GW of Solar in 2025 — S&P",
        "Author": "SarumanWizard",
        "Upvotes": 94,
        "Created": "2024-11-11 21:48:26",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.pv-tech.org/europe-to-install-110gw-of-solar-in-2025-sp/",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "lwnave6",
                "Author": "bankrupt_bezos",
                "Upvotes": 6,
                "Content": "Why not 11 more Gw for that Doc Brown quote?"
            },
            {
                "ID": "lwx15yl",
                "Author": "Unknown",
                "Upvotes": 5,
                "Content": "Next week i will install solar panels on the roof of my house. Can't wait"
            }
        ]
    },
    {
        "ID": "1gvlmvk",
        "Title": "The major coal producing country that wants to leave its fossil fuels in the ground",
        "Author": "acrane55",
        "Upvotes": 83,
        "Created": "2024-11-20 10:21:45",
        "Content": "Colombia, in case you're wondering. I never even knew they produced coal, let alone being a major producer.",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://news.sky.com/story/the-major-coal-producing-country-that-wants-to-leave-its-fossil-fuels-in-the-ground-13254177",
        "CommCount": 5,
        "Comments": [
            {
                "ID": "ly2urkz",
                "Author": "SonofMakuta",
                "Upvotes": 14,
                "Content": "Let's go Colombia! Wishing them the greatest of success.\n\n(Edit: typo)"
            },
            {
                "ID": "ly5tbg1",
                "Author": "Philosofox",
                "Upvotes": 4,
                "Content": "Col**o**mbia"
            },
            {
                "ID": "lydy4qw",
                "Author": "SonofMakuta",
                "Upvotes": 3,
                "Content": "Thank you!"
            },
            {
                "ID": "lydy5gx",
                "Author": "exclaim_bot",
                "Upvotes": 2,
                "Content": ">Thank you!\n\nYou're welcome!"
            },
            {
                "ID": "lzi1evi",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "A coal-rich nation, a greener path they'll tread."
            }
        ]
    },
    {
        "ID": "1gz6lap",
        "Title": "Future Google supplier Kairos gets approval to build two small nuclear reactors",
        "Author": "WaywardPatriot",
        "Upvotes": 87,
        "Created": "2024-11-25 01:55:07",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://techcrunch.com/2024/11/21/future-google-supplier-kairos-gets-approval-to-build-two-small-nuclear-reactors/",
        "CommCount": 16,
        "Comments": [
            {
                "ID": "lyuof6r",
                "Author": "A_Vespertine",
                "Upvotes": 6,
                "Content": "*tents fingers* Excellent."
            },
            {
                "ID": "lyyekxw",
                "Author": "PM_Pics_of_Corgi",
                "Upvotes": 4,
                "Content": "Yeah nuclear energy has so many reasons for concern. Like [how it results in 99.9% fewer deaths than brown coal, 99.8% fewer than coal, 99.7% fewer than oil, and 97.6% fewer than gas](https://ourworldindata.org/nuclear-energy). Or how it’s [one of the most reliable sources of energy with 24/7 operation](https://www.energy.gov/ne/articles/5-fast-facts-about-nuclear-energy), unlike wind and solar."
            },
            {
                "ID": "lywxpnk",
                "Author": "Alpha3031",
                "Upvotes": 3,
                "Content": "Well, any cost increases for nuclear since the 1970s are irrelevant and costs will come down a whole lot in the near future because of learning just like the nuclear industry promises, but in the meantime renewables will cost what it cost Germany in the 2000s and any change in that is similarly irrelevant.\n\n\nAt least that's the gist I got from the conversation I just had before it ended."
            },
            {
                "ID": "lyvyxmp",
                "Author": "Moldoteck",
                "Upvotes": 2,
                "Content": "it's not super expensive. Costs about 1.5-2x of raw uranium ore (per Jp estimations in the past). You may think that's a lot, till you find out that for the bills you pay, uranium cost is merely 5-10% at most depending on the plant.  \nSolar+bess+firming aren't cheaper per lazard. And that report is overly pessimistic with nuclear (40y lifetime instead of 60+, vogtle costs instead of global average) and assumes 0 transmission cost for renewables (while expanding&maintaining it is extremely costly)  \nYou can also chose to not recycle and vitrify the stuff, very safe option, but it'll be a loss since uranium price will increase when demand grows, meaning recycling is even more favorable. But for cost estimations for such thing, Finland's repository should give a hint  \nAnother option is fast reactors that do work directly on the waste without purex"
            },
            {
                "ID": "lywfrgt",
                "Author": "Moldoteck",
                "Upvotes": 2,
                "Content": "? Why instead of relying on vibes you aren't checking real world numbers? Like what are the costs for Finland repository and estimated costs for waste till sealing? Or the costs of recycling at Orano la Hague? Or the cost of Superphenix fast reactor killed by the greens?   \n  \nDo you just hate on nuclear looking at your prev posts in other forums and just unwilling to look at real world data? I mean, you can, but at this point it's not an argument about protecting the climate or the cost and rather an argument to deny reality and push your agenda."
            },
            {
                "ID": "lywh2yr",
                "Author": "Moldoteck",
                "Upvotes": 2,
                "Content": "the cost at first, looking at lazard report with firming and assumptions like 40y npp life instead of 60 MINIMUM for new units, or vogtle costs instead of global averages, or 0 transmission cost for renewables when it costs a ton.   \nFor recycling - it's 1.5-2x the cost of buying the fuel per Jp estimations. It looks like a lot, but is it relevant when fuel itself is merely 5-10% of the bill you pay for npp power since most of the cost is from operation? And they say it's super complex but what argument is that? You can do tech transfer just like Japan did with Orano la Hague.  \nNeedless to say that payment for fuel storage in us is already regulated. But you can also check out countries that built a repository for the waste, like Finland. The cost isn't that big even if you don't recycle the waste and assume fast reactors will never be redeployed to work on the waste."
            },
            {
                "ID": "lzi4b6m",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "A nuclear future, a power venture."
            },
            {
                "ID": "lyx34x7",
                "Author": "Alpha3031",
                "Upvotes": 1,
                "Content": "I mean, as long as Google and not the taxpayer is paying for it..."
            },
            {
                "ID": "lyv5jf4",
                "Author": "WaywardPatriot",
                "Upvotes": 1,
                "Content": "You are going to get banned for spreading ant-nuclear falsehoods. This is your only warning. Stop doing this and educate yourself."
            },
            {
                "ID": "lyvkzpw",
                "Author": "Unknown",
                "Upvotes": 1,
                "Content": "[removed]"
            },
            {
                "ID": "lyvz3an",
                "Author": "Moldoteck",
                "Upvotes": 1,
                "Content": "usually ppl that first claim falsehoods should provide proofs, and the others can accept those or provide counter-proofs."
            },
            {
                "ID": "lyz3ei9",
                "Author": "Kaurifish",
                "Upvotes": 0,
                "Content": "Because it’s indefensible."
            },
            {
                "ID": "lywf708",
                "Author": "Unknown",
                "Upvotes": 0,
                "Content": "[removed]"
            },
            {
                "ID": "lywylzh",
                "Author": "Unknown",
                "Upvotes": -1,
                "Content": "[removed]"
            },
            {
                "ID": "lywey0s",
                "Author": "Little-Swan4931",
                "Upvotes": -2,
                "Content": "X10,000"
            },
            {
                "ID": "lyunkf6",
                "Author": "Unknown",
                "Upvotes": -12,
                "Content": "[removed]"
            }
        ]
    },
    {
        "ID": "1guyqxp",
        "Title": "To Cope With Extreme Heat, Paris Will Swap Parking Spaces for Trees",
        "Author": "YaleE360",
        "Upvotes": 85,
        "Created": "2024-11-19 15:44:40",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://e360.yale.edu/digest/paris-trees-parking-spaces",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "ly2p7qr",
                "Author": "Parisian75009",
                "Upvotes": 5,
                "Content": "They've been doing this for some years now. As well as tackling emissions, it makes streets much easier on the eye."
            },
            {
                "ID": "lzi1d7d",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "Parking for plants, a greener city's planned."
            }
        ]
    },
    {
        "ID": "1hmzm95",
        "Title": "Climate superfund bill signed",
        "Author": "Kindly_Ice1745",
        "Upvotes": 76,
        "Created": "2024-12-26 23:17:48",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "/r/upstate_new_york/comments/1hmvmw0/climate_superfund_bill_signed/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1geu64n",
        "Title": "Green Concrete: A Major Industry Starts to Clean Up Its Emissions",
        "Author": "YaleE360",
        "Upvotes": 73,
        "Created": "2024-10-29 14:07:10",
        "Content": "Cement production generates massive amounts of carbon dioxide. Increasingly, firms are looking to clean up their operations by sourcing renewable energy, working with greener materials, and deploying carbon capture. [Read more](https://e360.yale.edu/features/concrete-carbon-capture-germany).",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1geu64n/green_concrete_a_major_industry_starts_to_clean/",
        "CommCount": 15,
        "Comments": [
            {
                "ID": "luev7ow",
                "Author": "hazel_bit",
                "Upvotes": 13,
                "Content": "DAR is greenwashing. But a plant capturing their emissions at the source as they create them is something they should absolutely be required to do."
            },
            {
                "ID": "luf3pj0",
                "Author": "Archivemod",
                "Upvotes": 4,
                "Content": "It's not a replacement for halting new growth. we need less industrialization, not more of it. this shit is always am excuse to further the problem rather than actually solve our overconsumptive habits that led us here and you'll pardon me if I'm a bit touchy about the status quo."
            },
            {
                "ID": "lw2gsvv",
                "Author": "lukfi89",
                "Upvotes": 2,
                "Content": "Sure, I apologize, I'm not a native English speaker.\n\nThe issue of existing athmospheric carbon capture technology is that to capture 1 kg of carbon, it consumes 1 kWh of energy (not counting the energy required to build the device). So as long as it is powered from a grid which includes coal in the energy mix, it does more harm than good.\n\nI don't know the details of the cement plan carbon capture technology, but it's important to know its energy needs to say whether it's greenwashing or not."
            },
            {
                "ID": "lw2j1a9",
                "Author": "hazel_bit",
                "Upvotes": 2,
                "Content": "ah, I got it. thank you. That makes sense.\n\nSo, in my fantasy world where we're able to casually dictate to companies that this capture is a requirement, the presumption is that we've also already eliminated coal and gas usage altogether and renewable power sources are the only power source.\n\nDreaming big over here."
            },
            {
                "ID": "luslwjt",
                "Author": "Archivemod",
                "Upvotes": 2,
                "Content": "misread, but yes, industrialism is complex. you can't discard what I'm saying by making a banal statement like this though, they ARE inextricably linked. \n\n\nyou cannot produce excess wealth without some form of product (at least typically) and you need industry of some kind to produce that product.\n\n\nThis isn't to say industry has to be miserable, but we've overinflated its importance and dominance to ridiculous levels.\n\n\ntake, for example, disposable plastics. they are a prime example of something horrid for the environment and dubiously valuable to consumers that sees massive industrial production because it is more efficient as packaging and as a recycled waste product.\n\n\nopposing this state of affairs has proven difficult, since so many capitalists will cry foul that sustainable plastics would bankrupt them, ignoring that it would just be a slight dip in profit margins rather than the catastrophe they pretend it would be.\n\n\nthis is an industry we should question and ideally reduce to the niche uses we have for these plastics, especially in light of their impacts on the planet and health."
            },
            {
                "ID": "lusvd3c",
                "Author": "SINGULARITY1312",
                "Upvotes": 2,
                "Content": "You can still centralize wealth with little to no industrialization. But I will agree that the way industrialization has been used (and also to your point as well, overemphasized), and I read the rest of your comment and find your criticism is accurate and well thought out. \n\nI don’t know to what degree you ideally would want to decrease industrialization, but if it’s significantly less but also enough to  have tons of public transport, a space program, advanced scientific research, revolutionary technological advancements, and things we can use to help the transition to renewable energies and infrastructure. Though you can still reduce industrialization and ideally have those things with higher efficiency under a liberatory system. This is complicated and to some degree speculative I feel though."
            },
            {
                "ID": "lw2cw95",
                "Author": "lukfi89",
                "Upvotes": 1,
                "Content": "Depends. Does it capture more carbon than what is generated to cover its energy needs?"
            },
            {
                "ID": "lupzex5",
                "Author": "SINGULARITY1312",
                "Upvotes": 1,
                "Content": "Industrialization isn’t the problem it’s capitalism and the state"
            },
            {
                "ID": "lw2f3lk",
                "Author": "hazel_bit",
                "Upvotes": 1,
                "Content": "can you rephrase that?"
            },
            {
                "ID": "lurf1au",
                "Author": "Archivemod",
                "Upvotes": 1,
                "Content": "Industrialism is a part of capitalism, they are intertwined. I'd also argue industrialism cannot exist without exploitation in a myriad of forms, making it something we should truly scrutinize as a part of why capitalism sicks so much."
            },
            {
                "ID": "lusid7n",
                "Author": "SINGULARITY1312",
                "Upvotes": 1,
                "Content": "False, you can have capitalism without industrialization and vice versa. Industry is not the problem, it’s just a tool like any other which can be used for good or bad."
            },
            {
                "ID": "lwc5rzn",
                "Author": "Old-Adhesiveness-156",
                "Upvotes": 1,
                "Content": "Too bad we killed the nuclear energy industry. It might have been the only way."
            },
            {
                "ID": "lut3a3e",
                "Author": "Archivemod",
                "Upvotes": 1,
                "Content": "largely my interest is in public transit infrastructure. railways are much more cost effective for long distance transportation, and hold up significantly better than roadways and rely less heavily on fossil fuel products like asphalt.\n\n\nFollowing investment in that, I'd like to see a phasing out of cars in favor of enhanced public transit. while there will still be places cars are an unfortunate necessity, it IS possible to update these areas with infrastructure capable of cutting down on emissions and consumer expenses.\n\n\nin turn, this would also conserve our oil reserves to be used for things more necessary to modern life.\n\n\nas for what degree I'd reduce industrialization, If I had the say I'd enact a ban on non-residential high rise buildings entirely. we have enough technology to make work from home the default for the whitecollar sector, and those that require in office security ought to have access to the free space whenever it's not possible to convert it to dense housing. \n\n\nI'd probably slow construction in general and put a kibosh on luxury homes and suburb sprawl. High density housing can be made pretty good now and I think we should invest in that while we still have the materials to make buildings of comfort and long term durability.\n\n\nThe conversation can continue endlessly from there, and I haven't even gotten into the necessity of ballot and electoral reform yet, but these are the relevant pillars my activism is rooted on."
            },
            {
                "ID": "luhin7a",
                "Author": "hazel_bit",
                "Upvotes": 0,
                "Content": "that’s fair. growth isn’t a virtue, it’s cancer."
            },
            {
                "ID": "lucvntj",
                "Author": "Archivemod",
                "Upvotes": -4,
                "Content": "carbon capture is a greenwashing scam. stop posting this shit."
            }
        ]
    },
    {
        "ID": "1ge5aop",
        "Title": "France could mandate climate risk assessments for energy, health, infrastructures and other \"vital\" companies under new national adaptation plan",
        "Author": "EetD",
        "Upvotes": 74,
        "Created": "2024-10-28 16:44:58",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.callendar.tech/en/post/climate-risk-assessment-for-french-companies-adapatio-plan",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1hocnil",
        "Title": "What habits are you willing to quit in favor of more sustainable ones?",
        "Author": "DarkPersonal6243",
        "Upvotes": 70,
        "Created": "2024-12-28 20:04:41",
        "Content": "Here's what I'm doing to reduce my emissions.\n\nAfter my trip to England as an American, I will not willingly fly for pleasure again anytime soon.\n\nAdopting a plant-based diet. Not willingly buy industrial meat, dairy, and eggs. Though, I am gaining interest in hog hunting, as feral swine are destructive in the Southeast U.S. where I'm from, and they don't have a natural predator, but if I don't have a way of hunting game, I would remain vegetarian.\n\nComposting. I built two bins outside, one from a Lowe's bucket and another from a tote, also from the same store as the former.\n\nGrowing produce at home. I grew Walmart organic bell peppers from seed with an LED light I'm using as an aquarium light for my 55 gallon freshwater aquarium. I also feed the homegrown peppers to my guinea pigs.\n\nLooking more into home aquaponics. Already doing that with a romaine stalk I have in one of my fish tanks. I want to eventually have all of my fish tanks (freshwater) to grow something aquaponically. I guess being an avid aquarist helps find more sustainable way to get food for not just me, but for my pet guinea pigs.\n\nDoing outdoor gardening as well as the aforementioned aquaponics. I got gardening gloves, shears, and a farmer's almanac for Christmas this year.\n\nHere's some of my long-term goals:\n\nGetting our house solar powered.\n\nNever owning a pure gas vehicle again. I'm looking to get an EV or e bike. In fact, if I remember correctly, I think they're building an EV battery factory just between Savannah and Statesboro on I-16.\n\nBonus: Our gas tank that supplies gas for heaters for the winter months; we've ditched them for a central heat and air system.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hocnil/what_habits_are_you_willing_to_quit_in_favor_of/",
        "CommCount": 32,
        "Comments": [
            {
                "ID": "m48p350",
                "Author": "viomore",
                "Upvotes": 26,
                "Content": "Ive nearly quit driving this year, biking is so convenient Im embarrassed its taken me so long to try it for in town stuff. Going to try indoor growing. Been vegetarian, low disposables type house for more than a decade. Would love to support less plastic packaging."
            },
            {
                "ID": "m49dfu8",
                "Author": "michiganxiety",
                "Upvotes": 16,
                "Content": "Great list! I'm happy to see more Americans are understanding the climate impact of flying specifically. Despite living in the Midwest, I've gotten to be something of an Amtrak expert at this point. I recommend Rome2Rio (app or website) for finding alternatives to flying or driving - though if you have an EV perhaps you'd just use that. I have found that avoiding driving has made me really appreciate kicking back in a train though, especially if you can afford to spring for a roomette. \n\nMy things to add for this upcoming year are similar to your electric vehicle idea - I joined an EV carshare and I'm getting an ebike - I can't wait!!\n\nThe only thing \"missing\" I'd mention is getting involved in political solutions, which can seem intimidating but can be as easy as sending a couple pre-written emails! I really like the app Climate Action Now for ease of use, but I also get a lot of action items in my email by subscribing to groups like the Sierra Club, Evergreen Action, the High Speed Rail Alliance and Rail Passengers Association - the latter two being very important if we're going to get people to fly less in this country."
            },
            {
                "ID": "m49a8og",
                "Author": "dgodog",
                "Upvotes": 9,
                "Content": "I sold my house in an idyllic resort town and moved to a small apartment in the city I grew up in. This drastically reduced my driving and meant I wasn't regularly flying to visit family."
            },
            {
                "ID": "m49o1v0",
                "Author": "AffinitySpace",
                "Upvotes": 6,
                "Content": "We’re electrifying our home and transportation. We have swapped out our gas water heater with a heat pump water heater, our gas range with an induction range, our gas dryer with a heat pump dryer, our single speed pool pump with a variable speed pool pump, all LED lights paired with motion sensors and smart plugs where it makes sense, desertscaped our yard, low flow water appliances, sinks, and showheads throughout, air sealed our home after getting an energy audit, insulating and sealing our duct work next year. Electric yard care tools. From diesel and gas to all EVs, expanded our solar this year to cover 75% of our home based on use before we started in all our efficiency upgrades, smart panel to monitor energy use. I'm hoping with our upgrades, we’ll be able to fully run off of solar. When our hvac systems eventually go our, we’ll replace with heat pump and air handler systems and turn off the natural gas line. \n\nI love the concept of composting and need to get started. I'm always looking to improve."
            },
            {
                "ID": "m48slzp",
                "Author": "ThinkBookMan",
                "Upvotes": 6,
                "Content": "Where I live doesn't have great public transit but I'm making a resolution to use it at least once a month next year."
            },
            {
                "ID": "m4a8h7d",
                "Author": "Digiee-fosho",
                "Upvotes": 5,
                "Content": "I am going to quit eating meat, & dairy, & switch to plant based alternatives. It will not only reduce emissions, but the costs, & federal subsidies by not demanding these products. It will also reduce the risks of disease, & viruses that come from farming livestock, & poultry."
            },
            {
                "ID": "m48szss",
                "Author": "lowrads",
                "Upvotes": 5,
                "Content": "It was easy enough to program the thermostat to \"bank\" during daylight hours, then idle during peak residential demand.  It's a small thing, but I'll be damned if I am going to do anything favorable to the economics of peaker plant operators.   \n\nIt was also easy to make liberal use of the timers on the washer or dryer, so I don't need to be present to load them at specific times of day.  \n\nI've found the inputs requirement of backyard agriculture to not be worthwhile.  The requirements for embodied energy in the form of amendments, plus all the labor and monitoring don't add up to a reasonable amount of yield.  Most people don't even know how to track their amendment use, and it just adds up to watershed  contamination.  Ergo, all I grow now are herbs.  One mint pot probably puts out enough for the whole neighborhood.\n\nComposting benefits from larger pile dimensions.  It's not a magical embetterment process, but really a hazard mitigation process.  If something is a safe, or pathogen free material, it can be added into the growing area to compost directly in situ.  This tends to confer more nitrogen and carbon residues in place.  Where composting has a benefit, is the heat, which helps break down some unwanted seeds or other propagative tissue.  Anywhere it is cool, they tend to survive, and mobile organisms will likely take those materials with them as they migrate to an optimal temperature.  Ergo, you need an even larger pile, and the means to move it around, or access the most well treated components."
            },
            {
                "ID": "m4aa53m",
                "Author": "rocketpowerdog",
                "Upvotes": 4,
                "Content": "I would love to bike more, but I am terrified of the drivers here and there are no bike lanes or sidewalks to my house. Our next car will at least be a hybrid, if not an ev. As of now, we compost and are converting our residential landscaping to native plants to conserve water and provide habitat/food for pollinators and wildlife. We switched from the gel tabs for laundry and dishwater to powder to lessen microplastics and in general try to reduce plastic where we can (though it seems impossible to do that entirely). And really I try to consume more information climate friendly tips to incorporate into my daily life and vote for politicians and public initiatives that will help as well."
            },
            {
                "ID": "m4axsal",
                "Author": "the-bearded-omar",
                "Upvotes": 4,
                "Content": "This all sounds wonderful and in line with our goals — can I ask how you went about getting solar installed and if there’s a reasonable financial way to do so?"
            },
            {
                "ID": "m4b9gx4",
                "Author": "AffinitySpace",
                "Upvotes": 4,
                "Content": "We reached out to a few companies for bids, looked at the best bid for our goal keeping the reputation of the companies in mind. We didn't choose the cheapest bid: we selected a company that gave us a competitive bid and has 4.9 stars on Google with more than 1,000 reviews. \n\nOnce we selected a company, we signed an agreement and they got the panels up on the roof about a month later. \n\nFinancially speaking, cash is ideal, followed by financing, followed by leasing. We did financing with the hope to claim the tax credit in April, then paying the balance of the loan off hopefully by the end of next year; if you're a U.S. resident, there is a national tax rebate for 30% off the price of the panels. You can learn more on the rewiring America website.\n\nIf you have efficient electric appliances and an EV, the break-even point is sped up dramatically, plus there are gasoline and natural gas savings."
            },
            {
                "ID": "m49k1ss",
                "Author": "StormWolfHall",
                "Upvotes": 3,
                "Content": "I stopped driving in 2010..."
            },
            {
                "ID": "m4hsrp6",
                "Author": "TuringTestTwister",
                "Upvotes": 3,
                "Content": "Stopped eating animal products 3 years ago. Put 35 solar cells on my roof and switched to an electric vehicle. Got rid of my lawn and replaced it with low water native plants. Replaced all lights with LEDs,."
            },
            {
                "ID": "m4hde2c",
                "Author": "GlassMom",
                "Upvotes": 3,
                "Content": "I drive a Chevy Bolt, and I stop in nearly exactly the same places for charging as I did for gas when I drive from MSP to CHI.  Realistically, I only add about 25 minutes to each stop, because gas and pee took me 20 minutes, anyway.  EV is way cheaper than hybrid, partly because there's nothing on it to fix.  When it comes time, you're gonna love it.  If your car doesn't have the range, the money you save can go toward a rental than will."
            },
            {
                "ID": "m4h8u85",
                "Author": "Taste_of_Natatouille",
                "Upvotes": 2,
                "Content": "Things I'm happy to have at least start doing in my living situation and external challenges\n\n-Reduce lights and unnecessary power where I can compared to other people I know and how I used to live. Nothing against how other people I live, I just feel good to notice what I'm doing through others\n\n-My stupid city finally introduced more easy access to recycling, (which literally made me happy) so I started sorting blue bin items, trash and food scraps instead of just collecting bottles to take to a far away centre once a month. Now everything gets picked up here from bins, with more options around for other wastes. Though I have yet to make use of reuse centers.\n\n-I don't own a car despite having a drivers license, and as convenient as it would be to have a sustainable one for some situations, I rely on public transit, public scooters and walking\n\n-Bought reusable things I never thought I'd own before like wooden straws, my own fancy pair of chopsticks for take out, rubber covers for opened food items instead of plastic wrap (where I can) and jars/containers in place of Ziploc bags\n\n-I'm thinking of donating my disfunctional printer to a rage room, and then entering said rage room to smash it\n\n\nWhat I still need to do better on\n\n-Not wasting water during long showers. I'm good for not leaving the sap running when spending the night at someone's place, but I think not having to pay for it where I live- as well as loving hot, cozy showers. That one is a work in progress\n\n-Despite food scrap sorting, I need to work on not wasting food by failing to use something before it goes bad. I'm so sensitive to something potentially expiring that I would throw out something that may still be good just to be safe.\n\n-Come next summer, I want to invest in something I can ride to work instead of public transit. Trying to decide on what though\n\n-Considering recycling or reusing everything else that can be as such but don't go in any of the bins, especially electronics. I wish there were more electronic waste centers around that I can get to\n\n-I live in an apartment, but trust me, if I had a house and could afford to put more greenery around it, I'd do so in a heartbeat"
            },
            {
                "ID": "m4p2rmx",
                "Author": "New-Eggplant-3359",
                "Upvotes": 2,
                "Content": "I have been eating mostly vegetarian and vegan food for the last 7 years. \n\nI haven’t flown for the last 8 years. \n\nI pay extra for my electricity to be 100 % renewable and I use it to charge my electric car. (Yes, I know battery manufacture is resource intensive so EV might be a zero sum game.) \n\nI buy almost all my clothes from second hand stores. \n\nWe grow quite a bit of produce ourselves in our garden. \n\nWe have no kids and we hesitate to have any. \n\nThere is more stuff I can’t remember. Put together, a test told me it’s hard for me to minimize my emissions even further on my own. Politicians and manufacturers up the supply chains need to change how things are done."
            },
            {
                "ID": "m4y1tmo",
                "Author": "poonhound69",
                "Upvotes": 2,
                "Content": "I basically stopped flying. Been on one flight in the last five years. Dropped meat from my diet. Never had kids. "
            },
            {
                "ID": "m4bdgot",
                "Author": "TresGatosFarm",
                "Upvotes": 2,
                "Content": "No more Amazon, no more Coca-Cola, and bringing a mug/tupperware to coffee shops and dining establishments!"
            },
            {
                "ID": "m52pe7w",
                "Author": "michiganxiety",
                "Upvotes": 2,
                "Content": "Perhaps time to get involved in an organization pushing for political change then? That's what I did when it felt like I was out of things to do after being vegan, not driving and not flying, and at the time living in an apartment. I've learned SO much and can even claim a small (very small, admittedly, in some cases) portion of several major legislative victories in my state and country, because I met with my elected officials and asked them to vote for them or cosponsor them. Citizens' Climate Lobby is a great organization to join to learn that skill, but there are tons of good organizations to join if you look around. If you don't have time to join, at least sign up for some newsletters so you can send their form letters to your politicians. I promise you, even if it feels silly, it makes a difference."
            },
            {
                "ID": "m4hdgiz",
                "Author": "GlassMom",
                "Upvotes": 2,
                "Content": "It's really hard to quit that entirely.  I got close...."
            },
            {
                "ID": "m4d3w2m",
                "Author": "michiganxiety",
                "Upvotes": 2,
                "Content": "Assuming you're in the US: EnergySage shows competing quotes in your area (it's recommended by the US Department of Energy) and Rewiring America has a huge amount of information about federal tax incentives for solar panels and a lot of the other things listed in this comment. You get 30% of the cost of the solar panels off of your taxes the following year (hopefully the new administration won't kill that immediately...)."
            },
            {
                "ID": "m55c3vc",
                "Author": "New-Eggplant-3359",
                "Upvotes": 2,
                "Content": "Well done on your results. Yes, I’m a donator to my country’s environmental organization and keep up with what they are doing. I am a researcher in a different field (social sustainability) and do not feel like I have much time and energy to devote to further political commitments on the climate front but of course the thought crosses my mind regularly."
            },
            {
                "ID": "m4fh0f9",
                "Author": "TSLsmokey",
                "Upvotes": 1,
                "Content": "I've honestly cut down my driving since I had my climate + politics doom spiral. It kinda helps that my longest drives have vanished after my DnD group fell apart. Nowadays, I don't drive unless I really need to, and I tend to stick around the house to begin with. I'm aiming to get a Hybrid sometime next year as well so I can cut even further. I'd do an EV but where I'm at, that's not exactly viable. I don't eat a lot of beef to begin with so cutting that down is somewhat insignificant on my end. And since I live with my parents(really cheap rent), I don't have much of a say over whether or not we go renewable. I think the majority of energy in my state is renewable to begin with, but I don't know if they've signed up for that plan."
            },
            {
                "ID": "m4gz0to",
                "Author": "friedaclimb",
                "Upvotes": 1,
                "Content": "1. Planting Native plants in my community, this year I’m focusing on milkweed for the butterflies.\n\n2. More fresh fruit/vegetables in my diet and less plastic. Will be doing more meal prepping and utilizing my freezer to cut on food waste.\n\n3. I don’t live in the most bikeable town but it’s still extremely reasonable for me to bike to get groceries or run small errands.\n\n4. Buying less stuff in general and thrifting, utilizing buy nothing groups when available"
            },
            {
                "ID": "m4jefpb",
                "Author": "carbonmarket",
                "Upvotes": 1,
                "Content": "Have you thought about investing in projects that reduce emissions impact?"
            },
            {
                "ID": "m4lo2u0",
                "Author": "Superb-Inflation4444",
                "Upvotes": 1,
                "Content": "More the fool you! Read Al Gore's 'An Inconvenient Truth' 2006, and see how many of his supposed doom laden predictions have come true! When they don't, they just push back the date another 10 years infernitum! If we stopped burning fossil fuels tomorrow, abstained from eating meat, and the rest of the nonsense being extrapolated by the climate doom mongers, it would reduce global temperatures by an estimated 0.8°F. In order to achieve this, we subjigate the underdeveloped nations to a life of continued poverty and oppression - Oh no, how dare you even consider using fossil fuels to escape poverty and build your economy, its shere hypocrisy!!! Unfortunately, due to the continual MSM daily narrative of a doom laden future and brainwashing of children at school, to the disgraceful point where they are scared shitless, while global elites and celebrities fly around in their private jets attending all these nefarious functions on climate change. Disgraceful! It's very much Do As We Say, And Not As We Do!  Whilst, anybody who criticises the narrative is called a skeptic. We'll, I think Thomas Huxley sumed it up perfectly with his saying, \"Skepticism is the highest of duties, blind faith the one unpardonable sin.\" Consenus isn't scientific, and science is never settled. Otherwise, why continue to spend trillions of dollars for a science is is settled!!!!"
            },
            {
                "ID": "m53wbuw",
                "Author": "lucytiger",
                "Upvotes": 1,
                "Content": "Plant-based diet, swapping disposables for reusables (safety razor, menstrual cup, towels and rags instead of paper towels, etc.), contacting my elected officials about climate and energy policies, composting, saving for a heat pump and solar panels"
            },
            {
                "ID": "m4a7qkx",
                "Author": "NationalGeometric",
                "Upvotes": 1,
                "Content": "Capitalism"
            },
            {
                "ID": "m4cmvbs",
                "Author": "DarkPersonal6243",
                "Upvotes": 1,
                "Content": "To be fair though, I'm a sucker for Cherry Zero cokes, but I am letting the chances of it going to a landfill on a freezing day in hell, by turning them into planters and drilling holes for water to escape!\n\n\nIn other words, I'm reusing those bottles as planters."
            },
            {
                "ID": "m4bmivr",
                "Author": "carliciousness",
                "Upvotes": 0,
                "Content": "I don't Amazon"
            },
            {
                "ID": "m4hevj6",
                "Author": "GlassMom",
                "Upvotes": 0,
                "Content": "Silly thing, but a different approach.  I'm effectively not bringing liquids into my house at all in 2025.  I have an RO filter, so anything that has to get to where I am is powdered, or in the case of my CO2 bubbles, compressed in a tank.  I use laundry detergent sheets, and get ethanol to make cleaning products from a local producer (we grow corn, here).  Trucking water in any form, mixed with whatever outside fresh produce unavailable locally could be reserved for water into emergencies like droughts and storm recovery.\n\nI've also built an indoor plant shelf and am newly growing my own arugla and spinach in those 12\"x9\"x2\" kid art pans--they work great!"
            }
        ]
    },
    {
        "ID": "1gmr8lb",
        "Title": "Austria deploys 1.4 GW of new solar in January - September period",
        "Author": "SarumanWizard",
        "Upvotes": 65,
        "Created": "2024-11-08 20:46:00",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.pv-magazine.com/2024/11/08/austria-deploys-1-4-gw-of-new-solar-in-january-september-period/",
        "CommCount": 3,
        "Comments": [
            {
                "ID": "lw4slst",
                "Author": "SarumanWizard",
                "Upvotes": 5,
                "Content": "“Austria installed 1.4 GW of new PV capacity from January to September 2024, including around 400 MW added in the third quarter alone.”"
            },
            {
                "ID": "lw80l7u",
                "Author": "easythrees",
                "Upvotes": 1,
                "Content": "This is great, but we need battery storage too. I wonder why the grid doesn’t use redox batteries."
            }
        ]
    },
    {
        "ID": "1gaytkm",
        "Title": "Half a pound of this powder can remove as much CO₂ from the air as a tree, scientists say",
        "Author": "hirundo1987",
        "Upvotes": 68,
        "Created": "2024-10-24 11:50:43",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.latimes.com/environment/story/2024-10-23/this-powder-can-remove-as-much-co2-from-the-air-as-a-tree",
        "CommCount": 23,
        "Comments": [
            {
                "ID": "ltibj0l",
                "Author": "AI-ArtfulInsults",
                "Upvotes": 52,
                "Content": "\"The structures are held together by some of the strongest chemical bonds in nature, including the ones that turn carbon atoms into diamonds.\"\n\nSo... carbon-carbon covalent bonds? Like in most organic molecules?"
            },
            {
                "ID": "ltih2bl",
                "Author": "MycologyRulesAll",
                "Upvotes": 24,
                "Content": "DAC is always a fig-leaf for the fossil fuel industry.  The article here speculates that the CO2 could be pumped deep underground and ta-da! problem solved."
            },
            {
                "ID": "ltik76v",
                "Author": "AI-ArtfulInsults",
                "Upvotes": 24,
                "Content": "What if we just left the CO2 underground, I wonder"
            },
            {
                "ID": "ltikdzh",
                "Author": "hau5keeping",
                "Upvotes": 23,
                "Content": "then we would still need to remove the existing CO2 in the atmosphere"
            },
            {
                "ID": "ltk679n",
                "Author": "Memetic1",
                "Upvotes": 13,
                "Content": "We really do have to tackle this problem from as many angles as possible. I'm doing a debt strike, for example, over atmospheric composition. Other groups are targeting the insurance sector, and I think that's promising as well. I'm so tired of people assuming that people trying to solve the problem beyond applying pressure to legacy energy is by default working for legacy energy. I'm not being paid by anyone in fact I'm lighting my own financial house on fire in protest, but I'm also developing a space based solution that could solve at least the energy imbalance part of this problem."
            },
            {
                "ID": "ltm4exy",
                "Author": "CrossP",
                "Upvotes": 11,
                "Content": "Well the excess CO2 in the air is mostly from burning carbon-carbon organic molecules. So it does sort of make sense that it would get stored again like that."
            },
            {
                "ID": "ltjg8tm",
                "Author": "NoOcelot",
                "Upvotes": 9,
                "Content": "I think you might be confusing carbon capture and storage (CCS) with direct air capture (DAC). CCS is a complete pipe dream,  and in the handful of cases where it works,  the co2 is ironically being pushed underground to help squeeze out more oil. CCS reservoirs (sedimentary rock underground) also have no guarantee of actually keeping the carbon sequestered there. \n\nDAC is a huge energy hog,  but at least it actually sequesters carbon properly."
            },
            {
                "ID": "ltrfjzy",
                "Author": "Unknown",
                "Upvotes": 5,
                "Content": "While its a lot better then nothing. I feel like a kid who has done their work of cleaning the floor too late before mommy even arived, and brushed the entire dust underneath the carpet in the last 5 seconds."
            },
            {
                "ID": "ltyzie0",
                "Author": "xllsiren",
                "Upvotes": 3,
                "Content": "Is this real? Having a solution to pull it out of the air is major progress."
            },
            {
                "ID": "ltk8zfj",
                "Author": "PermiePagan",
                "Upvotes": 3,
                "Content": "But they literally say they want to use this powder to store the CO2 underground, the same as CCS. Their plan is for the powder to just trap it temporarily, then release the CO2 underground when heated, to be reused."
            },
            {
                "ID": "ltk9qcy",
                "Author": "MycologyRulesAll",
                "Upvotes": 2,
                "Content": "Maybe I misunderstand you here, but how does this DAC ‘properly sequester’ anything? \nThe article talks about being able to re-use the adsorbent for 1,000 cycles of capture and release."
            },
            {
                "ID": "ltofmco",
                "Author": "MycologyRulesAll",
                "Upvotes": 2,
                "Content": "'in basalt rock' = adsorbed to the rock but still in a gas form."
            },
            {
                "ID": "ltq5nxs",
                "Author": "LetMeBuildYourSquad",
                "Upvotes": 2,
                "Content": "No, it's typically injected in supercritical form. It then gets trapped by a number of mechanisms but ultimately ends up mineralised into carbonate rocks, where it can never be realised back into the atmosphere."
            },
            {
                "ID": "ltrof72",
                "Author": "LetMeBuildYourSquad",
                "Upvotes": 2,
                "Content": "Yep, it's definitely expensive, but there are lots of places you can do it!\n\nThere are also other forms of carbon removal (which remove carbon from the atmosphere - different to carbon capture which is capturing it at the point of emission). They're all expensive (e.g. biochar, enhanced rock weathering) but are getting cheaper, and when you consider the price of other commodities $100-$300 per tonne for carbon doesn't seem so bad...."
            },
            {
                "ID": "ltlaf5s",
                "Author": "TheWiseAutisticOne",
                "Upvotes": 1,
                "Content": "Takes powder\n.\nPuts it on table \n. \nMakes line with credit card \n.\nSnorts \n.\nLeaves"
            },
            {
                "ID": "ltkrpzp",
                "Author": "reddolfo",
                "Upvotes": 1,
                "Content": "Tech like the scrubbers made by Climeworks are capable of sequestering atmospheric CO2. The problem is scale -- and the tech in it's current form cannot be scaled in enough time to actually matter at all. Plus, as mentioned it requires massive energy."
            },
            {
                "ID": "ltmizb0",
                "Author": "TheBestMetal",
                "Upvotes": 1,
                "Content": "Because you have to re-use the scrubber, like a dish sponge. The plan is always to further sequester the CO2 in a stable, non-gaseous state, so it has to be released."
            },
            {
                "ID": "ltmoi2f",
                "Author": "MycologyRulesAll",
                "Upvotes": 1,
                "Content": "Maybe that’s your plan, but I can’t find any active CCS project than plans to convert CO2 into another form."
            },
            {
                "ID": "ltrinb6",
                "Author": "MycologyRulesAll",
                "Upvotes": 1,
                "Content": "[https://www.sciencedirect.com/science/article/abs/pii/S0012825222001209](https://www.sciencedirect.com/science/article/abs/pii/S0012825222001209) \n\nOkay, TIL.  Reading the state of the art, it seems like an extremely expensive and difficult way to sequester CO2, but I guess it could work at some scale."
            },
            {
                "ID": "ltmoxaz",
                "Author": "TheBestMetal",
                "Upvotes": 0,
                "Content": "You're talking about CCS. I'm talking about DAC. It's way too late to be poking around for the articles but DAC projects, including I believe Climeworks, have aimed to re-sequester the captured CO2 in basalt rock and the like."
            }
        ]
    },
    {
        "ID": "1g15tcs",
        "Title": "Han River ecosystem shows substantial recovery after city's restoration initiatives",
        "Author": "fireisfire9090",
        "Upvotes": 65,
        "Created": "2024-10-11 11:28:50",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.koreatimes.co.kr/www/nation/2024/10/113_382941.html?ref=fixthenews.com",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1h501tp",
        "Title": "Organizations tackle droughts, floods in Brazil by planting forests",
        "Author": "corpse_brigadier",
        "Upvotes": 63,
        "Created": "2024-12-02 18:14:17",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://news.mongabay.com/2024/11/organizations-tackle-droughts-floods-in-brazil-by-planting-forests/",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "m0bk07n",
                "Author": "Confident_Home487",
                "Upvotes": 1,
                "Content": "Yes guys, the people who brainwashed you into this crap put out more CO2 emissions per person per year than a freaking small country.\n\nDid you ever think about that 🤔\n\nPrivate jets and yachts and whatnot. Daily jet trips might I add."
            }
        ]
    },
    {
        "ID": "1h1m7ue",
        "Title": "Chinese team’s cell turns ambient heat into power – no sunlight required",
        "Author": "swagmond27",
        "Upvotes": 60,
        "Created": "2024-11-28 03:57:25",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.scmp.com/news/china/science/article/3288316/chinese-teams-cell-turns-ambient-heat-power-no-sunlight-required",
        "CommCount": 7,
        "Comments": [
            {
                "ID": "lzdguln",
                "Author": "nsefan",
                "Upvotes": 8,
                "Content": "This sounds more applicable for nanowatt power applications. Interesting but not really significant when it comes to cleaning up mass energy production."
            },
            {
                "ID": "lzcujqh",
                "Author": "yuckyucky",
                "Upvotes": 8,
                "Content": "i assume this won't make large amounts of power for general household use?"
            },
            {
                "ID": "lzed5t6",
                "Author": "Ciertocarentin",
                "Upvotes": 3,
                "Content": "Thermopiles have been doing that since before I was born. (in fact, any bimetallic contact exhibiting differences  in their thermodynamic and electrical properties does so)"
            },
            {
                "ID": "lzi4hr5",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "With heat in the air, power's everywhere – no sun needed, it's fair!"
            },
            {
                "ID": "lzeyas8",
                "Author": "Sven4president",
                "Upvotes": 1,
                "Content": "What do you mean in regards to this article and Newtons 2nd law?"
            },
            {
                "ID": "lzearzf",
                "Author": "Possible-Whole9366",
                "Upvotes": -1,
                "Content": "Do people not understand Newtons 2nd law?"
            },
            {
                "ID": "lzfzzzk",
                "Author": "Possible-Whole9366",
                "Upvotes": -1,
                "Content": "Energy only becomes more disorganized. You can't get substantial energy from ambient heat without putting more energy into it."
            }
        ]
    },
    {
        "ID": "1gda7gx",
        "Title": "There are companies out there that are trying to reduce methane emissions from cow burps. ",
        "Author": "crazyotaku_22",
        "Upvotes": 61,
        "Created": "2024-10-27 13:49:09",
        "Content": "https://vidhyashankr22.medium.com/feeding-the-future-cow-burps-will-be-more-sustainable-434a735d3f75",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1gda7gx/there_are_companies_out_there_that_are_trying_to/",
        "CommCount": 8,
        "Comments": [
            {
                "ID": "lu0ps7o",
                "Author": "shanem",
                "Upvotes": 20,
                "Content": "It's a band aid though, and the climate impacts of cows go beyond burps. \n\n\nMost people don't need to pay money for animals to be killed and subjugated so they can eat. \n\n\nConsider a plant based diet or at least drastically reducing your consumption of sentient animal"
            },
            {
                "ID": "lu12bqr",
                "Author": "Unknown",
                "Upvotes": 15,
                "Content": "i almost feel like this is satire"
            },
            {
                "ID": "lu0kgmi",
                "Author": "Didgeridooloo",
                "Upvotes": 6,
                "Content": "Well I know several people who've doubled down on eating more beef since I mentioned to them it could help the environment if we all cut back. Maybe we need this new science."
            },
            {
                "ID": "lud9lbb",
                "Author": "leedsdaddy",
                "Upvotes": 2,
                "Content": "Mixing charcoal into cows diet results in about 30% less methane from either end 🐱"
            },
            {
                "ID": "lu2b67j",
                "Author": "GreatestCatherderOAT",
                "Upvotes": 2,
                "Content": "what an additional waste of resources to research this shit. just go tf vegan if you don't want a planetary sized graveyard"
            },
            {
                "ID": "lw4l8dt",
                "Author": "Legal_Description720",
                "Upvotes": 1,
                "Content": "Vegetarianism is noble and I know you guys are just being facetious. We should stop eating cows because of all the green house gas they make but there is always the problem with food scarcity. The world's population keeps on increasing and people need to eat. Scientists are getting creative, looking for new sources of food for the hungry masses. Did you ever see the episode of dirty jobs where Mike Rowe ate a jellyfish Cheeseburger? All very good initiatives, love it"
            },
            {
                "ID": "m31cshr",
                "Author": "mbrown_0911",
                "Upvotes": 1,
                "Content": "Nope. I like steak. Gonna eat steak."
            },
            {
                "ID": "lu5hmf1",
                "Author": "GreatestCatherderOAT",
                "Upvotes": 1,
                "Content": "you are all bloodthirsty denialist deadman walking "
            }
        ]
    },
    {
        "ID": "1hnsai1",
        "Title": "Climate targets of Fortune 500 companies",
        "Author": "cursingpeople",
        "Upvotes": 56,
        "Created": "2024-12-28 00:37:48",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://i.redd.it/zj89fprl8h9e1.jpeg",
        "CommCount": 3,
        "Comments": [
            {
                "ID": "m449rks",
                "Author": "Alarming_Award5575",
                "Upvotes": 11,
                "Content": "now I want to see how they've slid over the past 18 months"
            },
            {
                "ID": "m46tee6",
                "Author": "BTC-Yeetdaddy69",
                "Upvotes": 1,
                "Content": "Nothing like a nice infographic to make information easy to comprehend."
            },
            {
                "ID": "m4jeszw",
                "Author": "twclimateunified",
                "Upvotes": 1,
                "Content": "Wow - this is a great chart!\n\nThanks to those providing the work to create this visibility.\n\nThis is one of the best I have seen.\n\nCan use this as my ‘only buy from’ list.\n\nOne of my New Year’s resolutions.\n\nFor other ideas check out ClimateUnified.org[climate unified](https://www.climateunified.org)"
            }
        ]
    },
    {
        "ID": "1g5ouim",
        "Title": "Indias coal-fired monthly power output slips consecutively for the first time since pandemic",
        "Author": "fireisfire9090",
        "Upvotes": 53,
        "Created": "2024-10-17 13:39:36",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.reuters.com/business/energy/indias-coal-fired-monthly-power-output-slips-consecutively-first-time-since-2024-10-09/?ref=fixthenews.com",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "lsdnxkp",
                "Author": "faizimam",
                "Upvotes": 9,
                "Content": "India, as well as most developing countries, is importing gargantuan amounts of Chinese solar panels and batteries.\n\nTo a lesser extent Evs and motors for locally made ebikes and 3 wheels.\n\nThis absolutely will havr a major impact on the grid and fossil fuel generation.\n\nWorth following closely"
            }
        ]
    },
    {
        "ID": "1gwogp7",
        "Title": "HUD’s $1 Billion Climate Upgrade: Bringing Green Living to Low-Income Renters Nationwide",
        "Author": "Bitter-Lengthiness-2",
        "Upvotes": 48,
        "Created": "2024-11-21 20:49:52",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.dailyclimate.org/a-billion-dollar-investment-bring-climate-friendly-housing-upgrades-to-low-income-renters-2669959007.html",
        "CommCount": 3,
        "Comments": [
            {
                "ID": "lyapckx",
                "Author": "Bitter-Lengthiness-2",
                "Upvotes": 4,
                "Content": "The U.S. Department of Housing and Urban Development (HUD) has concluded its $1 billion Green and Resilient Retrofit Program, aimed at modernizing affordable housing across 42 states. This initiative has provided over 30,000 rental homes with energy-efficient upgrades, including solar panels, energy-efficient windows, and floodproofing measures. These enhancements are designed to reduce energy costs, lower carbon emissions, and increase the safety of buildings during extreme weather events. Residents, such as seniors in New Orleans and Pittsburgh, have noted that these improvements address longstanding maintenance issues and offer greater security during natural disasters.\n\nAdrianne Todman, HUD’s deputy secretary, emphasized that the program brings subsidized units into the 21st century, ensuring that low-income individuals are not left behind in the nation’s energy improvements. By lowering utility bills and increasing energy efficiency, these upgrades not only combat climate change but also enhance the health and safety of vulnerable residents nationwide. This comprehensive approach underscores the importance of integrating environmental sustainability with social equity, particularly in housing policies affecting low-income communities."
            },
            {
                "ID": "lzi1ge6",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "A billion-dollar boost, for greener homes, it's true."
            },
            {
                "ID": "m1rwzoq",
                "Author": "mrpuma2u",
                "Upvotes": 1,
                "Content": "It makes dollars and sense, we all need energy efficient homes, but people on the lowest income levels need it more, not having high utility expenses would help them out."
            }
        ]
    },
    {
        "ID": "1g15qp1",
        "Title": "Planting One Million Mangroves in the Bahamas",
        "Author": "fireisfire9090",
        "Upvotes": 44,
        "Created": "2024-10-11 11:22:56",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.clintonfoundation.org/commitment/clinton-global-initiative/planting-one-million-mangroves-in-the-bahamas/?ref=fixthenews.com",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1g15t45",
        "Title": "Atlantic sturgeon reintroduced in Sweden for the first time",
        "Author": "fireisfire9090",
        "Upvotes": 34,
        "Created": "2024-10-11 11:28:14",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://rewildingeurope.com/news/atlantic-sturgeon-reintroduced-in-sweden-for-the-first-time/?ref=fixthenews.com",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1h6yfkb",
        "Title": "Verity - Qatar Pledges £1B for UK Climate Tech in State Visit Deal",
        "Author": "DeepDreamerX",
        "Upvotes": 30,
        "Created": "2024-12-05 03:27:07",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://verity.news/story/2024/qatar-pledges-b-for-uk-climate-tech-in-state-visit-deal?p=re3132",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1g15lb5",
        "Title": "Amid Australia’s chaotic climate politics, the rooftop solar boom is an unlikely triumph | Adam Morton",
        "Author": "fireisfire9090",
        "Upvotes": 32,
        "Created": "2024-10-11 11:11:12",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.theguardian.com/environment/commentisfree/2024/oct/01/amid-australias-chaotic-climate-politics-the-rooftop-solar-boom-is-an-unlikely-triumph?ref=fixthenews.com",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "lrdx9lx",
                "Author": "fireisfire9090",
                "Upvotes": 3,
                "Content": "For any australians who like me get tired with how much libs have kept us on the backburner when it comes to climate action and how much time they waste every week with their stalling now with their nuclear plan which is full of holes this should be encouraging\n\n\"i’s difficult to overstate how rapidly Australians have embraced solar power, and how much it has exceeded expectations. In 2011, the forecast was that rooftop solar would eventually contribute 4 terawatt hours of electricity. In the context of the Australian grid, this was next to nothing – barely 2% of total generation. For some, it raised the question of whether it was really worth the cost.\n\nMore than a decade on, that number has been eclipsed more than six times over in the five eastern states connected by the country’s main power grid. Rooftop solar panels connected to the National Electricity Market generated 24.6TWh over the last year of data.\n\nPut another way, homes have contributed 11.6% of electricity – nearly as much as windfarms, comfortably more than large-scale solar farms or hydro plants, and twice as much as gas-fired power.\n\nMore than 3.7m households and small businesses have solar systems. It means more than one in three homes across the country generate their own power when the sun is out.\"\n\nThat is how much we were able to in a decade and show some of that is due to the government and states in part making solar panel installation cheaper but it is also absolutely on the australina people for so actively making the change themselves. I am confident when electric cars and power station start to pop up we will also quickly adopt although that has some challenges here"
            }
        ]
    },
    {
        "ID": "1gz6lk5",
        "Title": "Appalachian Power Explores Small Modular Reactors to Meet Future Energy Demand In Virginia",
        "Author": "WaywardPatriot",
        "Upvotes": 32,
        "Created": "2024-11-25 01:55:26",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.aep.com/news/releases/read/9868/Appalachian-Power-Explores-Small-Modular-Reactors-to-Meet-Future-Energy-Demand-In-Virginia",
        "CommCount": 6,
        "Comments": [
            {
                "ID": "lyv5cdi",
                "Author": "WaywardPatriot",
                "Upvotes": 6,
                "Content": "You are misinformed.\n\n[https://www.youtube.com/watch?v=lhHHbgIy9jU](https://www.youtube.com/watch?v=lhHHbgIy9jU)"
            },
            {
                "ID": "lyv91v3",
                "Author": "Earthling1a",
                "Upvotes": 3,
                "Content": "Now is the time to invest in these SMRs."
            },
            {
                "ID": "lzi48wh",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "A nuclear option, a future's direction."
            },
            {
                "ID": "lyvzhl0",
                "Author": "Moldoteck",
                "Upvotes": 1,
                "Content": "it's interesting that on purely cost basis, in theory, ap1000 should be cheaper per kwh than smr. There's a reason ppl scaled up nuclear plants, it's cheaper to build a facility in a single place that generates a lot. But smr will play a huge role anyway, nordics in europe want to use it for district heating and more flexible demand following for refuelling"
            },
            {
                "ID": "lyv074r",
                "Author": "Unknown",
                "Upvotes": -3,
                "Content": "[removed]"
            }
        ]
    },
    {
        "ID": "1g66hy4",
        "Title": "Climate Ready: Bluebelt program helps save NYC communities from flooding",
        "Author": "coolbern",
        "Upvotes": 23,
        "Created": "2024-10-18 03:12:42",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://abc7ny.com/post/climate-ready-new-technology-nyc-will-help-keep-communities-drowning/15428620/",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "lsgidyf",
                "Author": "coolbern",
                "Upvotes": 1,
                "Content": "The caveat limiting adoption of this adaptation:\n> This plan is effectively proven, but the only problem is the land on Staten Island was purchased with great forethought in the 90s, and the amount of land needed to put Bluebelts everywhere is not as available throughout the Tri-State.\n\nAs extreme water events rise through storm surge or rainfall, Bluebelt mitigation is only possible where there is effective foresight to prevent  sprawl development."
            }
        ]
    },
    {
        "ID": "1g15rs8",
        "Title": "CPJ announces $1M initiative to protect climate journalists - Committee to Protect Journalists",
        "Author": "fireisfire9090",
        "Upvotes": 23,
        "Created": "2024-10-11 11:25:12",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://cpj.org/2024/09/cpj-announces-1m-initiative-to-protect-climate-journalists/?ref=fixthenews.com",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "lrdy9re",
                "Author": "fireisfire9090",
                "Upvotes": 5,
                "Content": "It is a scary thing to think about but being a climate journalist in many countries is not safe and as we make more progress more governments and companies will become more hostile to the depths of their harm to our planet"
            }
        ]
    },
    {
        "ID": "1g15k70",
        "Title": "Colombia launches $40 bln investment portfolio for energy, climate transition",
        "Author": "fireisfire9090",
        "Upvotes": 22,
        "Created": "2024-10-11 11:08:45",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.reuters.com/business/environment/colombia-launches-40-bln-investment-portfolio-energy-climate-transition-2024-09-27/?ref=fixthenews.com",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1hg48tm",
        "Title": "Industrial electrification is here!",
        "Author": "Jbikecommuter",
        "Upvotes": 20,
        "Created": "2024-12-17 07:02:35",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.raponline.org/knowledge-center/some-like-it-hot-moving-industrial-electrification-from-potential-to-practice/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1gslji8",
        "Title": "How ‘sponge city’ Rotterdam is adapting to climate change",
        "Author": "acrane55",
        "Upvotes": 20,
        "Created": "2024-11-16 12:40:55",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.architectsjournal.co.uk/buildings/how-sponge-city-rotterdam-is-adapting-to-climate-change",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "lzi1bp3",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "City of sponges, soaking up the rain."
            }
        ]
    },
    {
        "ID": "1hkcn92",
        "Title": "What Role Do Grassroots Movements Play in Shaping Climate Action Plans?",
        "Author": "ramakrishnasurathu",
        "Upvotes": 19,
        "Created": "2024-12-23 02:13:08",
        "Content": "Governments often focus on large-scale solutions, but grassroots initiatives prove impactful on the ground. Share inspiring local stories or actionable ideas that should make it into the big picture.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hkcn92/what_role_do_grassroots_movements_play_in_shaping/",
        "CommCount": 4,
        "Comments": [
            {
                "ID": "m3eydtf",
                "Author": "Single-Pudding3865",
                "Upvotes": 2,
                "Content": "One of the ways is if you can work together at the local level to scale up local solutions. Eg in the case of biobased construction farmers, processors, and builders can go together to build in a sustainable way - and the municipality can prioritise biobased construction in their tenders and support the creation of demand. The educational systems can include sustainable construction in the curriculum. If we go together we can scale up existing biobased solutions. \n\nI am currently working on a project where this is our aim. It is nit easy - but I believe it is possible."
            },
            {
                "ID": "m3fh9qa",
                "Author": "xtnh",
                "Upvotes": 2,
                "Content": "Installation of solar generally picks up after the first installations, so peer pressure or influence obviously is a driver for change.  I bet maps of heat pump installations would show increasing circles scattered across a community"
            },
            {
                "ID": "m3e5yc3",
                "Author": "ThinkBookMan",
                "Upvotes": 2,
                "Content": "Grassroot is the #1 way movements shape action.\n\nhttps://www.pbs.org/kenburns/the-national-parks"
            },
            {
                "ID": "m3hk1em",
                "Author": "TheDramaticBuck",
                "Upvotes": 1,
                "Content": "This reeds like a pub admin paper prompt 😂\n\nIn any case, for the **role** of grassroots movements see - [polycentricity](https://www.sciencedirect.com/science/article/abs/pii/S0959378010000634)"
            }
        ]
    },
    {
        "ID": "1hgg2k8",
        "Title": "What happened in Climate Tech this year? Climate Recap 2024",
        "Author": "These_Valuable_4910",
        "Upvotes": 17,
        "Created": "2024-12-17 18:38:33",
        "Content": "[https://www.climatedrift.com/p/climate-recap-2024](https://www.climatedrift.com/p/climate-recap-2024) ",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hgg2k8/what_happened_in_climate_tech_this_year_climate/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1gjp64j",
        "Title": "A Climate Action Navigator for Utility Rebates, City Climate Programs, and Electrification / Weatherization Assistance Programs",
        "Author": "climate-credits",
        "Upvotes": 18,
        "Created": "2024-11-04 22:02:07",
        "Content": "[smartclimatecredits.com](http://smartclimatecredits.com)\n\nI've been working with folks to build a database of state and local climate action programs, and I wanted to share it out with you all to see if you find it useful. \n\nIt's still a work in progress. We're cleaning it up and QAing all the program links, but we've got a couple hundred programs across all 50 states. And we're adding in new cities every week. \n\nWe hope that we can make this a comprehensive databases of sub-national climate programs.  We're building city navigators, but we also have county and tribal program data as well. In the near future, we want to build map overlays to cover those programs too. \n\nI'd love to get your thoughts!",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1gjp64j/a_climate_action_navigator_for_utility_rebates/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1h6fkvo",
        "Title": "Reducing Carbon Emissions in Construction: Insights and Strategies",
        "Author": "Murky_Decision3332",
        "Upvotes": 16,
        "Created": "2024-12-04 14:09:29",
        "Content": "Buildings are responsible for 39% of global greenhouse gas emissions, with 11% stemming from the materials and processes used in construction. Addressing these emissions requires informed material choices to minimize environmental impact.\n\nKey discussions in sustainable construction focus on decarbonizing building services through smarter energy management, as emphasized by Schneider Electric, and scaling low-carbon infrastructure, a priority for organizations like Arcadis, which explores strategies to enable large-scale reductions in embodied carbon. Designing for sustainability is also critical, with firms like Gensler highlighting the importance of material transparency and carbon considerations to ensure future-ready buildings. Practical approaches to enhance material reuse and recycling are being demonstrated by tools developed by the Hilti Group, which assess products based on multi-attribute sustainability.\n\nThese efforts align with broader initiatives such as embodied carbon reduction goals and fostering a circular economy in the built environment. Learn more about reducing construction emissions through resources like environmental product declarations and life-cycle assessment guidelines.\n\nWhat are your thoughts on practical steps for reducing embodied carbon in construction?",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1h6fkvo/reducing_carbon_emissions_in_construction/",
        "CommCount": 4,
        "Comments": [
            {
                "ID": "m0ifbff",
                "Author": "swedish-inventor",
                "Upvotes": 3,
                "Content": "1. Passivhaus-tech with focus on cellulose insulation. Reducing heating-requirements of buildings is more important than the actual energy that goes into the building.   \n2. Build slow and reduce waste. Large construction firms waste tremendous amounts of materials and energy. Instead learn from the amish or similar cobuilding initiatives.  \n3. Right type of buildings. Don't build huge steel/concrete highrises when you can make 3-4 story apartment buildings completely out of wood and with reclaimed or local materials.  \n4. Build housing with and for the people. Banks should require proof of use or tenants signed up before giving any credit or loans to developers. Today lots of buildings are pure investments that stand empty most of the time.   \n5. Provide more than just housing. Like [sharphill.org](http://sharphill.org) that wants to build ecovillages with local agriculture and embedded co-ops to reduce commuting and share equity. It helps the climate, creates social justice and decentralization that better can endure eventual disasters/crisis."
            },
            {
                "ID": "m0d2d9o",
                "Author": "Murky_Decision3332",
                "Upvotes": 2,
                "Content": "Sign up for free & join the conversation: [https://oneclicklca.com/event/winter-sustainability-summit-2024/](https://oneclicklca.com/event/winter-sustainability-summit-2024/)"
            },
            {
                "ID": "m2yw1b4",
                "Author": "mbrown_0911",
                "Upvotes": 1,
                "Content": "If \"reducing embodied construction\" means that housing prices will go up so only the very wealthy can afford them, then I'm against it. It's all about control. They want the peasants to never be able to afford to own anything. The Obamas will be keeping their five large-ass mansions. Guaranteed. Such a fraud."
            }
        ]
    },
    {
        "ID": "1gab1by",
        "Title": "Going off grid is a financial win for some, but it’s a threat for poorer families and the environment",
        "Author": "FineDescription0",
        "Upvotes": 15,
        "Created": "2024-10-23 15:50:10",
        "Content": "Discover latest article on the growing economic viability of grid defection as solar and battery costs continue to drop. With an upfront investment, many households could potentially save more by going off-grid, but this shift poses challenges for grid sustainability and equitable energy access. As more people consider cutting ties with the grid, it raises important questions about the future of energy infrastructure and affordability.\n\nRead more about the findings here: \nhttps://doi.org/10.1016/j.solener.2024.112910\n",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://theconversation.com/going-off-grid-is-a-financial-win-for-some-but-its-a-threat-for-poorer-families-and-the-environment-240615",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "lwx1yzs",
                "Author": "Unknown",
                "Upvotes": 2,
                "Content": "mounting solar panel next week.   \nwe want this energy source to switch all gas heather and kitchen to electric ones.  \nI think, globally, my impact should be better."
            },
            {
                "ID": "m3dsmo5",
                "Author": "Alarming_Award5575",
                "Upvotes": 1,
                "Content": "The co2 in the atmosphere couldn't give a flying fuck about energy equity. Neither do upcoming crop failures. \n\nTake the win already and quit being so damn picky."
            }
        ]
    },
    {
        "ID": "1g80nix",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 12,
        "Created": "2024-10-20 17:00:45",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1g80nix/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 3,
        "Comments": [
            {
                "ID": "lsyepgs",
                "Author": "JournalistEast4224",
                "Upvotes": 1,
                "Content": "Any suggestions on Parking management or Transportation Demand Management policies?"
            },
            {
                "ID": "lt7snvv",
                "Author": "theclimatementor",
                "Upvotes": 1,
                "Content": "Ehi everyone!\n\nI am an Italian economist passionate about climate change. I have started a [newsletter](https://www.theclimatementor.com/subscribe) about it and and would like to get in contact with new people across the world. \n\nGenerally my area of interests are climate finance, sustainability largely and green investing. I will cover different topics but I am also interested in having different perspectives on it. If anyone here wants to collaborate or give me a hint, please send a message!\n\nThanks"
            }
        ]
    },
    {
        "ID": "1g4vee0",
        "Title": "Battle to save Tower Hamlets LTN's hailed 'best thing that’s ever happened'",
        "Author": "odysseysee",
        "Upvotes": 12,
        "Created": "2024-10-16 11:35:12",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://www.mylondon.news/news/east-london-news/battle-save-tower-hamlets-low-30125062",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1g15tmr",
        "Title": "Europe jumps on the train",
        "Author": "fireisfire9090",
        "Upvotes": 11,
        "Created": "2024-10-11 11:29:28",
        "Content": "",
        "Processed_Content": "",
        "Selfpost": false,
        "URL": "https://english.elpais.com/climate/2024-09-01/europe-jumps-on-the-train.html?ref=fixthenews.com",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "lrpgjuz",
                "Author": "U_s_e_r_a",
                "Upvotes": 1,
                "Content": "it's not exactly true bc of the train prices - they are often more expensive than airplane ones. plus, there are not as many connections yet"
            }
        ]
    },
    {
        "ID": "1hjek2i",
        "Title": "Scaling Innovative Farming Practices: A Blueprint for Low-Emission Agriculture?",
        "Author": "ramakrishnasurathu",
        "Upvotes": 11,
        "Created": "2024-12-21 18:26:55",
        "Content": "Agriculture accounts for a significant portion of global emissions, yet some practices are showing promise in reducing this impact. Methods like agroforestry, regenerative farming, and permaculture are gaining traction. What actionable steps can policymakers, farmers, and consumers take to make these solutions mainstream? Share ideas or examples of pilot programs that deserve attention.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hjek2i/scaling_innovative_farming_practices_a_blueprint/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1gyu7ol",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 8,
        "Created": "2024-11-24 17:00:12",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1gyu7ol/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 9,
        "Comments": [
            {
                "ID": "lyri8gc",
                "Author": "Coal121",
                "Upvotes": 5,
                "Content": "I'm hearing a lot of talk about how renewable energy is exploding (not literally) all over the world, being economically viable. Good stuff."
            },
            {
                "ID": "lyrt6zd",
                "Author": "TheBelievingAtheist",
                "Upvotes": 5,
                "Content": "It's a potentially good start. For example, in India, the explosion of renewable energy is quite evident with the government going all in for Solar energy. They are offering heavy rebates, even going as far as offering a way to sell it back to them."
            },
            {
                "ID": "m0l10e4",
                "Author": "JackoClubs5545",
                "Upvotes": 3,
                "Content": "The fact that peaking emissions is even an idea now is great. Shows how far climate action has gone since twenty years ago."
            },
            {
                "ID": "m0l5zs1",
                "Author": "TSLsmokey",
                "Upvotes": 3,
                "Content": "Not gonna lie. I’m glad I found this subreddit because I was in a self destructive spiral. I was rationalizing as best I could but the thought loop continued. This sub is good for showing everything that people are doing for climate action."
            },
            {
                "ID": "lysb67m",
                "Author": "JackoClubs5545",
                "Upvotes": 2,
                "Content": "Can anyone verify if global emissions are set to peak in 2025? I've heard that tidbit passed around, but I don't know if it's true or not."
            },
            {
                "ID": "m0kw540",
                "Author": "TSLsmokey",
                "Upvotes": 2,
                "Content": "I heard that from an article discussing the cop29 conference. Fingers crossed it’s true because then we can bring them down."
            },
            {
                "ID": "lyxuzfm",
                "Author": "Glassprotist",
                "Upvotes": 1,
                "Content": "Keep fighting, if we give up, they win."
            },
            {
                "ID": "lzi1hxl",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "Let's chat climate change, and work toward a brighter stage."
            },
            {
                "ID": "lzrrflj",
                "Author": "Zetman20",
                "Upvotes": 1,
                "Content": "https://youtu.be/D1MYZ6RUjMQ?si=mHJf6TSLu35sXelO An organization worth looking into."
            }
        ]
    },
    {
        "ID": "1gtgng3",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 9,
        "Created": "2024-11-17 17:00:13",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1gtgng3/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1hnecse",
        "Title": "Talking points for local, state, and national government ",
        "Author": "Floopoo32",
        "Upvotes": 7,
        "Created": "2024-12-27 13:59:59",
        "Content": "Hi everyone. I just started volunteering with the Sierra club (against climate change). I'm working on creating some general talking points about climate change, it's effects, alternative power sources to gas and coal, etc.\n\nI'd love to point to some paper or website or pamphlet that proves that renewables are cheaper (or similarly priced)and capable of giving us all of the energy we need. I know the needed mix between wind and solar is dependant on location (I'm in WI). \n\nOur state utilities are asking to build several more natural gas plants because Microsoft is trying to build large data centers here and will need a ton of energy.\n\nAnyway, I was looking to see if there were any talking points about natural gas vs renewable so that I don't need to recreate the wheel. \n\nAlso I'm curious what other states have done to force more investment in renewable energy. I know Iowa had created a law to require a certain amount of energy be produced from wind...any other laws I should look up?",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hnecse/talking_points_for_local_state_and_national/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1giq4eu",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 5,
        "Created": "2024-11-03 17:00:12",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1giq4eu/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1g2rk03",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 6,
        "Created": "2024-10-13 17:00:11",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1g2rk03/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 1,
        "Comments": []
    },
    {
        "ID": "1fxif5l",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 6,
        "Created": "2024-10-06 17:00:11",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1fxif5l/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1hk1bar",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 4,
        "Created": "2024-12-22 17:00:12",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hk1bar/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1h46e0i",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 4,
        "Created": "2024-12-01 17:00:19",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1h46e0i/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "lzyfj9b",
                "Author": "Confident_Home487",
                "Upvotes": 1,
                "Content": "In 1972, Prince Philip colluded with Maurice Strong and they devised a plan to collapse Western countries and make China the economic leader of the world.\n\nIt's all garbage. Totally made up bs originally based on overpopulation but was tweaked and tweaked to include CO2 emissions and cow farts.\n\nJust get some truth and go look it up."
            }
        ]
    },
    {
        "ID": "1go3tbg",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 5,
        "Created": "2024-11-10 17:00:12",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1go3tbg/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1hevjyr",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 3,
        "Created": "2024-12-15 17:00:13",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hevjyr/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1gdcvl1",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 3,
        "Created": "2024-10-27 16:00:12",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1gdcvl1/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 5,
        "Comments": [
            {
                "ID": "luqahe2",
                "Author": "Myhtological",
                "Upvotes": 3,
                "Content": "I’m getting sick of the fatalism and pessimism over on r/news"
            },
            {
                "ID": "lv04smx",
                "Author": "soulstosave",
                "Upvotes": 1,
                "Content": "I am curious to know why my post on Space-based Climate solutions was pulled. thank you for responding"
            },
            {
                "ID": "lvg25p5",
                "Author": "Aqn95",
                "Upvotes": 1,
                "Content": "What are some things we could easily do as part of Climate Action Activism?\n\nFrom raising awareness to doing little things to help solve the problem. Even, participating in local clean-up events . Every little bit counts when we’re working together for our planet!"
            },
            {
                "ID": "lws82kf",
                "Author": "Glassprotist",
                "Upvotes": 1,
                "Content": "Stop having children."
            },
            {
                "ID": "lws97z2",
                "Author": "Aqn95",
                "Upvotes": 1,
                "Content": "Stop breat…. I won’t risk my account"
            }
        ]
    },
    {
        "ID": "1hoyxei",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 2,
        "Created": "2024-12-29 17:00:25",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hoyxei/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": []
    },
    {
        "ID": "1h9lvzf",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 1,
        "Created": "2024-12-08 17:00:11",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1h9lvzf/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "m2gts1v",
                "Author": "FrecklePeach",
                "Upvotes": 1,
                "Content": "We hit 1.5c this year. I thought that was the tipping point? Genuinely have lost all hope and am trying desperately not to fall into a panicking spiral. Is there any reason to hold onto hope..?"
            },
            {
                "ID": "m2z0owr",
                "Author": "TSLsmokey",
                "Upvotes": 1,
                "Content": "It’s not considered that yet though it is sobering. In order for it to count, it has to be multiple years in a decade. We’re actually predicted to have a cooler 2025."
            }
        ]
    }
]