[
    {
        "ID": "1h2edyf",
        "Title": "Denmark will plant 1 billion trees and convert 10% of farmland into forest",
        "Author": "acrane55",
        "Upvotes": 395,
        "Created": "2024-11-29 06:12:44",
        "Content": "",
        "Processed_Content": "independent premium want bookmark favourite article story read reference later start independent premium subscription today danish lawmaker monday agreed deal plant 1 billion tree convert 10 farmland forest natural habitat next two decade effort reduce fertilizer usage government called agreement biggest danish landscape 100 year danish nature way seen since wetland drained 1864 said jeppe bruus head denmark green tripartite ministry created implement green deal reached june among farmer industry labor union environmental group agreement 43 billion krone 61 billion earmarked acquire land farmer next two decade government said danish forest would grow additional 250000 hectare 618000 acre another 140000 hectare 346000 acre currently cultivated climatedamaging lowlying soil must converted nature currently 146 land covered forest deal reached threeparty danish government made social democrat liberal center moderate socialist people party conservative liberal alliance social liberal party vote parliament deal considered formality june government said livestock farmer taxed greenhouse gas emitted cow sheep pig 2030 first country target major source methane emission one potent gas contributing global warming read ap coverage httpwwwapnewscomclimateandenvironment",
        "Selfpost": false,
        "URL": "https://www.independent.co.uk/news/ap-copenhagen-denmark-conservatives-social-democrats-b2649063.html",
        "CommCount": 4,
        "Comments": [
            {
                "ID": "lzjm2wl",
                "Author": "GuazzabuglioMaximo",
                "Upvotes": 19,
                "Content": "It was 15% last week but hey, I like it anyway! Go Denmark!",
                "Processed_Content": "15 last week hey like anyway go denmark"
            },
            {
                "ID": "lzkz6li",
                "Author": "krakende",
                "Upvotes": 11,
                "Content": "Awesome! Imagine people being against this.",
                "Processed_Content": "awesome imagine people"
            },
            {
                "ID": "lzordwa",
                "Author": "JeremyWheels",
                "Upvotes": 6,
                "Content": "I'm very pro rewilding and using less farmland. But unless people start eating less (or less meat) will that food production not just have to be offshored to somewhere else.  So no net benefit? Or am i being daft?",
                "Processed_Content": "im pro rewilding using le farmland unless people start eating le le meat food production offshored somewhere else net benefit daft"
            },
            {
                "ID": "m31ch7v",
                "Author": "mbrown_0911",
                "Upvotes": 1,
                "Content": "Probably will make prices go up on groceries.",
                "Processed_Content": "probably make price go grocery"
            }
        ],
        "labels": {
            "Energy and Industry": 5,
            "Land Use and Agriculture": 3,
            "Governance and Policy (Causes)": 4,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 4,
            "Extreme Weather Events": 1,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 4,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 4
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1h7bg5w",
        "Title": "Fed Seaweed, Grazing Cattle Produce 40 Percent Less Methane",
        "Author": "YaleE360",
        "Upvotes": 178,
        "Created": "2024-12-05 16:16:25",
        "Content": "",
        "Processed_Content": "cow fed seaweed pellet matador ranch dillon montana paulo de méo filho uc davis grazing cattle given seaweed supplement produced close 40 percent le methane fed grass alone new study found microbe inside cow sheep produce enormous volume methane potent heattrapping gas released burp fart one estimate livestock account close third methane emission grazing cattle produce methane either dairy cattle feedlot cattle owing fiber found grass scientist previously shown seaweed inhibits enzyme contributes production methane new study first test impact grazing cattle research researcher supplied seaweed pellet dozen beef steer ranch montana compared cattle given pellet steer produced 38 percent le methane average impact size health finding published proceeding national academy science research found seaweed supplement cut emission dairy cattle 50 percent feedlot cattle 80 percent study took place controlled setting cow fed seaweed daily new study cattle ate seaweed voluntarily researcher say approach could model rancher method pave way make seaweed supplement easily available grazing animal said study coauthor ermias kebreab uc davis rancher could even introduce seaweed lick block cattle agroforestry could help revitalize america corn belt fred pearce fred pearce lela nargi",
        "Selfpost": false,
        "URL": "https://e360.yale.edu/digest/cows-seaweed-methane",
        "CommCount": 8,
        "Comments": [
            {
                "ID": "m0m048u",
                "Author": "Only1Sully",
                "Upvotes": 5,
                "Content": "Is there any incentive for farmers to do it?",
                "Processed_Content": "incentive farmer"
            },
            {
                "ID": "m0vvyh6",
                "Author": "SupremelyUneducated",
                "Upvotes": 2,
                "Content": "For every one ton of wild mammal on land and in the sea, there are 10 tons of cow. The apparatus of getting seaweed to earth's 1.5 billion cows would be akin to feeding all of Europe with food grown in the Americas.",
                "Processed_Content": "every one ton wild mammal land sea 10 ton cow apparatus getting seaweed earth 15 billion cow would akin feeding europe food grown america"
            },
            {
                "ID": "m1h3phi",
                "Author": "twohammocks",
                "Upvotes": 2,
                "Content": "add to that the PFAS levels found in oceans is very high https://www.science.org/doi/10.1126/sciadv.adl1026\n\nAnd pfas found in cows milk\nhttps://www.consumerreports.org/pfas/pfas-forever-chemicals-found-in-some-milk-including-organic-a1101576034/\n\nmaybe its not so safe to feed seaweed if its high in pfas",
                "Processed_Content": "add pfas level found ocean high httpswwwscienceorgdoi101126sciadvadl1026 pfas found cow milk httpswwwconsumerreportsorgpfaspfasforeverchemicalsfoundinsomemilkincludingorganica1101576034 maybe safe feed seaweed high pfas"
            },
            {
                "ID": "m0rxwgo",
                "Author": "Legal_Description720",
                "Upvotes": 1,
                "Content": "If the research is sound, somebody please have it approved by the FDA and have it passed into California law that all cow feeds need to have so much seaweed pellet formula as one of the ingredients in the feed for it to be sold. Cow feed manufacturers will swiftly comply to keep clients and it can spread throughout the rest of the country from there. I think this can be quite promising. Farmers and government officials have done well to prevent soil erosion and to curb chemical fertilizer pollution these last couple decades. There are plenty of farmers and government initiatives out there that DO want to farm responsibly. Just have to get the word out.",
                "Processed_Content": "research sound somebody please approved fda passed california law cow feed need much seaweed pellet formula one ingredient feed sold cow feed manufacturer swiftly comply keep client spread throughout rest country think quite promising farmer government official done well prevent soil erosion curb chemical fertilizer pollution last couple decade plenty farmer government initiative want farm responsibly get word"
            },
            {
                "ID": "m3ds3v9",
                "Author": "Alarming_Award5575",
                "Upvotes": 1,
                "Content": "This is helpful, but impractical if the cattle graze at pasture vs a managed feed program.",
                "Processed_Content": "helpful impractical cattle graze pasture v managed feed program"
            },
            {
                "ID": "m0k9qg1",
                "Author": "cmv1",
                "Upvotes": 1,
                "Content": "Red algae or whatever.  Yeah, this pops up from time to time.",
                "Processed_Content": "red algae whatever yeah pop time time"
            },
            {
                "ID": "m3jzzdv",
                "Author": "McQuoll",
                "Upvotes": 1,
                "Content": "Exactly!",
                "Processed_Content": "exactly"
            }
        ],
        "labels": {
            "Energy and Industry": 2,
            "Land Use and Agriculture": 2,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 1,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 2,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 1
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 3,
            "Governance and Policy (Causes)": 2,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 3,
            "Extreme Weather Events": 1,
            "Health Risks": 1,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 2,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1gzi6mn",
        "Title": "A programmer estimated he cut thousands of tonnes of emissions just by removing a few lines of code ",
        "Author": "sailonthruthestorm",
        "Upvotes": 120,
        "Created": "2024-11-25 13:56:07",
        "Content": "",
        "Processed_Content": "given power cancel transatlantic flight boost number vegetarian world deleting line code early 2020 programmer danny van kooten published eyecatching blog post explained removed code mailchimp newsletter plugin made wordpress blogging platform time plugins installed two million website small segment code question required 20 kilobyte data making broad assumption many people visited website carbon intensity electricity consumed computer estimated small adjustment replicated widely could slash computingrelated emission equivalent 59000 kilogram co2 every month principle one year much stopping 1200 people flying amsterdam new york blog post soon went viral van kooten tantalising assertion discussed many blog well mainstream medium coverage since yet calculation like surprisingly rare given many million piece software running various machine around world right possible flurry minor programming adjustment across many would significant global impact could save huge amount currently use say laurence tratt professor software development king college london one problem area programming remains frustratingly murky people frame optimisation work term energy organisation make data visible clear add often understand computer program consume energy well enough order make accurate assessment decide improved approach say tratt example energy efficient programming intervention however besides van kooten 2021 hambleton district council england part north yorkshire council responded twitter user pointed file size image council website could smaller therefore quicker load council agreed made necessary change one analysis move independently verified suggested per month alteration could equate preventing boiling water 57000 cup tea biggest thing host page near somebody say andy evadale chief technology officer tangent creative agency explains web developer key role play reducing emission elect store web content server multiple country thus bringing content physically closer user country example mean data transferred shorter distance use le energy depending certain factor also help web page load quickly evadale say tangent client increasingly asking energy efficiency add encouraging among firm customer uk power network organisation responsible maintaining electricity infrastructure much england evadale note using technique including local content delivery team able lower emission single homepage visit uk power network website estimated 144 gram 022 gram co2 equivalent reengineer readersupported publication receive new post support work consider becoming free paid subscriber even programming language choose could impact say rui rua institute system computer engineering technology science porto colleague published paper topic 2017 2021 rua say program written older language c could use much 80 time le energy program written modern language python older language way lowlevel closer language processor understands explains commentator pointed mean write efficient program using python rua acknowledges colleague analysis suggest choice write program including language use may ultimately influence energy consumption tratt agrees stressing even today often still uncertainty specific programming decision reliably relate increased reduced energy use encouraging people look deeper say elephant room though generative ai reported bbc news back may meteoric rise technology raised question much energy large language model llm guzzling sasha luccioni hugging face machine learning company told given task generative ai approach could 33 time energy hungry comparatively traditional algorithm yet many task generative ai quickly becoming default ai big energygobbling beast really matter whether build app python c slim file size image home page might seem like small fry comparison one thing extent adoption matter rui note research touched energy consumption required virtual keyboard android o operating system widely used many smartphones tablet estimated switching lean energy efficient version keyboard could cut energy use associated aspect software 18 imagine choice repeated across two three billion android smartphones use worldwide say interested taking care planet maybe 50 year say lasse natvig norwegian university science technology conscious impact ever currently adjusting course teach student order give even greater focus energy efficient programming technique tiny tweak software like commuter deciding take bike work instead driving car suggests impact multiple individual intervention soon add saying norwegian mange bekker små gjør en stor å tell many small stream make big river earlier week hannah ritchie world data analysed current estimate much energy generative ai might use 2030 gloomiest projection improved recent month partly data centre keep getting efficient check rui rua colleague 2021 paper energy efficient programming language detail study like remain hotly debated programming expert lot resource back idea language python example energy expensive compared c youtuber bryan lunduke posted informative video point month ago scientist reader newsletter might also think energy cost large computer simulation run research modelling work paper nature computational science introduces set principle greener computational science",
        "Selfpost": false,
        "URL": "https://www.thereengineer.pro/p/the-tiny-software-tweaks-that-could",
        "CommCount": 6,
        "Comments": [
            {
                "ID": "lz0e997",
                "Author": "Skateboard_Raptor",
                "Upvotes": 21,
                "Content": "If (emitEmission) {\n\n     dont() ;\n\n};",
                "Processed_Content": "emitemission dont"
            },
            {
                "ID": "lz214de",
                "Author": "brutalspoon",
                "Upvotes": 6,
                "Content": "Yes, specifically Pretty High Pollution 8.3",
                "Processed_Content": "yes specifically pretty high pollution 83"
            },
            {
                "ID": "lzcfsgs",
                "Author": "gavin_shaka",
                "Upvotes": 4,
                "Content": "As a developer who works on building a corporate greenhouse gas emissions calculator & targets product for climate consultants to use, cheers dude. Sometimes it really is that easy.",
                "Processed_Content": "developer work building corporate greenhouse gas emission calculator target product consultant use cheer dude sometimes really easy"
            },
            {
                "ID": "lzi4fyq",
                "Author": "ramakrishnasurathu",
                "Upvotes": 3,
                "Content": "Sometimes less is more, cutting code for a cleaner score!",
                "Processed_Content": "sometimes le cutting code cleaner score"
            },
            {
                "ID": "lz1n91t",
                "Author": "sailonthruthestorm",
                "Upvotes": 2,
                "Content": "Is that PHP?",
                "Processed_Content": "php"
            }
        ],
        "labels": {
            "Energy and Industry": 5,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 3,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 2,
            "Displacement and Migration": 0,
            "Technological Solutions": 3,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 1,
            "Lifestyle Solutions": 1,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 2,
            "Land Use and Agriculture": 1,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 1,
            "Extreme Weather Events": 0,
            "Health Risks": 1,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1gnndrh",
        "Title": "Germany sets new record for renewable power",
        "Author": "SarumanWizard",
        "Upvotes": 111,
        "Created": "2024-11-10 00:47:29",
        "Content": "",
        "Processed_Content": "germany accelerated renewables deployment solar growing record pace wind though currently lagging expected gain momentum future german renewables hit record first nine month 2024 accounting 59 total power generation mark considerable increase 52 period 2023 continues trend strong growth recent year increase renewables share driven wind solar combined grew 40 2023 45 2024 meanwhile share hydro increased 4 5 bioenergy remained largely unchanged renewables generated record 206 twh january september 2024 20 twh 11 period 2023 enough power around 59 million household wind solar generation increased 16 twh 11 also marking new record hydro increased 4 twh 25 year mark major milestone germany electricity generation first nine month 2024 wind solar 156 twh generated electricity fossil fuel 140 twh first year ever continuing pattern observed first half year solar key contributor strong renewables growth germany 2024 solar generated record 62 twh january september 2024 18 increase 53 twh period 2023 result solar accounted nearly half 47 increase germany total renewable generation growth solar electricity driven rapid increase installed capacity since 2022 follows measure accelerate solar rollout increased remuneration simplified grid connection small pv system raised maximum bid solar tender reform reduce bureaucracy measure make easier install solar balcony 2023 germany installed 15 gw new solar double 75 gw addition 2022 rapid growth continued 2024 11 gw installed first nine month year 3 period 2023 mean since start year germany installing 100000 solar panel every day assuming average panel size 400w april 2024 germany already exceeded target reach 88 gw total solar capacity end year wind growth slower compared staggering pace solar still made significant contribution germany renewables growth stronger wind january march 2024 ongoing wind capacity growth boosted generation year first nine month germany installed 23 gw new wind capacity similar period 2023 maintained pace could considered achievement amid global trend slower wind growth consequently wind generated 94 twh january september 2024 7 88 twh period 2023 accounted 31 increase germany renewable generation 3 gw wind capacity added 2023 23 gw added far year germany likely miss target reach 80 gw total installed capacity end 2024 without significant acceleration capacity addition last three month year germany need increase wind addition least 10 gw per year reach 2030 target 145 gw however worth noting germany 2030 wind capacity target third highest world aiming reach 145 gw wind capacity installed 2030 china 800 gw u 369 gw higher target pace wind addition expected accelerate measure introduced tackle permitting delay excessive bureaucracy take effect many measure originate eu emergency permitting regulation recast renewable energy directive red iii germany one quickest member state transpose measure expected material impact wind deployment german government declared renewables overriding public interest privileged legal status unlocks faster permitting simplified procedure furthermore german state required allocate around 2 land wind turbine wind farm typically longer project lead time solar farm partly explains solar addition ramped quickly response germany reform however impact may yet fully visible actual wind addition positive trend auction permitting award recent onshore wind auction awarded record 3 gw capacity first oversubscribed auction since february 2022 brought total awarded onshore wind capacity 2024 7 gw already exceeds 2023 total one auction yet come november onshore wind permitting approval first half 2024 also 32 compared previous year surpassing total approval 2022 data report based ember yearly monthly electricity data download yearly data monthly data solar panel mounted roof farmhouse village bälow germany credit washington imaging alamy stock photo",
        "Selfpost": false,
        "URL": "https://ember-energy.org/latest-insights/germany-sets-new-record-for-renewable-power/",
        "CommCount": 7,
        "Comments": [
            {
                "ID": "lweei6w",
                "Author": "Moldoteck",
                "Upvotes": 2,
                "Content": "I mean, look at Germany's grid these days. Not only coal was ramped up to 20GW and gas to 15GW, but oil was ramped up from 0.3 to 0.6GW for some time and imports are in 6-10-15gw ballpark...",
                "Processed_Content": "mean look germany grid day coal ramped 20gw gas 15gw oil ramped 03 06gw time import 61015gw ballpark"
            },
            {
                "ID": "lwt5qsx",
                "Author": "uujjuu",
                "Upvotes": 2,
                "Content": "Please would you explain how the dependance on Persian exports leads to vulnerability to Israeli extortion? I can believe it reading the insane media reporting here in Germany, but I'd appreciate understand your reading of that underlying dynamic ",
                "Processed_Content": "please would explain dependance persian export lead vulnerability israeli extortion believe reading insane medium reporting germany id appreciate understand reading underlying dynamic"
            },
            {
                "ID": "lwtbm4b",
                "Author": "lowrads",
                "Upvotes": 2,
                "Content": "If Israel attacks Iranian export depots, Iran will retaliate by targeting Iraqi, Saudi, or UAE depots, curtailing exports from the Persian gulf.  Europe is highly dependent upon those imports for electricity, which is needed for industry.  This will have a direct impact on their ability to supply war materiel to Ukraine.",
                "Processed_Content": "israel attack iranian export depot iran retaliate targeting iraqi saudi uae depot curtailing export persian gulf europe highly dependent upon import electricity needed industry direct impact ability supply war materiel ukraine"
            },
            {
                "ID": "lwxhamg",
                "Author": "WingedTorch",
                "Upvotes": 1,
                "Content": "and renewables more than 170 GW in total",
                "Processed_Content": "renewables 170 gw total"
            },
            {
                "ID": "lwxhrcw",
                "Author": "Moldoteck",
                "Upvotes": 0,
                "Content": "that's great!",
                "Processed_Content": "thats great"
            },
            {
                "ID": "lwdsasv",
                "Author": "lowrads",
                "Upvotes": -2,
                "Content": "Germany now gets 25% of their electricity from coal, having reignited their dirty lignite plants after disastrous policies on the premature and possibly irreversible shutdown of nuclear plants. \n\nThey bear principle responsibility for the collapse of industry across Europe, and enablement of the geopolitical position of Russia in Ukraine, and now of dependence upon Persian gulf exports.  As a consequence, they are vulnerable to extortion from Israel, and every political and materiel demand the latter can make of them.\n\nGermany was a disaster for the liberal world and scientific positivism in the early twentieth century, and now again in the twenty first.",
                "Processed_Content": "germany get 25 electricity coal reignited dirty lignite plant disastrous policy premature possibly irreversible shutdown nuclear plant bear principle responsibility collapse industry across europe enablement geopolitical position russia ukraine dependence upon persian gulf export consequence vulnerable extortion israel every political materiel demand latter make germany disaster liberal world scientific positivism early twentieth century twenty first"
            },
            {
                "ID": "lwdw9ib",
                "Author": "Pleiadez",
                "Upvotes": -3,
                "Content": "Funny because these are very old tech solar panels. Very inefficient compared to newer variety.",
                "Processed_Content": "funny old tech solar panel inefficient compared newer variety"
            }
        ],
        "labels": {
            "Energy and Industry": 5,
            "Land Use and Agriculture": 2,
            "Governance and Policy (Causes)": 4,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 40,
            "Governance and Policy (Solutions)": 2,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 2,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 8,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 1,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 2,
            "Governance and Policy (Solutions)": 1,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 1,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1gvlmvk",
        "Title": "The major coal producing country that wants to leave its fossil fuels in the ground",
        "Author": "acrane55",
        "Upvotes": 83,
        "Created": "2024-11-20 10:21:45",
        "Content": "Colombia, in case you're wondering. I never even knew they produced coal, let alone being a major producer.",
        "Processed_Content": "colombia case youre wondering never even knew produced coal let alone major producerother country watching see plan stop selling oil coal successful making leap analyst say reporter seabrookclimate wednesday 20 november 2024 1634 uk please use chrome browser accessible video player dilemma heart global talk burning oil gas coal biggest driver unleashing deadly flooding spain colombia destructive hurricane north atlantic industry producing fossil fuel cash cow making £28bn profit every day last 50 year according one analysis world bank data thats money many nation barely afford live without try lift people poverty provide everyone power country like oilrich saudi arabia azerbaijan hosting current cop29 talk want squeeze every last drop oil lump coal land shifting rule game country trying forge different path un chief antonio guterres declares last 10 year decade deadly heat environment winner loser 2024 2025 set hottest year record president joe biden set new u target week donald trump take office colombia top ten biggest coal producer world yet trying best need shift rule game said environment minister susana muhamad definitely need valuable country keep oil ground forest right valuable take fossil fuel deplete forest said trying shake system plan could create model country follow fails would bode badly fossil fuel producing country world want go green colombia first step end new exploration licence fossil fuel move made country first ever leftist president gustavo petro elected 2022 oil coal key colombia economy generating 8 gdp around half export oil reserve falling still plenty coal replace income amazon nation second step expand part economy cop29 trying woo investment new 40bn portfolio green project including ecotourism sustainable agriculture clean power project generate electricity could export talking uk germany canada u eu well development bank private source muhamad also calling relief debt able borrow money comparable level developed country currently three time expensive average please use chrome browser accessible video player going round circle everyone board plan since announcing credit rating fell accessing capital became even expensive right going around circle old way said muhamed union also worried job challenge admits laura sabogal reyes thinktank e3g working colombian government theyve working policy labour market alongside said tomas gonzalez former colombian conservative energy minister called president petros approach radical long demand someone meet restricting colombian production doesnt reduce emission globally gonzalez said colombia mean major sacrifice fiscal revenue funding public spending world need fossil fuel treaty colombia one 13 country endorsed idea fossil fuel non proliferation treaty aim wind fossil fuel production different country fair way science energy thinktanks agree new fossil fuel project compatible global goal limit warming 15c preindustrial level last year cop28 dubai country agreed transition away fossil fuel historic pledge fossil fuel treaty would plan said tzeporah berman founded treaty treaty would away fossil fuel subsidy artificially distort market inflate supply demand said robbie macpherson churchill fellow researching lesson uk colombia said government braver others trying implement last year pledge follow channel never miss update country watching see colombia attempt move away oil coal successful making leap fossil fuel subsidy relieving country debt funding green project developing nation key part negotiation cop29 due end friday rich government like uk must deliver transition community financially support country like colombia said macpherson critical ensuring world transition away fossil fuel anything like fast enough",
        "Selfpost": false,
        "URL": "https://news.sky.com/story/the-major-coal-producing-country-that-wants-to-leave-its-fossil-fuels-in-the-ground-13254177",
        "CommCount": 5,
        "Comments": [
            {
                "ID": "ly2urkz",
                "Author": "SonofMakuta",
                "Upvotes": 14,
                "Content": "Let's go Colombia! Wishing them the greatest of success.\n\n(Edit: typo)",
                "Processed_Content": "let go colombia wishing greatest success edit typo"
            },
            {
                "ID": "ly5tbg1",
                "Author": "Philosofox",
                "Upvotes": 4,
                "Content": "Col**o**mbia",
                "Processed_Content": "colombia"
            },
            {
                "ID": "lydy4qw",
                "Author": "SonofMakuta",
                "Upvotes": 3,
                "Content": "Thank you!",
                "Processed_Content": "thank"
            },
            {
                "ID": "lydy5gx",
                "Author": "exclaim_bot",
                "Upvotes": 2,
                "Content": ">Thank you!\n\nYou're welcome!",
                "Processed_Content": "thank youre welcome"
            },
            {
                "ID": "lzi1evi",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "A coal-rich nation, a greener path they'll tread.",
                "Processed_Content": "coalrich nation greener path theyll tread"
            }
        ],
        "labels": {
            "Energy and Industry": 31,
            "Land Use and Agriculture": 1,
            "Governance and Policy (Causes)": 8,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 2,
            "Extreme Weather Events": 3,
            "Health Risks": 0,
            "Economic Impact": 3,
            "Displacement and Migration": 0,
            "Technological Solutions": 2,
            "Governance and Policy (Solutions)": 4,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 2
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1gz6lap",
        "Title": "Future Google supplier Kairos gets approval to build two small nuclear reactors",
        "Author": "WaywardPatriot",
        "Upvotes": 87,
        "Created": "2024-11-25 01:55:07",
        "Content": "",
        "Processed_Content": "nuclear startup kairos power received approval u nuclear regulatory commission start construction two test reactor oak ridge tennessee permit mark significant milestone kairos october inked deal google provide 500 megawatt electricity data center fluoridesalt cooled hightemperature reactor scaled version kairos hope ultimately build supply google electricity starting 2030 new reactor technically test bed kairos intends connect power plant grid spokesperson ashley lewis told techcrunch hermes 2 reactor capable producing 35 megawatt heat connected 20 megawatt turbine turn heat electricity kairos commercialscale power plant also feature two reactor capable generating combined 150 megawatt electricity kairos design differs existing nuclear reactor two key way fuel made uranium coated carbon ceramic shell intended durable enough contain fissile material case accident reactor cooled water molten salt small modular reactor smr startup received 303 million award u department energy working year refine molten saltcooling system fluoride salt extremely high boiling point allow coolant flow low pressure mean case accident highpressure radioactive material waiting burst forth pumping system fail plus oak ridge national laboratory say power pump fail moltensalt reactor rely passive convection move salt reactor cool altogether feature enough qualify kairos design generation iv reactor classification system created international organization backed national nuclear agency classification system vague broad hard tell exactly hermes 2 might score rubric kairos inching toward approval reactor design last year half hermes 2 passed safety review nrc july environmental assessment august told took 18 month nrc issue construction permit relatively swift timeline compared previous reactor permit pressure kairos deliver promise company say hope first reactor google deal online 2030 rest completed 2035 world nuclear power decade much time topic senior reporter xai nextgen ai model arrive time adding trend 55 robotics company hiring ce 2025 expect year first biggest tech show tesla cybertruck fails boost 2024 sale annual delivery fall first time internal spacex document show sweet stock deal offered investor like a16z gigafund silicon valley stifled ai doom movement 2024 judge allows california ban addictive feed minor go effect subscribe industry biggest tech news submitting email agree term privacy notice",
        "Selfpost": false,
        "URL": "https://techcrunch.com/2024/11/21/future-google-supplier-kairos-gets-approval-to-build-two-small-nuclear-reactors/",
        "CommCount": 16,
        "Comments": [
            {
                "ID": "lyuof6r",
                "Author": "A_Vespertine",
                "Upvotes": 6,
                "Content": "*tents fingers* Excellent.",
                "Processed_Content": "tent finger excellent"
            },
            {
                "ID": "lyyekxw",
                "Author": "PM_Pics_of_Corgi",
                "Upvotes": 4,
                "Content": "Yeah nuclear energy has so many reasons for concern. Like [how it results in 99.9% fewer deaths than brown coal, 99.8% fewer than coal, 99.7% fewer than oil, and 97.6% fewer than gas](https://ourworldindata.org/nuclear-energy). Or how it’s [one of the most reliable sources of energy with 24/7 operation](https://www.energy.gov/ne/articles/5-fast-facts-about-nuclear-energy), unlike wind and solar.",
                "Processed_Content": "yeah nuclear energy many reason concern like result 999 fewer death brown coal 998 fewer coal 997 fewer oil 976 fewer gashttpsourworldindataorgnuclearenergy one reliable source energy 247 operationhttpswwwenergygovnearticles5fastfactsaboutnuclearenergy unlike wind solar"
            },
            {
                "ID": "lywxpnk",
                "Author": "Alpha3031",
                "Upvotes": 3,
                "Content": "Well, any cost increases for nuclear since the 1970s are irrelevant and costs will come down a whole lot in the near future because of learning just like the nuclear industry promises, but in the meantime renewables will cost what it cost Germany in the 2000s and any change in that is similarly irrelevant.\n\n\nAt least that's the gist I got from the conversation I just had before it ended.",
                "Processed_Content": "well cost increase nuclear since 1970s irrelevant cost come whole lot near future learning like nuclear industry promise meantime renewables cost cost germany 2000s similarly irrelevant least thats gist got conversation ended"
            },
            {
                "ID": "lyvyxmp",
                "Author": "Moldoteck",
                "Upvotes": 2,
                "Content": "it's not super expensive. Costs about 1.5-2x of raw uranium ore (per Jp estimations in the past). You may think that's a lot, till you find out that for the bills you pay, uranium cost is merely 5-10% at most depending on the plant.  \nSolar+bess+firming aren't cheaper per lazard. And that report is overly pessimistic with nuclear (40y lifetime instead of 60+, vogtle costs instead of global average) and assumes 0 transmission cost for renewables (while expanding&maintaining it is extremely costly)  \nYou can also chose to not recycle and vitrify the stuff, very safe option, but it'll be a loss since uranium price will increase when demand grows, meaning recycling is even more favorable. But for cost estimations for such thing, Finland's repository should give a hint  \nAnother option is fast reactors that do work directly on the waste without purex",
                "Processed_Content": "super expensive cost 152x raw uranium ore per jp estimation past may think thats lot till find bill pay uranium cost merely 510 depending plant solarbessfirming arent cheaper per lazard report overly pessimistic nuclear 40y lifetime instead 60 vogtle cost instead global average assumes 0 transmission cost renewables expandingmaintaining extremely costly also chose recycle vitrify stuff safe option itll loss since uranium price increase demand grows meaning recycling even favorable cost estimation thing finland repository give hint another option fast reactor work directly waste without purex"
            },
            {
                "ID": "lywfrgt",
                "Author": "Moldoteck",
                "Upvotes": 2,
                "Content": "? Why instead of relying on vibes you aren't checking real world numbers? Like what are the costs for Finland repository and estimated costs for waste till sealing? Or the costs of recycling at Orano la Hague? Or the cost of Superphenix fast reactor killed by the greens?   \n  \nDo you just hate on nuclear looking at your prev posts in other forums and just unwilling to look at real world data? I mean, you can, but at this point it's not an argument about protecting the climate or the cost and rather an argument to deny reality and push your agenda.",
                "Processed_Content": "instead relying vibe arent checking real world number like cost finland repository estimated cost waste till sealing cost recycling orano la hague cost superphenix fast reactor killed green hate nuclear looking prev post forum unwilling look real world data mean point argument protecting cost rather argument deny reality push agenda"
            },
            {
                "ID": "lywh2yr",
                "Author": "Moldoteck",
                "Upvotes": 2,
                "Content": "the cost at first, looking at lazard report with firming and assumptions like 40y npp life instead of 60 MINIMUM for new units, or vogtle costs instead of global averages, or 0 transmission cost for renewables when it costs a ton.   \nFor recycling - it's 1.5-2x the cost of buying the fuel per Jp estimations. It looks like a lot, but is it relevant when fuel itself is merely 5-10% of the bill you pay for npp power since most of the cost is from operation? And they say it's super complex but what argument is that? You can do tech transfer just like Japan did with Orano la Hague.  \nNeedless to say that payment for fuel storage in us is already regulated. But you can also check out countries that built a repository for the waste, like Finland. The cost isn't that big even if you don't recycle the waste and assume fast reactors will never be redeployed to work on the waste.",
                "Processed_Content": "cost first looking lazard report firming assumption like 40y npp life instead 60 minimum new unit vogtle cost instead global average 0 transmission cost renewables cost ton recycling 152x cost buying fuel per jp estimation look like lot relevant fuel merely 510 bill pay npp power since cost operation say super complex argument tech transfer like japan orano la hague needle say payment fuel storage u already regulated also check country built repository waste like finland cost isnt big even dont recycle waste assume fast reactor never redeployed work waste"
            },
            {
                "ID": "lzi4b6m",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "A nuclear future, a power venture.",
                "Processed_Content": "nuclear future power venture"
            },
            {
                "ID": "lyx34x7",
                "Author": "Alpha3031",
                "Upvotes": 1,
                "Content": "I mean, as long as Google and not the taxpayer is paying for it...",
                "Processed_Content": "mean long google taxpayer paying"
            },
            {
                "ID": "lyv5jf4",
                "Author": "WaywardPatriot",
                "Upvotes": 1,
                "Content": "You are going to get banned for spreading ant-nuclear falsehoods. This is your only warning. Stop doing this and educate yourself.",
                "Processed_Content": "going get banned spreading antnuclear falsehood warning stop educate"
            },
            {
                "ID": "lyvkzpw",
                "Author": "Unknown",
                "Upvotes": 1,
                "Content": "[removed]",
                "Processed_Content": "removed"
            },
            {
                "ID": "lyvz3an",
                "Author": "Moldoteck",
                "Upvotes": 1,
                "Content": "usually ppl that first claim falsehoods should provide proofs, and the others can accept those or provide counter-proofs.",
                "Processed_Content": "usually ppl first claim falsehood provide proof others accept provide counterproofs"
            },
            {
                "ID": "lyz3ei9",
                "Author": "Kaurifish",
                "Upvotes": 0,
                "Content": "Because it’s indefensible.",
                "Processed_Content": "indefensible"
            },
            {
                "ID": "lywf708",
                "Author": "Unknown",
                "Upvotes": 0,
                "Content": "[removed]",
                "Processed_Content": "removed"
            },
            {
                "ID": "lywylzh",
                "Author": "Unknown",
                "Upvotes": -1,
                "Content": "[removed]",
                "Processed_Content": "removed"
            },
            {
                "ID": "lywey0s",
                "Author": "Little-Swan4931",
                "Upvotes": -2,
                "Content": "X10,000",
                "Processed_Content": "x10000"
            },
            {
                "ID": "lyunkf6",
                "Author": "Unknown",
                "Upvotes": -12,
                "Content": "[removed]",
                "Processed_Content": "removed"
            }
        ],
        "labels": {
            "Energy and Industry": 8,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 5,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 4,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 5,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 21,
            "Displacement and Migration": 0,
            "Technological Solutions": 9,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 5,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1guyqxp",
        "Title": "To Cope With Extreme Heat, Paris Will Swap Parking Spaces for Trees",
        "Author": "YaleE360",
        "Upvotes": 85,
        "Created": "2024-11-19 15:44:40",
        "Content": "",
        "Processed_Content": "tree grow near eiffel tower pexels paris aim replace 60000 parking space across city tree end decade according newly released plan plan must still approved council paris lay step help city prepare extreme heat goal ripping parking space part larger aim create 700 acre green space 2030 tree nature natural air conditioner official note development make city pleasant live period high heat plan also call setting cooling center creating carfree zone installing reflective roof 1000 public building elsewhere europe danish lawmaker agreed plan rewild 10 percent country farmland plant 1 billion tree government said plan would bring biggest danish landscape 100 year paris sizzle city light aim get smart heat rebecca mccarthy richard schiffman murat yazar text paul salopek",
        "Selfpost": false,
        "URL": "https://e360.yale.edu/digest/paris-trees-parking-spaces",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "ly2p7qr",
                "Author": "Parisian75009",
                "Upvotes": 5,
                "Content": "They've been doing this for some years now. As well as tackling emissions, it makes streets much easier on the eye.",
                "Processed_Content": "theyve year well tackling emission make street much easier eye"
            },
            {
                "ID": "lzi1d7d",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "Parking for plants, a greener city's planned.",
                "Processed_Content": "parking plant greener city planned"
            }
        ],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 1,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 1,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1geu64n",
        "Title": "Green Concrete: A Major Industry Starts to Clean Up Its Emissions",
        "Author": "YaleE360",
        "Upvotes": 73,
        "Created": "2024-10-29 14:07:10",
        "Content": "Cement production generates massive amounts of carbon dioxide. Increasingly, firms are looking to clean up their operations by sourcing renewable energy, working with greener materials, and deploying carbon capture. [Read more](https://e360.yale.edu/features/concrete-carbon-capture-germany).",
        "Processed_Content": "cement production generates massive amount carbon dioxide increasingly firm looking clean operation sourcing renewable energy working greener material deploying carbon capture read morehttpse360yaleedufeaturesconcretecarboncapturegermany",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1geu64n/green_concrete_a_major_industry_starts_to_clean/",
        "CommCount": 15,
        "Comments": [
            {
                "ID": "luev7ow",
                "Author": "hazel_bit",
                "Upvotes": 13,
                "Content": "DAR is greenwashing. But a plant capturing their emissions at the source as they create them is something they should absolutely be required to do.",
                "Processed_Content": "dar greenwashing plant capturing emission source create something absolutely required"
            },
            {
                "ID": "luf3pj0",
                "Author": "Archivemod",
                "Upvotes": 4,
                "Content": "It's not a replacement for halting new growth. we need less industrialization, not more of it. this shit is always am excuse to further the problem rather than actually solve our overconsumptive habits that led us here and you'll pardon me if I'm a bit touchy about the status quo.",
                "Processed_Content": "replacement halting new growth need le industrialization shit always excuse problem rather actually solve overconsumptive habit led u youll pardon im bit touchy status quo"
            },
            {
                "ID": "lw2gsvv",
                "Author": "lukfi89",
                "Upvotes": 2,
                "Content": "Sure, I apologize, I'm not a native English speaker.\n\nThe issue of existing athmospheric carbon capture technology is that to capture 1 kg of carbon, it consumes 1 kWh of energy (not counting the energy required to build the device). So as long as it is powered from a grid which includes coal in the energy mix, it does more harm than good.\n\nI don't know the details of the cement plan carbon capture technology, but it's important to know its energy needs to say whether it's greenwashing or not.",
                "Processed_Content": "sure apologize im native english speaker issue existing athmospheric carbon capture technology capture 1 kg carbon consumes 1 kwh energy counting energy required build device long powered grid includes coal energy mix harm good dont know detail cement plan carbon capture technology important know energy need say whether greenwashing"
            },
            {
                "ID": "lw2j1a9",
                "Author": "hazel_bit",
                "Upvotes": 2,
                "Content": "ah, I got it. thank you. That makes sense.\n\nSo, in my fantasy world where we're able to casually dictate to companies that this capture is a requirement, the presumption is that we've also already eliminated coal and gas usage altogether and renewable power sources are the only power source.\n\nDreaming big over here.",
                "Processed_Content": "ah got thank make sense fantasy world able casually dictate company capture requirement presumption weve also already eliminated coal gas usage altogether renewable power source power source dreaming big"
            },
            {
                "ID": "luslwjt",
                "Author": "Archivemod",
                "Upvotes": 2,
                "Content": "misread, but yes, industrialism is complex. you can't discard what I'm saying by making a banal statement like this though, they ARE inextricably linked. \n\n\nyou cannot produce excess wealth without some form of product (at least typically) and you need industry of some kind to produce that product.\n\n\nThis isn't to say industry has to be miserable, but we've overinflated its importance and dominance to ridiculous levels.\n\n\ntake, for example, disposable plastics. they are a prime example of something horrid for the environment and dubiously valuable to consumers that sees massive industrial production because it is more efficient as packaging and as a recycled waste product.\n\n\nopposing this state of affairs has proven difficult, since so many capitalists will cry foul that sustainable plastics would bankrupt them, ignoring that it would just be a slight dip in profit margins rather than the catastrophe they pretend it would be.\n\n\nthis is an industry we should question and ideally reduce to the niche uses we have for these plastics, especially in light of their impacts on the planet and health.",
                "Processed_Content": "misread yes industrialism complex cant discard im saying making banal statement like though inextricably linked produce excess wealth without form product least typically need industry kind produce product isnt say industry miserable weve overinflated importance dominance ridiculous level take example disposable plastic prime example something horrid environment dubiously valuable consumer see massive industrial production efficient packaging recycled waste product opposing state affair proven difficult since many capitalist cry foul sustainable plastic would bankrupt ignoring would slight dip profit margin rather catastrophe pretend would industry question ideally reduce niche us plastic especially light impact planet health"
            },
            {
                "ID": "lusvd3c",
                "Author": "SINGULARITY1312",
                "Upvotes": 2,
                "Content": "You can still centralize wealth with little to no industrialization. But I will agree that the way industrialization has been used (and also to your point as well, overemphasized), and I read the rest of your comment and find your criticism is accurate and well thought out. \n\nI don’t know to what degree you ideally would want to decrease industrialization, but if it’s significantly less but also enough to  have tons of public transport, a space program, advanced scientific research, revolutionary technological advancements, and things we can use to help the transition to renewable energies and infrastructure. Though you can still reduce industrialization and ideally have those things with higher efficiency under a liberatory system. This is complicated and to some degree speculative I feel though.",
                "Processed_Content": "still centralize wealth little industrialization agree way industrialization used also point well overemphasized read rest comment find criticism accurate well thought know degree ideally would want decrease industrialization significantly le also enough ton public transport space program advanced scientific research revolutionary technological advancement thing use help transition renewable energy infrastructure though still reduce industrialization ideally thing higher efficiency liberatory system complicated degree speculative feel though"
            },
            {
                "ID": "lw2cw95",
                "Author": "lukfi89",
                "Upvotes": 1,
                "Content": "Depends. Does it capture more carbon than what is generated to cover its energy needs?",
                "Processed_Content": "depends capture carbon generated cover energy need"
            },
            {
                "ID": "lupzex5",
                "Author": "SINGULARITY1312",
                "Upvotes": 1,
                "Content": "Industrialization isn’t the problem it’s capitalism and the state",
                "Processed_Content": "industrialization problem capitalism state"
            },
            {
                "ID": "lw2f3lk",
                "Author": "hazel_bit",
                "Upvotes": 1,
                "Content": "can you rephrase that?",
                "Processed_Content": "rephrase"
            },
            {
                "ID": "lurf1au",
                "Author": "Archivemod",
                "Upvotes": 1,
                "Content": "Industrialism is a part of capitalism, they are intertwined. I'd also argue industrialism cannot exist without exploitation in a myriad of forms, making it something we should truly scrutinize as a part of why capitalism sicks so much.",
                "Processed_Content": "industrialism part capitalism intertwined id also argue industrialism exist without exploitation myriad form making something truly scrutinize part capitalism sick much"
            },
            {
                "ID": "lusid7n",
                "Author": "SINGULARITY1312",
                "Upvotes": 1,
                "Content": "False, you can have capitalism without industrialization and vice versa. Industry is not the problem, it’s just a tool like any other which can be used for good or bad.",
                "Processed_Content": "false capitalism without industrialization vice versa industry problem tool like used good bad"
            },
            {
                "ID": "lwc5rzn",
                "Author": "Old-Adhesiveness-156",
                "Upvotes": 1,
                "Content": "Too bad we killed the nuclear energy industry. It might have been the only way.",
                "Processed_Content": "bad killed nuclear energy industry might way"
            },
            {
                "ID": "lut3a3e",
                "Author": "Archivemod",
                "Upvotes": 1,
                "Content": "largely my interest is in public transit infrastructure. railways are much more cost effective for long distance transportation, and hold up significantly better than roadways and rely less heavily on fossil fuel products like asphalt.\n\n\nFollowing investment in that, I'd like to see a phasing out of cars in favor of enhanced public transit. while there will still be places cars are an unfortunate necessity, it IS possible to update these areas with infrastructure capable of cutting down on emissions and consumer expenses.\n\n\nin turn, this would also conserve our oil reserves to be used for things more necessary to modern life.\n\n\nas for what degree I'd reduce industrialization, If I had the say I'd enact a ban on non-residential high rise buildings entirely. we have enough technology to make work from home the default for the whitecollar sector, and those that require in office security ought to have access to the free space whenever it's not possible to convert it to dense housing. \n\n\nI'd probably slow construction in general and put a kibosh on luxury homes and suburb sprawl. High density housing can be made pretty good now and I think we should invest in that while we still have the materials to make buildings of comfort and long term durability.\n\n\nThe conversation can continue endlessly from there, and I haven't even gotten into the necessity of ballot and electoral reform yet, but these are the relevant pillars my activism is rooted on.",
                "Processed_Content": "largely interest public transit infrastructure railway much cost effective long distance transportation hold significantly better roadway rely le heavily fossil fuel product like asphalt following investment id like see phasing car favor enhanced public transit still place car unfortunate necessity possible update area infrastructure capable cutting emission consumer expense turn would also conserve oil reserve used thing necessary modern life degree id reduce industrialization say id enact ban nonresidential high rise building entirely enough technology make work home default whitecollar sector require office security ought access free space whenever possible convert dense housing id probably slow construction general put kibosh luxury home suburb sprawl high density housing made pretty good think invest still material make building comfort long term durability conversation continue endlessly havent even gotten necessity ballot electoral reform yet relevant pillar activism rooted"
            },
            {
                "ID": "luhin7a",
                "Author": "hazel_bit",
                "Upvotes": 0,
                "Content": "that’s fair. growth isn’t a virtue, it’s cancer.",
                "Processed_Content": "fair growth virtue cancer"
            },
            {
                "ID": "lucvntj",
                "Author": "Archivemod",
                "Upvotes": -4,
                "Content": "carbon capture is a greenwashing scam. stop posting this shit.",
                "Processed_Content": "carbon capture greenwashing scam stop posting shit"
            }
        ],
        "labels": {
            "Energy and Industry": 1,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 1,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 15,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 3,
            "Personal Consumption": 9,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 3,
            "Economic Impact": 5,
            "Displacement and Migration": 0,
            "Technological Solutions": 6,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 3,
            "Lifestyle Solutions": 2,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1ge5aop",
        "Title": "France could mandate climate risk assessments for energy, health, infrastructures and other \"vital\" companies under new national adaptation plan",
        "Author": "EetD",
        "Upvotes": 74,
        "Created": "2024-10-28 16:44:58",
        "Content": "",
        "Processed_Content": "october 25 french government introduced national adaptation plan plan national dadaptation au changement climatique pnacc proposing 50 measure help france prepare 21st century improving workplace condition heatwaves increasing insurance transparency plan address diverse aspect resilience project open public consultation two month proposal may therefore clarified modified even removed final document already represent strong signal economic player article summarizes information available far explore new requirement could implemented practice pnacc present clear vision anticipating impact essential first step adaptation understanding risk help reduce damage extreme event avoid poor decision could jeopardize company vulnerability study required large company soon next year sector plan set ambitious target completion study 2025 large company managing transport energy infrastructure electrical grid rte enedis oil gas grtgaz trapil railway sncf réseau ratp well major highway airport port management company 2025 healthcare social medicosocial facility prioritizing urban highrisk area includes 14000 hospital elder care facility center vulnerable population 2026 operateurs dimportance vitale vital importance operator organization designated military programming law vital nation survival includes approximately 1400 critical site across sector like defense major banking essential infrastructure food processing public organization local authority already conducted vulnerability analysis territory local plan plan climatairenergie territorial pcaet mandatory since 2018 2030 plan public planning document need revised aligned new adaptation scenario government draft provides path forward urging business better understand exposure incorporate risk decisionmaking however specific limited regarding content study vulnerability diagnostics required local authority serve useful reference methodological framework gradually taken shape address wide range topic air river temperature heatwaves freeze cycle precipitation pattern torrential rain snow drought river flow flood mudslide land movement soil swelling shrinkage forest fire storm high wind cyclone pathogen proliferation risk evaluation generally rely biaiscorrected projection drias project however typically qualitative meaning one would rarely find 100years rainfall volume maximum temperature projection 2050 2100 local plan yet value essential practical application sizing drainage system determining power cooling system pnacc vulnerability study provide solid foundation risk reduction strategy within company impact evaluation need quantitative another obvious parallel vulnerability assessment measure proposed pnacc risk evaluation mandated new european regulation corporate sustainability reporting directive csrd new european regulation gradually introduces transparency requirement publicly traded large company first csrd report apply largest european corporation published 2025 include assessment physical risk meanwhile european taxonomy classification system designed help business investor policymakers identify sustainable economic activity considering vulnerability project lifespan exceeding ten year regulation recent methodological framework still established however likely assessment fully overlap vulnerability study required pnacc pnacc assessment focus vital infrastructure organization wil probably emphasize business continuity safety likely require detailed operational approach csrd provides aggregated overview risk however since obligation take effect around time important company subject requirement ensure consistency across different methodology another difference pnacc pcaet study lie geographic scope exactly company vulnerability assessment cover site directly operate might starting point approach quickly show limitation good protect industrial site risk employee supplier essential service depend exposed question scenario used also arises one objective pnacc standardize scenario used france around scenario 4°c assumes average warming 4°c mainland france scenario reflects trajectory late 21th century based current emission reduction policy may suitable project shorter lifespan likely extend beyond 2100 plan address issue specifically nuclear project stating future epr2 reactor latest model applied throughout operating lifespan installation meaning highemission scenario warming could exceed 4°c thus 4°c scenario likely serve baseline scenario may also considered based project duration acceptable risk level organization affected new requirement start today testing free app access local projection based scénario 4°c french reference pathway adaptation want take help pioneer risk assessment france callendar specializes developing accessible solution anticipate effect local scale contact u discus project",
        "Selfpost": false,
        "URL": "https://www.callendar.tech/en/post/climate-risk-assessment-for-french-companies-adapatio-plan",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 3,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 6,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 1,
            "Extreme Weather Events": 7,
            "Health Risks": 0,
            "Economic Impact": 4,
            "Displacement and Migration": 0,
            "Technological Solutions": 5,
            "Governance and Policy (Solutions)": 6,
            "Adaptation and Resilience": 8,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 2
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1hocnil",
        "Title": "What habits are you willing to quit in favor of more sustainable ones?",
        "Author": "DarkPersonal6243",
        "Upvotes": 70,
        "Created": "2024-12-28 20:04:41",
        "Content": "Here's what I'm doing to reduce my emissions.\n\nAfter my trip to England as an American, I will not willingly fly for pleasure again anytime soon.\n\nAdopting a plant-based diet. Not willingly buy industrial meat, dairy, and eggs. Though, I am gaining interest in hog hunting, as feral swine are destructive in the Southeast U.S. where I'm from, and they don't have a natural predator, but if I don't have a way of hunting game, I would remain vegetarian.\n\nComposting. I built two bins outside, one from a Lowe's bucket and another from a tote, also from the same store as the former.\n\nGrowing produce at home. I grew Walmart organic bell peppers from seed with an LED light I'm using as an aquarium light for my 55 gallon freshwater aquarium. I also feed the homegrown peppers to my guinea pigs.\n\nLooking more into home aquaponics. Already doing that with a romaine stalk I have in one of my fish tanks. I want to eventually have all of my fish tanks (freshwater) to grow something aquaponically. I guess being an avid aquarist helps find more sustainable way to get food for not just me, but for my pet guinea pigs.\n\nDoing outdoor gardening as well as the aforementioned aquaponics. I got gardening gloves, shears, and a farmer's almanac for Christmas this year.\n\nHere's some of my long-term goals:\n\nGetting our house solar powered.\n\nNever owning a pure gas vehicle again. I'm looking to get an EV or e bike. In fact, if I remember correctly, I think they're building an EV battery factory just between Savannah and Statesboro on I-16.\n\nBonus: Our gas tank that supplies gas for heaters for the winter months; we've ditched them for a central heat and air system.",
        "Processed_Content": "here im reduce emission trip england american willingly fly pleasure anytime soon adopting plantbased diet willingly buy industrial meat dairy egg though gaining interest hog hunting feral swine destructive southeast u im dont natural predator dont way hunting game would remain vegetarian composting built two bin outside one lowes bucket another tote also store former growing produce home grew walmart organic bell pepper seed led light im using aquarium light 55 gallon freshwater aquarium also feed homegrown pepper guinea pig looking home aquaponics already romaine stalk one fish tank want eventually fish tank freshwater grow something aquaponically guess avid aquarist help find sustainable way get food pet guinea pig outdoor gardening well aforementioned aquaponics got gardening glove shear farmer almanac christmas year here longterm goal getting house solar powered never owning pure gas vehicle im looking get ev e bike fact remember correctly think theyre building ev battery factory savannah statesboro i16 bonus gas tank supply gas heater winter month weve ditched central heat air system",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hocnil/what_habits_are_you_willing_to_quit_in_favor_of/",
        "CommCount": 32,
        "Comments": [
            {
                "ID": "m48p350",
                "Author": "viomore",
                "Upvotes": 26,
                "Content": "Ive nearly quit driving this year, biking is so convenient Im embarrassed its taken me so long to try it for in town stuff. Going to try indoor growing. Been vegetarian, low disposables type house for more than a decade. Would love to support less plastic packaging.",
                "Processed_Content": "ive nearly quit driving year biking convenient im embarrassed taken long try town stuff going try indoor growing vegetarian low disposable type house decade would love support le plastic packaging"
            },
            {
                "ID": "m49dfu8",
                "Author": "michiganxiety",
                "Upvotes": 16,
                "Content": "Great list! I'm happy to see more Americans are understanding the climate impact of flying specifically. Despite living in the Midwest, I've gotten to be something of an Amtrak expert at this point. I recommend Rome2Rio (app or website) for finding alternatives to flying or driving - though if you have an EV perhaps you'd just use that. I have found that avoiding driving has made me really appreciate kicking back in a train though, especially if you can afford to spring for a roomette. \n\nMy things to add for this upcoming year are similar to your electric vehicle idea - I joined an EV carshare and I'm getting an ebike - I can't wait!!\n\nThe only thing \"missing\" I'd mention is getting involved in political solutions, which can seem intimidating but can be as easy as sending a couple pre-written emails! I really like the app Climate Action Now for ease of use, but I also get a lot of action items in my email by subscribing to groups like the Sierra Club, Evergreen Action, the High Speed Rail Alliance and Rail Passengers Association - the latter two being very important if we're going to get people to fly less in this country.",
                "Processed_Content": "great list im happy see american understanding impact flying specifically despite living midwest ive gotten something amtrak expert point recommend rome2rio app website finding alternative flying driving though ev perhaps youd use found avoiding driving made really appreciate kicking back train though especially afford spring roomette thing add upcoming year similar electric vehicle idea joined ev carshare im getting ebike cant wait thing missing id mention getting involved political solution seem intimidating easy sending couple prewritten email really like app action ease use also get lot action item email subscribing group like sierra club evergreen action high speed rail alliance rail passenger association latter two important going get people fly le country"
            },
            {
                "ID": "m49a8og",
                "Author": "dgodog",
                "Upvotes": 9,
                "Content": "I sold my house in an idyllic resort town and moved to a small apartment in the city I grew up in. This drastically reduced my driving and meant I wasn't regularly flying to visit family.",
                "Processed_Content": "sold house idyllic resort town moved small apartment city grew drastically reduced driving meant wasnt regularly flying visit family"
            },
            {
                "ID": "m49o1v0",
                "Author": "AffinitySpace",
                "Upvotes": 6,
                "Content": "We’re electrifying our home and transportation. We have swapped out our gas water heater with a heat pump water heater, our gas range with an induction range, our gas dryer with a heat pump dryer, our single speed pool pump with a variable speed pool pump, all LED lights paired with motion sensors and smart plugs where it makes sense, desertscaped our yard, low flow water appliances, sinks, and showheads throughout, air sealed our home after getting an energy audit, insulating and sealing our duct work next year. Electric yard care tools. From diesel and gas to all EVs, expanded our solar this year to cover 75% of our home based on use before we started in all our efficiency upgrades, smart panel to monitor energy use. I'm hoping with our upgrades, we’ll be able to fully run off of solar. When our hvac systems eventually go our, we’ll replace with heat pump and air handler systems and turn off the natural gas line. \n\nI love the concept of composting and need to get started. I'm always looking to improve.",
                "Processed_Content": "electrifying home transportation swapped gas water heater heat pump water heater gas range induction range gas dryer heat pump dryer single speed pool pump variable speed pool pump led light paired motion sensor smart plug make sense desertscaped yard low flow water appliance sink showheads throughout air sealed home getting energy audit insulating sealing duct work next year electric yard care tool diesel gas ev expanded solar year cover 75 home based use started efficiency upgrade smart panel monitor energy use im hoping upgrade able fully run solar hvac system eventually go replace heat pump air handler system turn natural gas line love concept composting need get started im always looking improve"
            },
            {
                "ID": "m48slzp",
                "Author": "ThinkBookMan",
                "Upvotes": 6,
                "Content": "Where I live doesn't have great public transit but I'm making a resolution to use it at least once a month next year.",
                "Processed_Content": "live doesnt great public transit im making resolution use least month next year"
            },
            {
                "ID": "m4a8h7d",
                "Author": "Digiee-fosho",
                "Upvotes": 5,
                "Content": "I am going to quit eating meat, & dairy, & switch to plant based alternatives. It will not only reduce emissions, but the costs, & federal subsidies by not demanding these products. It will also reduce the risks of disease, & viruses that come from farming livestock, & poultry.",
                "Processed_Content": "going quit eating meat dairy switch plant based alternative reduce emission cost federal subsidy demanding product also reduce risk disease virus come farming livestock poultry"
            },
            {
                "ID": "m48szss",
                "Author": "lowrads",
                "Upvotes": 5,
                "Content": "It was easy enough to program the thermostat to \"bank\" during daylight hours, then idle during peak residential demand.  It's a small thing, but I'll be damned if I am going to do anything favorable to the economics of peaker plant operators.   \n\nIt was also easy to make liberal use of the timers on the washer or dryer, so I don't need to be present to load them at specific times of day.  \n\nI've found the inputs requirement of backyard agriculture to not be worthwhile.  The requirements for embodied energy in the form of amendments, plus all the labor and monitoring don't add up to a reasonable amount of yield.  Most people don't even know how to track their amendment use, and it just adds up to watershed  contamination.  Ergo, all I grow now are herbs.  One mint pot probably puts out enough for the whole neighborhood.\n\nComposting benefits from larger pile dimensions.  It's not a magical embetterment process, but really a hazard mitigation process.  If something is a safe, or pathogen free material, it can be added into the growing area to compost directly in situ.  This tends to confer more nitrogen and carbon residues in place.  Where composting has a benefit, is the heat, which helps break down some unwanted seeds or other propagative tissue.  Anywhere it is cool, they tend to survive, and mobile organisms will likely take those materials with them as they migrate to an optimal temperature.  Ergo, you need an even larger pile, and the means to move it around, or access the most well treated components.",
                "Processed_Content": "easy enough program thermostat bank daylight hour idle peak residential demand small thing ill damned going anything favorable economics peaker plant operator also easy make liberal use timer washer dryer dont need present load specific time day ive found input requirement backyard agriculture worthwhile requirement embodied energy form amendment plus labor monitoring dont add reasonable amount yield people dont even know track amendment use add watershed contamination ergo grow herb one mint pot probably put enough whole neighborhood composting benefit larger pile dimension magical embetterment process really hazard mitigation process something safe pathogen free material added growing area compost directly situ tends confer nitrogen carbon residue place composting benefit heat help break unwanted seed propagative tissue anywhere cool tend survive mobile organism likely take material migrate optimal temperature ergo need even larger pile mean move around access well treated component"
            },
            {
                "ID": "m4aa53m",
                "Author": "rocketpowerdog",
                "Upvotes": 4,
                "Content": "I would love to bike more, but I am terrified of the drivers here and there are no bike lanes or sidewalks to my house. Our next car will at least be a hybrid, if not an ev. As of now, we compost and are converting our residential landscaping to native plants to conserve water and provide habitat/food for pollinators and wildlife. We switched from the gel tabs for laundry and dishwater to powder to lessen microplastics and in general try to reduce plastic where we can (though it seems impossible to do that entirely). And really I try to consume more information climate friendly tips to incorporate into my daily life and vote for politicians and public initiatives that will help as well.",
                "Processed_Content": "would love bike terrified driver bike lane sidewalk house next car least hybrid ev compost converting residential landscaping native plant conserve water provide habitatfood pollinator wildlife switched gel tab laundry dishwater powder lessen microplastics general try reduce plastic though seems impossible entirely really try consume information friendly tip incorporate daily life vote politician public initiative help well"
            },
            {
                "ID": "m4axsal",
                "Author": "the-bearded-omar",
                "Upvotes": 4,
                "Content": "This all sounds wonderful and in line with our goals — can I ask how you went about getting solar installed and if there’s a reasonable financial way to do so?",
                "Processed_Content": "sound wonderful line goal ask went getting solar installed reasonable financial way"
            },
            {
                "ID": "m4b9gx4",
                "Author": "AffinitySpace",
                "Upvotes": 4,
                "Content": "We reached out to a few companies for bids, looked at the best bid for our goal keeping the reputation of the companies in mind. We didn't choose the cheapest bid: we selected a company that gave us a competitive bid and has 4.9 stars on Google with more than 1,000 reviews. \n\nOnce we selected a company, we signed an agreement and they got the panels up on the roof about a month later. \n\nFinancially speaking, cash is ideal, followed by financing, followed by leasing. We did financing with the hope to claim the tax credit in April, then paying the balance of the loan off hopefully by the end of next year; if you're a U.S. resident, there is a national tax rebate for 30% off the price of the panels. You can learn more on the rewiring America website.\n\nIf you have efficient electric appliances and an EV, the break-even point is sped up dramatically, plus there are gasoline and natural gas savings.",
                "Processed_Content": "reached company bid looked best bid goal keeping reputation company mind didnt choose cheapest bid selected company gave u competitive bid 49 star google 1000 review selected company signed agreement got panel roof month later financially speaking cash ideal followed financing followed leasing financing hope claim tax credit april paying balance loan hopefully end next year youre u resident national tax rebate 30 price panel learn rewiring america website efficient electric appliance ev breakeven point sped dramatically plus gasoline natural gas saving"
            },
            {
                "ID": "m49k1ss",
                "Author": "StormWolfHall",
                "Upvotes": 3,
                "Content": "I stopped driving in 2010...",
                "Processed_Content": "stopped driving 2010"
            },
            {
                "ID": "m4hsrp6",
                "Author": "TuringTestTwister",
                "Upvotes": 3,
                "Content": "Stopped eating animal products 3 years ago. Put 35 solar cells on my roof and switched to an electric vehicle. Got rid of my lawn and replaced it with low water native plants. Replaced all lights with LEDs,.",
                "Processed_Content": "stopped eating animal product 3 year ago put 35 solar cell roof switched electric vehicle got rid lawn replaced low water native plant replaced light led"
            },
            {
                "ID": "m4hde2c",
                "Author": "GlassMom",
                "Upvotes": 3,
                "Content": "I drive a Chevy Bolt, and I stop in nearly exactly the same places for charging as I did for gas when I drive from MSP to CHI.  Realistically, I only add about 25 minutes to each stop, because gas and pee took me 20 minutes, anyway.  EV is way cheaper than hybrid, partly because there's nothing on it to fix.  When it comes time, you're gonna love it.  If your car doesn't have the range, the money you save can go toward a rental than will.",
                "Processed_Content": "drive chevy bolt stop nearly exactly place charging gas drive msp chi realistically add 25 minute stop gas pee took 20 minute anyway ev way cheaper hybrid partly there nothing fix come time youre gon na love car doesnt range money save go toward rental"
            },
            {
                "ID": "m4h8u85",
                "Author": "Taste_of_Natatouille",
                "Upvotes": 2,
                "Content": "Things I'm happy to have at least start doing in my living situation and external challenges\n\n-Reduce lights and unnecessary power where I can compared to other people I know and how I used to live. Nothing against how other people I live, I just feel good to notice what I'm doing through others\n\n-My stupid city finally introduced more easy access to recycling, (which literally made me happy) so I started sorting blue bin items, trash and food scraps instead of just collecting bottles to take to a far away centre once a month. Now everything gets picked up here from bins, with more options around for other wastes. Though I have yet to make use of reuse centers.\n\n-I don't own a car despite having a drivers license, and as convenient as it would be to have a sustainable one for some situations, I rely on public transit, public scooters and walking\n\n-Bought reusable things I never thought I'd own before like wooden straws, my own fancy pair of chopsticks for take out, rubber covers for opened food items instead of plastic wrap (where I can) and jars/containers in place of Ziploc bags\n\n-I'm thinking of donating my disfunctional printer to a rage room, and then entering said rage room to smash it\n\n\nWhat I still need to do better on\n\n-Not wasting water during long showers. I'm good for not leaving the sap running when spending the night at someone's place, but I think not having to pay for it where I live- as well as loving hot, cozy showers. That one is a work in progress\n\n-Despite food scrap sorting, I need to work on not wasting food by failing to use something before it goes bad. I'm so sensitive to something potentially expiring that I would throw out something that may still be good just to be safe.\n\n-Come next summer, I want to invest in something I can ride to work instead of public transit. Trying to decide on what though\n\n-Considering recycling or reusing everything else that can be as such but don't go in any of the bins, especially electronics. I wish there were more electronic waste centers around that I can get to\n\n-I live in an apartment, but trust me, if I had a house and could afford to put more greenery around it, I'd do so in a heartbeat",
                "Processed_Content": "thing im happy least start living situation external challenge reduce light unnecessary power compared people know used live nothing people live feel good notice im others stupid city finally introduced easy access recycling literally made happy started sorting blue bin item trash food scrap instead collecting bottle take far away centre month everything get picked bin option around waste though yet make use reuse center dont car despite driver license convenient would sustainable one situation rely public transit public scooter walking bought reusable thing never thought id like wooden straw fancy pair chopstick take rubber cover opened food item instead plastic wrap jarscontainers place ziploc bag im thinking donating disfunctional printer rage room entering said rage room smash still need better wasting water long shower im good leaving sap running spending night someone place think pay live well loving hot cozy shower one work progress despite food scrap sorting need work wasting food failing use something go bad im sensitive something potentially expiring would throw something may still good safe come next summer want invest something ride work instead public transit trying decide though considering recycling reusing everything else dont go bin especially electronics wish electronic waste center around get live apartment trust house could afford put greenery around id heartbeat"
            },
            {
                "ID": "m4p2rmx",
                "Author": "New-Eggplant-3359",
                "Upvotes": 2,
                "Content": "I have been eating mostly vegetarian and vegan food for the last 7 years. \n\nI haven’t flown for the last 8 years. \n\nI pay extra for my electricity to be 100 % renewable and I use it to charge my electric car. (Yes, I know battery manufacture is resource intensive so EV might be a zero sum game.) \n\nI buy almost all my clothes from second hand stores. \n\nWe grow quite a bit of produce ourselves in our garden. \n\nWe have no kids and we hesitate to have any. \n\nThere is more stuff I can’t remember. Put together, a test told me it’s hard for me to minimize my emissions even further on my own. Politicians and manufacturers up the supply chains need to change how things are done.",
                "Processed_Content": "eating mostly vegetarian vegan food last 7 year flown last 8 year pay extra electricity 100 renewable use charge electric car yes know battery manufacture resource intensive ev might zero sum game buy almost clothes second hand store grow quite bit produce garden kid hesitate stuff remember put together test told hard minimize emission even politician manufacturer supply chain need thing done"
            },
            {
                "ID": "m4y1tmo",
                "Author": "poonhound69",
                "Upvotes": 2,
                "Content": "I basically stopped flying. Been on one flight in the last five years. Dropped meat from my diet. Never had kids. ",
                "Processed_Content": "basically stopped flying one flight last five year dropped meat diet never kid"
            },
            {
                "ID": "m4bdgot",
                "Author": "TresGatosFarm",
                "Upvotes": 2,
                "Content": "No more Amazon, no more Coca-Cola, and bringing a mug/tupperware to coffee shops and dining establishments!",
                "Processed_Content": "amazon cocacola bringing mugtupperware coffee shop dining establishment"
            },
            {
                "ID": "m52pe7w",
                "Author": "michiganxiety",
                "Upvotes": 2,
                "Content": "Perhaps time to get involved in an organization pushing for political change then? That's what I did when it felt like I was out of things to do after being vegan, not driving and not flying, and at the time living in an apartment. I've learned SO much and can even claim a small (very small, admittedly, in some cases) portion of several major legislative victories in my state and country, because I met with my elected officials and asked them to vote for them or cosponsor them. Citizens' Climate Lobby is a great organization to join to learn that skill, but there are tons of good organizations to join if you look around. If you don't have time to join, at least sign up for some newsletters so you can send their form letters to your politicians. I promise you, even if it feels silly, it makes a difference.",
                "Processed_Content": "perhaps time get involved organization pushing political thats felt like thing vegan driving flying time living apartment ive learned much even claim small small admittedly case portion several major legislative victory state country met elected official asked vote cosponsor citizen lobby great organization join learn skill ton good organization join look around dont time join least sign newsletter send form letter politician promise even feel silly make difference"
            },
            {
                "ID": "m4hdgiz",
                "Author": "GlassMom",
                "Upvotes": 2,
                "Content": "It's really hard to quit that entirely.  I got close....",
                "Processed_Content": "really hard quit entirely got close"
            },
            {
                "ID": "m4d3w2m",
                "Author": "michiganxiety",
                "Upvotes": 2,
                "Content": "Assuming you're in the US: EnergySage shows competing quotes in your area (it's recommended by the US Department of Energy) and Rewiring America has a huge amount of information about federal tax incentives for solar panels and a lot of the other things listed in this comment. You get 30% of the cost of the solar panels off of your taxes the following year (hopefully the new administration won't kill that immediately...).",
                "Processed_Content": "assuming youre u energysage show competing quote area recommended u department energy rewiring america huge amount information federal tax incentive solar panel lot thing listed comment get 30 cost solar panel tax following year hopefully new administration wont kill immediately"
            },
            {
                "ID": "m55c3vc",
                "Author": "New-Eggplant-3359",
                "Upvotes": 2,
                "Content": "Well done on your results. Yes, I’m a donator to my country’s environmental organization and keep up with what they are doing. I am a researcher in a different field (social sustainability) and do not feel like I have much time and energy to devote to further political commitments on the climate front but of course the thought crosses my mind regularly.",
                "Processed_Content": "well done result yes donator country environmental organization keep researcher different field social sustainability feel like much time energy devote political commitment front course thought cross mind regularly"
            },
            {
                "ID": "m4fh0f9",
                "Author": "TSLsmokey",
                "Upvotes": 1,
                "Content": "I've honestly cut down my driving since I had my climate + politics doom spiral. It kinda helps that my longest drives have vanished after my DnD group fell apart. Nowadays, I don't drive unless I really need to, and I tend to stick around the house to begin with. I'm aiming to get a Hybrid sometime next year as well so I can cut even further. I'd do an EV but where I'm at, that's not exactly viable. I don't eat a lot of beef to begin with so cutting that down is somewhat insignificant on my end. And since I live with my parents(really cheap rent), I don't have much of a say over whether or not we go renewable. I think the majority of energy in my state is renewable to begin with, but I don't know if they've signed up for that plan.",
                "Processed_Content": "ive honestly cut driving since politics doom spiral kinda help longest drive vanished dnd group fell apart nowadays dont drive unless really need tend stick around house begin im aiming get hybrid sometime next year well cut even id ev im thats exactly viable dont eat lot beef begin cutting somewhat insignificant end since live parentsreally cheap rent dont much say whether go renewable think majority energy state renewable begin dont know theyve signed plan"
            },
            {
                "ID": "m4gz0to",
                "Author": "friedaclimb",
                "Upvotes": 1,
                "Content": "1. Planting Native plants in my community, this year I’m focusing on milkweed for the butterflies.\n\n2. More fresh fruit/vegetables in my diet and less plastic. Will be doing more meal prepping and utilizing my freezer to cut on food waste.\n\n3. I don’t live in the most bikeable town but it’s still extremely reasonable for me to bike to get groceries or run small errands.\n\n4. Buying less stuff in general and thrifting, utilizing buy nothing groups when available",
                "Processed_Content": "1 planting native plant community year focusing milkweed butterfly 2 fresh fruitvegetables diet le plastic meal prepping utilizing freezer cut food waste 3 live bikeable town still extremely reasonable bike get grocery run small errand 4 buying le stuff general thrifting utilizing buy nothing group available"
            },
            {
                "ID": "m4jefpb",
                "Author": "carbonmarket",
                "Upvotes": 1,
                "Content": "Have you thought about investing in projects that reduce emissions impact?",
                "Processed_Content": "thought investing project reduce emission impact"
            },
            {
                "ID": "m4lo2u0",
                "Author": "Superb-Inflation4444",
                "Upvotes": 1,
                "Content": "More the fool you! Read Al Gore's 'An Inconvenient Truth' 2006, and see how many of his supposed doom laden predictions have come true! When they don't, they just push back the date another 10 years infernitum! If we stopped burning fossil fuels tomorrow, abstained from eating meat, and the rest of the nonsense being extrapolated by the climate doom mongers, it would reduce global temperatures by an estimated 0.8°F. In order to achieve this, we subjigate the underdeveloped nations to a life of continued poverty and oppression - Oh no, how dare you even consider using fossil fuels to escape poverty and build your economy, its shere hypocrisy!!! Unfortunately, due to the continual MSM daily narrative of a doom laden future and brainwashing of children at school, to the disgraceful point where they are scared shitless, while global elites and celebrities fly around in their private jets attending all these nefarious functions on climate change. Disgraceful! It's very much Do As We Say, And Not As We Do!  Whilst, anybody who criticises the narrative is called a skeptic. We'll, I think Thomas Huxley sumed it up perfectly with his saying, \"Skepticism is the highest of duties, blind faith the one unpardonable sin.\" Consenus isn't scientific, and science is never settled. Otherwise, why continue to spend trillions of dollars for a science is is settled!!!!",
                "Processed_Content": "fool read al gore inconvenient truth 2006 see many supposed doom laden prediction come true dont push back date another 10 year infernitum stopped burning fossil fuel tomorrow abstained eating meat rest nonsense extrapolated doom monger would reduce global temperature estimated 08°f order achieve subjigate underdeveloped nation life continued poverty oppression oh dare even consider using fossil fuel escape poverty build economy shere hypocrisy unfortunately due continual msm daily narrative doom laden future brainwashing child school disgraceful point scared shitless global elite celebrity fly around private jet attending nefarious function disgraceful much say whilst anybody criticises narrative called skeptic well think thomas huxley sumed perfectly saying skepticism highest duty blind faith one unpardonable sin consenus isnt scientific science never settled otherwise continue spend trillion dollar science settled"
            },
            {
                "ID": "m53wbuw",
                "Author": "lucytiger",
                "Upvotes": 1,
                "Content": "Plant-based diet, swapping disposables for reusables (safety razor, menstrual cup, towels and rags instead of paper towels, etc.), contacting my elected officials about climate and energy policies, composting, saving for a heat pump and solar panels",
                "Processed_Content": "plantbased diet swapping disposable reusables safety razor menstrual cup towel rag instead paper towel etc contacting elected official energy policy composting saving heat pump solar panel"
            },
            {
                "ID": "m4a7qkx",
                "Author": "NationalGeometric",
                "Upvotes": 1,
                "Content": "Capitalism",
                "Processed_Content": "capitalism"
            },
            {
                "ID": "m4cmvbs",
                "Author": "DarkPersonal6243",
                "Upvotes": 1,
                "Content": "To be fair though, I'm a sucker for Cherry Zero cokes, but I am letting the chances of it going to a landfill on a freezing day in hell, by turning them into planters and drilling holes for water to escape!\n\n\nIn other words, I'm reusing those bottles as planters.",
                "Processed_Content": "fair though im sucker cherry zero coke letting chance going landfill freezing day hell turning planter drilling hole water escape word im reusing bottle planter"
            },
            {
                "ID": "m4bmivr",
                "Author": "carliciousness",
                "Upvotes": 0,
                "Content": "I don't Amazon",
                "Processed_Content": "dont amazon"
            },
            {
                "ID": "m4hevj6",
                "Author": "GlassMom",
                "Upvotes": 0,
                "Content": "Silly thing, but a different approach.  I'm effectively not bringing liquids into my house at all in 2025.  I have an RO filter, so anything that has to get to where I am is powdered, or in the case of my CO2 bubbles, compressed in a tank.  I use laundry detergent sheets, and get ethanol to make cleaning products from a local producer (we grow corn, here).  Trucking water in any form, mixed with whatever outside fresh produce unavailable locally could be reserved for water into emergencies like droughts and storm recovery.\n\nI've also built an indoor plant shelf and am newly growing my own arugla and spinach in those 12\"x9\"x2\" kid art pans--they work great!",
                "Processed_Content": "silly thing different approach im effectively bringing liquid house 2025 ro filter anything get powdered case co2 bubble compressed tank use laundry detergent sheet get ethanol make cleaning product local producer grow corn trucking water form mixed whatever outside fresh produce unavailable locally could reserved water emergency like drought storm recovery ive also built indoor plant shelf newly growing arugla spinach 12x9x2 kid art pansthey work great"
            }
        ],
        "labels": {
            "Energy and Industry": 3,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 1,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 2,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 1,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 17,
            "Land Use and Agriculture": 3,
            "Governance and Policy (Causes)": 4,
            "Personal Consumption": 21,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 2,
            "Health Risks": 2,
            "Economic Impact": 4,
            "Displacement and Migration": 0,
            "Technological Solutions": 17,
            "Governance and Policy (Solutions)": 1,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 13,
            "Nature-Based Solutions": 1
        }
    },
    {
        "ID": "1h501tp",
        "Title": "Organizations tackle droughts, floods in Brazil by planting forests",
        "Author": "corpse_brigadier",
        "Upvotes": 63,
        "Created": "2024-12-02 18:14:17",
        "Content": "",
        "Processed_Content": "antonina brazil southern brazilian state paraná small coastal town antonina get abundant highquality water nearly 20000 inhabitant nearby water reserve one three ngo wildlife research environmental education society spvs established help bring back biodiversity water security degraded area anyone visiting reserve difficult imagine thriving forest covering 19000 hectare 47000 acre vast void buffalo pasture two decade ago today nearly entire area restored using dozen native tree specie spvs work ongoing seedling nursery providing example possible repair degraded natural world spvs founder clóvis ricardo schrappe borges said restoration project still progress already resulted several boon region addition increasing water security reserve vegetation capture carbon atmosphere provides surrounding town revenue tax policy called ecological icms financially compensates municipality establishing reserve sustainable use area indigenous territory three water reserve part overarching protected area called atlantic forest great reserve area encompassing 27 million hectare 67 million acre land another 22 million hectare 54 million acre marine habitat state paraná santa catarina são paulo largest continuous remaining area biome home indigenous traditional community historical heritage course valuable fauna flora borges told mongabay interview paraná state experiencing water concern drought rise brazil according brazilian research collective mapbiomas 183 million hectare 452 million acre 2 country covered freshwater 2023 decline historical average proportionally western brazil boggy pantanal region lost water faced increasing drought conservation group government agency looking natural solution planting tree preserving restoring forest scientist say essential drought protection tree root help channel store precipitation ground canopy shield soil evaporative sunlight spvs alone mission many project small local initiative larger ambitious venture endeavored preserve brazil remaining forest restore site native vegetation wiped biochronos project instance led laboratory evolutionary ecology biodiversity federal university mina gerais ufmg aim increase biodiversity ecological functioning area doce river basin affected collapse mining tailing dam 2015 participant say project begin important gain clear understanding restoration target look like ufmg analyzed characteristic soil collected dam disaster deposited estimated 62 million cubic meter 22 billion cubic foot sediment along doce river considered world worst tailing dam accident order create reference local restoration effort use baseline understanding ecological lifehistory trait plant specie relate soil factor important step provide scientificbased knowledge support policy ecosystem recovery restoration stretch rio doce watershed ufmg researcher wrote study published earlier year riverbank riparian vegetation protect drought period heavy rain forest cover reduces flow water land river lowering risk flood vegetation also prevents erosion root help hold soil place severe flood hit southern state rio grande sul least four time since late 2023 severest instance may 2024 resulted displacement 581000 people death 169 scientist say increasing incidence extreme precipitation event taquari valley region southwestern brazil particularly affected event 10 native riparian vegetation remains according unpublished research conducted taquari valley riparian forest movement independent civil society association recently began working restore valley vegetation using native specie 4 million seed 20 specie collected association taskforce volunteer handful researcher technician well private public institution association also aim restore region soil degraded recent flooding well monitor combat invasive specie proposing rebuild riparian forest essential end destroyed every flood said karina barth ludvig biologist affiliated taquari valley riparian forest movement quick measure idea raise awareness hold environmental education event support technical study carry technical study assessment riparian forest provide many ecosystem service addition protection flood including shielding water source pollution river forest many functionality said gustavo ribas curcio agronomic engineer researcher stateowned brazilian agricultural research corporation embrapa robust sufficiently wide forest prevents minimizes entry sediment pesticide fertilizer etc come erosion slope curcio added preserving restoring forest along river body water also help safeguard wildlife greater diversity forest greater niche sheltering fauna protecting ecological corridor said even important factor extent forest forest also capable becoming stronghold tree specie longer found area dominated agribusiness reap benefit curcio said care must taken restore area right way includes restoring upstream downstream mitigate redegradation area due issue river could flow downstream factor consider according curcio include nontree vegetation diversity soil characteristic local topography landscape characteristic initiative yielding benefit locally regionally conservationist say effort need made larger scale guarantee need nature people across country however borges curcio say brazil lack federal political take country numerous restoration project fragmented smallscale approach broad public policy could applied enforced countrywide project limited specific region curcio said lack civil awareness built public policy give u stronger position issue according brazilian legislation known forest code vegetation environmental function preserving water resource landscape geological stability biodiversity facilitating gene flow fauna flora protecting soil ensuring wellbeing human population considered permanent preservation area law also state size area vegetation preserved dependent length type water body according curcio strategy wrong consider important factor terrain slope soil characteristic cause ecological tension width river bank side slope said sandy soil example suffers erosion clay soil 2012 government changed forest code loosen requirement size water body vegetation buffer borges expressed concern saying allowed landowner preserve le forest adding enforcement also issue farreaching change brazilian forest code 2012 led significant weakening safeguard biodiversity conservation private property borges said reached comment representative brazil ministry environment refuted 2012 policy change significant law 126512012 requires conservation least 30 meter 100 foot around water course exception provided legislation rural area consolidated 2008 representative told mongabay email limit imposed forest code minimum however meaning state municipality make stricter regulation added federal government offer financial kind incentive protection riparian forest recently approved new forest protection plan within scope safra plan example rural property completed analysis rural environmental registry 05 discount interest rate representative said ministry environment ministry agriculture livestock also working develop lowrate credit line stimulate conservation native vegetation contribute maintaining water resource another measure approval october 11 national plan recovery native vegetation representative wrote expected result include drafting approval national water resource council guideline river basin committee water agency prioritize allocation fund collected water use support recovery permanent preservation area legal reserve priority area borges said despite challenge hopeful future qualified management natural reserve could stimulate protection area public private incorporating value nature conservation business citation figueiredo j c negreiros ramos l paiva c oki justino w … fernandes g w 2024 reference site threatened riverine atlantic forest upper rio doce watershed nature conservation research 9 1 5871 doi 1024189ncr2024006 banner image spvs restoration activity ellen nemitz mongabay feedback use form send message editor post want post public comment bottom page",
        "Selfpost": false,
        "URL": "https://news.mongabay.com/2024/11/organizations-tackle-droughts-floods-in-brazil-by-planting-forests/",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "m0bk07n",
                "Author": "Confident_Home487",
                "Upvotes": 1,
                "Content": "Yes guys, the people who brainwashed you into this crap put out more CO2 emissions per person per year than a freaking small country.\n\nDid you ever think about that 🤔\n\nPrivate jets and yachts and whatnot. Daily jet trips might I add.",
                "Processed_Content": "yes guy people brainwashed crap put co2 emission per person per year freaking small country ever think 🤔 private jet yacht whatnot daily jet trip might add"
            }
        ],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 4,
            "Governance and Policy (Causes)": 11,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 47,
            "Extreme Weather Events": 10,
            "Health Risks": 1,
            "Economic Impact": 0,
            "Displacement and Migration": 1,
            "Technological Solutions": 1,
            "Governance and Policy (Solutions)": 9,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 38
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1h1m7ue",
        "Title": "Chinese team’s cell turns ambient heat into power – no sunlight required",
        "Author": "swagmond27",
        "Upvotes": 60,
        "Created": "2024-11-28 03:57:25",
        "Content": "",
        "Processed_Content": "researcher say sealed hydrovoltaic cell could used harsh environment like desert dark chinese researcher say found way continuously produce electricity water within sealed container drawing heat surround create vapour power generation solarbased hydrovoltaic cell need sunlight work team chinese academy science say cell resistance wind humidity mean could used harsh environment like desert dark fabricate hermetic hydrovoltaic cell hhc harvest ambient heat fully addressed limitation posed environmental condition team wrote paper published peerreviewed journal nature communication november 12 anticipate hermetic hydrovoltaic cell internal circulation hydrovoltaic effect enables generation electricity low cost easy accessibility wide applicability said cell achieved stable electricity output 160 hour negligible water consumption could make good candidate extreme environment like waterscarce desert humid tropical rainforest underground engineering site",
        "Selfpost": false,
        "URL": "https://www.scmp.com/news/china/science/article/3288316/chinese-teams-cell-turns-ambient-heat-power-no-sunlight-required",
        "CommCount": 7,
        "Comments": [
            {
                "ID": "lzdguln",
                "Author": "nsefan",
                "Upvotes": 8,
                "Content": "This sounds more applicable for nanowatt power applications. Interesting but not really significant when it comes to cleaning up mass energy production.",
                "Processed_Content": "sound applicable nanowatt power application interesting really significant come cleaning mass energy production"
            },
            {
                "ID": "lzcujqh",
                "Author": "yuckyucky",
                "Upvotes": 8,
                "Content": "i assume this won't make large amounts of power for general household use?",
                "Processed_Content": "assume wont make large amount power general household use"
            },
            {
                "ID": "lzed5t6",
                "Author": "Ciertocarentin",
                "Upvotes": 3,
                "Content": "Thermopiles have been doing that since before I was born. (in fact, any bimetallic contact exhibiting differences  in their thermodynamic and electrical properties does so)",
                "Processed_Content": "thermopile since born fact bimetallic contact exhibiting difference thermodynamic electrical property"
            },
            {
                "ID": "lzi4hr5",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "With heat in the air, power's everywhere – no sun needed, it's fair!",
                "Processed_Content": "heat air power everywhere sun needed fair"
            },
            {
                "ID": "lzeyas8",
                "Author": "Sven4president",
                "Upvotes": 1,
                "Content": "What do you mean in regards to this article and Newtons 2nd law?",
                "Processed_Content": "mean regard article newton 2nd law"
            },
            {
                "ID": "lzearzf",
                "Author": "Possible-Whole9366",
                "Upvotes": -1,
                "Content": "Do people not understand Newtons 2nd law?",
                "Processed_Content": "people understand newton 2nd law"
            },
            {
                "ID": "lzfzzzk",
                "Author": "Possible-Whole9366",
                "Upvotes": -1,
                "Content": "Energy only becomes more disorganized. You can't get substantial energy from ambient heat without putting more energy into it.",
                "Processed_Content": "energy becomes disorganized cant get substantial energy ambient heat without putting energy"
            }
        ],
        "labels": {
            "Energy and Industry": 3,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 2,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 1,
            "Displacement and Migration": 0,
            "Technological Solutions": 1,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 1,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1gwogp7",
        "Title": "HUD’s $1 Billion Climate Upgrade: Bringing Green Living to Low-Income Renters Nationwide",
        "Author": "Bitter-Lengthiness-2",
        "Upvotes": 48,
        "Created": "2024-11-21 20:49:52",
        "Content": "",
        "Processed_Content": "renter aging affordable housing unit finally seeing clean energy future hud wrap 1 billion program modernize building cut carbon emission jennifer mcdermott report associated press short key quote program brings hud subsidized unit 21st century help make sure people lowincome left behind energy improvement need happen happening across country adrianne todman deputy secretary hud matter affordable housing essential many unit outdated vulnerable impact lowering utility bill increasing energy efficiency upgrade fight also improve health safety vulnerable resident nationwide read mokshda kaul making clean energy transition work",
        "Selfpost": false,
        "URL": "https://www.dailyclimate.org/a-billion-dollar-investment-bring-climate-friendly-housing-upgrades-to-low-income-renters-2669959007.html",
        "CommCount": 3,
        "Comments": [
            {
                "ID": "lyapckx",
                "Author": "Bitter-Lengthiness-2",
                "Upvotes": 4,
                "Content": "The U.S. Department of Housing and Urban Development (HUD) has concluded its $1 billion Green and Resilient Retrofit Program, aimed at modernizing affordable housing across 42 states. This initiative has provided over 30,000 rental homes with energy-efficient upgrades, including solar panels, energy-efficient windows, and floodproofing measures. These enhancements are designed to reduce energy costs, lower carbon emissions, and increase the safety of buildings during extreme weather events. Residents, such as seniors in New Orleans and Pittsburgh, have noted that these improvements address longstanding maintenance issues and offer greater security during natural disasters.\n\nAdrianne Todman, HUD’s deputy secretary, emphasized that the program brings subsidized units into the 21st century, ensuring that low-income individuals are not left behind in the nation’s energy improvements. By lowering utility bills and increasing energy efficiency, these upgrades not only combat climate change but also enhance the health and safety of vulnerable residents nationwide. This comprehensive approach underscores the importance of integrating environmental sustainability with social equity, particularly in housing policies affecting low-income communities.",
                "Processed_Content": "u department housing urban development hud concluded 1 billion green resilient retrofit program aimed modernizing affordable housing across 42 state initiative provided 30000 rental home energyefficient upgrade including solar panel energyefficient window floodproofing measure enhancement designed reduce energy cost lower carbon emission increase safety building extreme weather event resident senior new orleans pittsburgh noted improvement address longstanding maintenance issue offer greater security natural disaster adrianne todman hud deputy secretary emphasized program brings subsidized unit 21st century ensuring lowincome individual left behind nation energy improvement lowering utility bill increasing energy efficiency upgrade combat also enhance health safety vulnerable resident nationwide comprehensive approach underscore importance integrating environmental sustainability social equity particularly housing policy affecting lowincome community"
            },
            {
                "ID": "lzi1ge6",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "A billion-dollar boost, for greener homes, it's true.",
                "Processed_Content": "billiondollar boost greener home true"
            },
            {
                "ID": "m1rwzoq",
                "Author": "mrpuma2u",
                "Upvotes": 1,
                "Content": "It makes dollars and sense, we all need energy efficient homes, but people on the lowest income levels need it more, not having high utility expenses would help them out.",
                "Processed_Content": "make dollar sense need energy efficient home people lowest income level need high utility expense would help"
            }
        ],
        "labels": {
            "Energy and Industry": 1,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 2,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 5,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 1,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 1,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 1,
            "Health Risks": 2,
            "Economic Impact": 1,
            "Displacement and Migration": 1,
            "Technological Solutions": 5,
            "Governance and Policy (Solutions)": 1,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 1,
            "Nature-Based Solutions": 1
        }
    },
    {
        "ID": "1hg48tm",
        "Title": "Industrial electrification is here!",
        "Author": "Jbikecommuter",
        "Upvotes": 20,
        "Created": "2024-12-17 07:02:35",
        "Content": "",
        "Processed_Content": "december 12 2024 industrial energy use including heat industrial process significant source carbon emission europe accounting 20 region greenhouse gas emission meet renewable energy goal industrial decarbonisation need accelerate reducing emission process heat possible using increasingly clean electricity instead fossil fuel currently predominate process heating account twothirds industrial energy use potential electrification vast activity food processing pulp papermaking production chemical steel cement existing technology could electrify 60 process heating today potential 90 technology expected reach market 2035 yet 3 process heating demand electrified 2020 report examines barrier standing way electrification policymakers comprehensively address designing coordinated policy mix benefit electrification extend well beyond reducing carbon emission electrification also support european clean tech manufacturing industry reduces europe dependence fossil fuel import improves efficiency reduces pollution industrial electrification solution varied versatile able offer better productivity process control safety flexibility fossil fuel counterpart policymakers seeking accelerate electrification number tool policy instrument available report organise five group addressing different need type barrier decisionmakers design combination specific measure best fit context goal drawing policy tool five group example electrification policy action support european commission focus decarbonising industry improving economic competitiveness report also offer 10point action plan putting place policy measure address electrification need barrier vice president │ principal european programme director associate topic november 14 2024 november 25 2024 november 14 2024",
        "Selfpost": false,
        "URL": "https://www.raponline.org/knowledge-center/some-like-it-hot-moving-industrial-electrification-from-potential-to-practice/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 10,
            "Land Use and Agriculture": 1,
            "Governance and Policy (Causes)": 5,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 1,
            "Extreme Weather Events": 0,
            "Health Risks": 1,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 2,
            "Governance and Policy (Solutions)": 5,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1gslji8",
        "Title": "How ‘sponge city’ Rotterdam is adapting to climate change",
        "Author": "acrane55",
        "Upvotes": 20,
        "Created": "2024-11-16 12:40:55",
        "Content": "",
        "Processed_Content": "despite persistent drizzle potential clearly seen curving expanse disused hofbogenlijn rail viaduct become elevated linear park mention hword emiel arends urban planner working rotterdam municipal department get yes version high line inevitable parallel leg poor excuse high line seen place greenwich 6mwide 8mhigh brick viaduct snake way across 2km northern rotterdam originally constructed 1908 first electric railway netherlands disused since 2006 cut dense residential neighbourhood long acted barrier known hofbogenpark conversely linking area together arch former station already renovated provide home business ranging bike repair shop michelinstarred restaurant park incorporate series platform constructed along length provide space community activity event tailored need local resident extensive workshopping one table bench working one water feature designed quiet contemplation place reading one play area child map rotterdam sponge city dirk van peijpe founder landscape architecture urbanism practice de urbanisten leading design also point biodiversity call natureinclusivity spoke robert hammond one originator kind father new york high line said actually jealous u laugh elevated element part larger network park interacting surrounding streetscapes tree planted ground level alongside full soil project also incorporates circular water system rainwater collected roof naturally purified sand filter stored attenuation tank ground used irrigating plant tree designed natural ecological landscape compared garden architecture high line say van peijpe piet oudolf design pleasing plant nice texture basically people lot design animal want need bench shade path butterfly instance need nettle lay egg investment city project also investment environment hedgehog butterfly wild bee toad hofbogenpark ambition one seven large project focused around public space municipality rotterdam commissioned across city together amount exercise urban greening resilience scale rarely undertaken hofbogenpark credit de urbanisten project range adaptation greening major existing public space revitalisation marginal district innercity hofplein iconic gathering place way trafalgar square london car lane reduced prioritise pedestrian cycling afield new tidal park laid adjacent relocated feyenoord football stadium maas river delta six project including hofbogenpark form new green axis cutting city total representing massive extension green blue infrastructure course netherlands famous dyke stranger large environmental infrastructure project particularly come land reclamation protection inundation sea rotterdam built delta always especially vulnerable sea still pose threat rising tide caused bombed second world war rebuilt excess concrete road hardsurfaced public space city also vulnerable flooding heavy rain front becoming increasingly common past decade number initiative city sought find way mitigate risk notable watersquare benthemplein completed 2013 another project commissioned municipality designed de urbanisten piloted concept since copied around world square contains three stepped sunken area 70 per cent year sat around skated serve small performance auditorium wet month however sunken area become basin surface attenuation tank hold excess rainwater runoff appearing water feature square sponge garden 2019 credit de urbanisten project also piloted funding model whereby municipal fund assigned drainage sewage could redeployed simultaneously finance create highquality public space another pilot project de urbanisten initiated 201819 creation sponge garden drawing sponge city concept first developed china explored naturebased solution soil planting type permeable surface could help combat flooding store rainwater harvesting time drought scale climateresilient measure across city supercharged 2018 bert wijbenga vicemayor enforcement public space integration community challenged department come idea radically increase green space across city sponge city concept credit de urbanisten gave u three month come plan recall arends result became seven city project idea create nice green place also enjoy associated health benefit benefit economic benefit would offer presented came mayor vicemayors estimating would cost roughly around €380 million actually agreed indeed actually funding back political happy coincidence dutch energy company eneco city owned around 30 per cent stock privatised big influx money part reserved city project explains arends also point 10 per cent total spent city project still financed externally real estate development emphasis public green space strengthened covid pandemic originally five project became seven two alexanderplein northeast edge city rijnhaven innercity dock linked adjacent development land reflects another city priority addressing acute housing shortage city particularly young people 60 per cent 70 per cent housing rotterdam stateprovided city currently overall target 50000 unit rijnhaven credit city rotterdam alexanderplein rijnhaven project adjacent metro stop idea much cluster development around public transport reduce car use say chantal zeegers vicemayor construction housing together vincent karremans wijbenga successor leading seven city project city council asked potential tension environment development evident even job title told rotterdam central district website focus renewable energy go handinhand housing sustainable development future need thinking adaptation effectively integrating renewable energy circular construction portfolio align well since challenge extends particularly built environment delicate balance environment development perhaps best seen rijnhaven site 18ha park new city beach currently created u practice michael van valkenburgh associate formed 14 million 3 sand dredged brought barge twice day pumped onto site dock two floating park pontoon swimmer besides beach behind beach tower 100m 250m high rise 11storey podium block development provide 3000 home plus shop restaurant new cultural venue include relocated netherlands fotomuseum open end 2025 former coffee warehouse retrofitted hamburgbased rhwz architekten rotterdam wdjarchitecten exactly dubai emphasis rijnhaven clearly much new housing commercial development green open space van peijpe admits somewhat critical term funding two additional project purely investment public money green infrastructure really integrated superlargescale commercial development course important city critique would development pay green space case rijnhaven credit city rotterdam also think design park rijnhaven could worked harder environmentally beach little bit tidal nature water sort dump kind floating stuff pontoon swimming etc rotterdam part delta landscape dominated interaction sea river tide think could little bit radical reintroducing original nature urban environment could like tidal park would powerful dynamic middle city certainly world away keilehaven site river practice completed tidal park disused dock gabions made recycled demolition waste already banked silt sandbank reed wild goose settle grass next dock hardstanding project received natureinclusive building design award year cited integration nature every aspect design scalability delta location part strategy enhance river quality central green public space offer people stronger experience dynamism delta say van peijpe back hofbogenpark go stair pop former station get coffee new café project nicely combine retrofit regeneration climateresilient feature build de urbanisten previous project climateadaptive public space circular water system natureinclusive planting design feature hedgehog bridge upwards keilehaven tidal park 2024 credit de urbanisten granular level design detailing niels de zwart ecologist director natural history museum rotterdam see key increasing biodiversity across city idea explored exhibition curated national park rotterdam museum every building incorporate bat bird box green roof compulsory say see city planning policy crucial wider aim think adding biodiversity max every development front process bit green end every development show biodiversity net gain system habitat banking key question though leverage finance climateresilient measure usually seen added cost something economist mark bode exploring work organisation rebel flora fauna look naturebased solution resilience finance say watersquare benthemplein concept credit de urbanisten point capital cost also maintenance often account 40 per cent total need able show upfront monetisable benefit cost immediate one water retention cooling drought avoidance also le obvious one reduction longterm healthcare need benchmark climateadaptive nature positive development need able show cheaper design measure start say careful monitoring seven city project postoccupancy evaluation animal human user alike crucial developing business case make thing replicable inherent tension sheer ambition rotterdam seven city project linking development environmental agenda impressive perfect show possible political albeit enabled part cash windfall granular design feature project site impress making immense difference many small move van peijpe put making gentler city hofbogenpark credit de urbanisten 2kmlong city park roof former railway viaduct designed create natural environment local resident visitor walk meet relax greenery added space balcony larger platform activity also designed increase biodiversity natureinclusive access point bridge animal hedgehog providing cooling shade summer incorporates selfsustaining water system rainwater collected stored attenuation tank help combat flooding drought start site 2025 completion 2026 first phase end 2027 full completion project cost €537 million roof park €75 million total including bridge a20 road greening surrounding street gross site area 10450m 2 total area greenery site 1000m 2 water client municipality rotterdam landscape architectdesigner de urbanisten planting plan d landscape architecture entrance balcony design bureau van eig inspection path design tak architect lighting plan atelier light color roof construction water storage consultant de dakdokters wavin advice technical installation pond roof hb watertechniek advice technical structure helophyte filter field factor construction hofbogenpark test setup de dakdokters main contractor tbc landfill contractor boskalis rijnhaven credit city rotterdam central previously industrial pentagonal harbour see top image reformed new 18ha citycentre park partly land partly floating mixeduse district part harbour filled order create park city beach 3000 new home 50 per cent designated social affordable workspace shop restaurant social facility arranged block 100m 250m tall park posthumalaan street partly floating area park jetty accessible quay nearby wilhelminaplein rijnhaven metro station serve site cyclist pedestrian priority around harbour crosswater transport also provided start site 2027 expected completion 2029 park 2040 housing full development project cost circa €24 million park including landfill cost €120 million public work gross site area 58000m 2 client municipality rotterdam landscape architect mvva michael van valkenburgh associate municipality designer main contractor tbc landfill contractor boskalis keilehaven tidal park credit de urbanisten park occupies former industrial dock bank maas river transforming ecologically valuable area everchanging part park accessible low tide result dynamic public space enhances biodiversity also offer visitor encounter nature kingfisher dragonfly cormorant goose already attracted increasingly rich underwater life park combine recreational educational function circular construction practice reusing recycling local material quay cobblestone demolition waste filling gabions start site 2024 completion 2024 project cost undisclosed gross site area 10548m² client municipality rotterdam designer de urbanisten collaboration ark nature development city rotterdam watersquare benthemplein credit de urbanisten pilot project family water square designed twofold strategy mind create attractive public space giving identity neighbourhood providing storm water storage one space increased urban resilience also piloting new way fund highquality public realm square largely financed city water management department design jointly conceived local resident student member adjacent church youth theatre gym three stepped basin collect rain water large stainless steel gutter used skateboarding informal theatre relaxing around dry start site 2012 completion 2013 project cost €4 million gross site area 9500m 2 client rotterdam initiative city rotterdam supported waterboard schieland krimpenerwaard designer de urbanisten engineer city rotterdam engineering bureau contractor wallaard comment share tag biodiversity de urbanisten netherlands public realm rotterdam",
        "Selfpost": false,
        "URL": "https://www.architectsjournal.co.uk/buildings/how-sponge-city-rotterdam-is-adapting-to-climate-change",
        "CommCount": 1,
        "Comments": [
            {
                "ID": "lzi1bp3",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "City of sponges, soaking up the rain.",
                "Processed_Content": "city sponge soaking rain"
            }
        ],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 1,
            "Governance and Policy (Causes)": 1,
            "Personal Consumption": 2,
            "Ecosystem Disruption": 15,
            "Extreme Weather Events": 9,
            "Health Risks": 2,
            "Economic Impact": 15,
            "Displacement and Migration": 0,
            "Technological Solutions": 4,
            "Governance and Policy (Solutions)": 1,
            "Adaptation and Resilience": 9,
            "Lifestyle Solutions": 8,
            "Nature-Based Solutions": 8
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 1,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1hkcn92",
        "Title": "What Role Do Grassroots Movements Play in Shaping Climate Action Plans?",
        "Author": "ramakrishnasurathu",
        "Upvotes": 19,
        "Created": "2024-12-23 02:13:08",
        "Content": "Governments often focus on large-scale solutions, but grassroots initiatives prove impactful on the ground. Share inspiring local stories or actionable ideas that should make it into the big picture.",
        "Processed_Content": "government often focus largescale solution grassroots initiative prove impactful ground share inspiring local story actionable idea make big picture",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hkcn92/what_role_do_grassroots_movements_play_in_shaping/",
        "CommCount": 4,
        "Comments": [
            {
                "ID": "m3eydtf",
                "Author": "Single-Pudding3865",
                "Upvotes": 2,
                "Content": "One of the ways is if you can work together at the local level to scale up local solutions. Eg in the case of biobased construction farmers, processors, and builders can go together to build in a sustainable way - and the municipality can prioritise biobased construction in their tenders and support the creation of demand. The educational systems can include sustainable construction in the curriculum. If we go together we can scale up existing biobased solutions. \n\nI am currently working on a project where this is our aim. It is nit easy - but I believe it is possible.",
                "Processed_Content": "one way work together local level scale local solution eg case biobased construction farmer processor builder go together build sustainable way municipality prioritise biobased construction tender support creation demand educational system include sustainable construction curriculum go together scale existing biobased solution currently working project aim nit easy believe possible"
            },
            {
                "ID": "m3fh9qa",
                "Author": "xtnh",
                "Upvotes": 2,
                "Content": "Installation of solar generally picks up after the first installations, so peer pressure or influence obviously is a driver for change.  I bet maps of heat pump installations would show increasing circles scattered across a community",
                "Processed_Content": "installation solar generally pick first installation peer pressure influence obviously driver bet map heat pump installation would show increasing circle scattered across community"
            },
            {
                "ID": "m3e5yc3",
                "Author": "ThinkBookMan",
                "Upvotes": 2,
                "Content": "Grassroot is the #1 way movements shape action.\n\nhttps://www.pbs.org/kenburns/the-national-parks",
                "Processed_Content": "grassroot 1 way movement shape action httpswwwpbsorgkenburnsthenationalparks"
            },
            {
                "ID": "m3hk1em",
                "Author": "TheDramaticBuck",
                "Upvotes": 1,
                "Content": "This reeds like a pub admin paper prompt 😂\n\nIn any case, for the **role** of grassroots movements see - [polycentricity](https://www.sciencedirect.com/science/article/abs/pii/S0959378010000634)",
                "Processed_Content": "reed like pub admin paper prompt 😂 case role grassroots movement see polycentricityhttpswwwsciencedirectcomsciencearticleabspiis0959378010000634"
            }
        ],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 1,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 1,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 3,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1hgg2k8",
        "Title": "What happened in Climate Tech this year? Climate Recap 2024",
        "Author": "These_Valuable_4910",
        "Upvotes": 17,
        "Created": "2024-12-17 18:38:33",
        "Content": "[https://www.climatedrift.com/p/climate-recap-2024](https://www.climatedrift.com/p/climate-recap-2024) ",
        "Processed_Content": "httpswwwclimatedriftcompclimaterecap2024httpswwwclimatedriftcompclimaterecap2024",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hgg2k8/what_happened_in_climate_tech_this_year_climate/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1gjp64j",
        "Title": "A Climate Action Navigator for Utility Rebates, City Climate Programs, and Electrification / Weatherization Assistance Programs",
        "Author": "climate-credits",
        "Upvotes": 18,
        "Created": "2024-11-04 22:02:07",
        "Content": "[smartclimatecredits.com](http://smartclimatecredits.com)\n\nI've been working with folks to build a database of state and local climate action programs, and I wanted to share it out with you all to see if you find it useful. \n\nIt's still a work in progress. We're cleaning it up and QAing all the program links, but we've got a couple hundred programs across all 50 states. And we're adding in new cities every week. \n\nWe hope that we can make this a comprehensive databases of sub-national climate programs.  We're building city navigators, but we also have county and tribal program data as well. In the near future, we want to build map overlays to cover those programs too. \n\nI'd love to get your thoughts!",
        "Processed_Content": "smartclimatecreditscomhttpsmartclimatecreditscom ive working folk build database state local action program wanted share see find useful still work progress cleaning qaing program link weve got couple hundred program across 50 state adding new city every week hope make comprehensive database subnational program building city navigator also county tribal program data well near future want build map overlay cover program id love get thought",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1gjp64j/a_climate_action_navigator_for_utility_rebates/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1h6fkvo",
        "Title": "Reducing Carbon Emissions in Construction: Insights and Strategies",
        "Author": "Murky_Decision3332",
        "Upvotes": 16,
        "Created": "2024-12-04 14:09:29",
        "Content": "Buildings are responsible for 39% of global greenhouse gas emissions, with 11% stemming from the materials and processes used in construction. Addressing these emissions requires informed material choices to minimize environmental impact.\n\nKey discussions in sustainable construction focus on decarbonizing building services through smarter energy management, as emphasized by Schneider Electric, and scaling low-carbon infrastructure, a priority for organizations like Arcadis, which explores strategies to enable large-scale reductions in embodied carbon. Designing for sustainability is also critical, with firms like Gensler highlighting the importance of material transparency and carbon considerations to ensure future-ready buildings. Practical approaches to enhance material reuse and recycling are being demonstrated by tools developed by the Hilti Group, which assess products based on multi-attribute sustainability.\n\nThese efforts align with broader initiatives such as embodied carbon reduction goals and fostering a circular economy in the built environment. Learn more about reducing construction emissions through resources like environmental product declarations and life-cycle assessment guidelines.\n\nWhat are your thoughts on practical steps for reducing embodied carbon in construction?",
        "Processed_Content": "building responsible 39 global greenhouse gas emission 11 stemming material process used construction addressing emission requires informed material choice minimize environmental impact key discussion sustainable construction focus decarbonizing building service smarter energy management emphasized schneider electric scaling lowcarbon infrastructure priority organization like arcadis explores strategy enable largescale reduction embodied carbon designing sustainability also critical firm like gensler highlighting importance material transparency carbon consideration ensure futureready building practical approach enhance material reuse recycling demonstrated tool developed hilti group ass product based multiattribute sustainability effort align broader initiative embodied carbon reduction goal fostering circular economy built environment learn reducing construction emission resource like environmental product declaration lifecycle assessment guideline thought practical step reducing embodied carbon construction",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1h6fkvo/reducing_carbon_emissions_in_construction/",
        "CommCount": 4,
        "Comments": [
            {
                "ID": "m0ifbff",
                "Author": "swedish-inventor",
                "Upvotes": 3,
                "Content": "1. Passivhaus-tech with focus on cellulose insulation. Reducing heating-requirements of buildings is more important than the actual energy that goes into the building.   \n2. Build slow and reduce waste. Large construction firms waste tremendous amounts of materials and energy. Instead learn from the amish or similar cobuilding initiatives.  \n3. Right type of buildings. Don't build huge steel/concrete highrises when you can make 3-4 story apartment buildings completely out of wood and with reclaimed or local materials.  \n4. Build housing with and for the people. Banks should require proof of use or tenants signed up before giving any credit or loans to developers. Today lots of buildings are pure investments that stand empty most of the time.   \n5. Provide more than just housing. Like [sharphill.org](http://sharphill.org) that wants to build ecovillages with local agriculture and embedded co-ops to reduce commuting and share equity. It helps the climate, creates social justice and decentralization that better can endure eventual disasters/crisis.",
                "Processed_Content": "1 passivhaustech focus cellulose insulation reducing heatingrequirements building important actual energy go building 2 build slow reduce waste large construction firm waste tremendous amount material energy instead learn amish similar cobuilding initiative 3 right type building dont build huge steelconcrete highrises make 34 story apartment building completely wood reclaimed local material 4 build housing people bank require proof use tenant signed giving credit loan developer today lot building pure investment stand empty time 5 provide housing like sharphillorghttpsharphillorg want build ecovillages local agriculture embedded coop reduce commuting share equity help creates social justice decentralization better endure eventual disasterscrisis"
            },
            {
                "ID": "m0d2d9o",
                "Author": "Murky_Decision3332",
                "Upvotes": 2,
                "Content": "Sign up for free & join the conversation: [https://oneclicklca.com/event/winter-sustainability-summit-2024/](https://oneclicklca.com/event/winter-sustainability-summit-2024/)",
                "Processed_Content": "sign free join conversation httpsoneclicklcacomeventwintersustainabilitysummit2024httpsoneclicklcacomeventwintersustainabilitysummit2024"
            },
            {
                "ID": "m2yw1b4",
                "Author": "mbrown_0911",
                "Upvotes": 1,
                "Content": "If \"reducing embodied construction\" means that housing prices will go up so only the very wealthy can afford them, then I'm against it. It's all about control. They want the peasants to never be able to afford to own anything. The Obamas will be keeping their five large-ass mansions. Guaranteed. Such a fraud.",
                "Processed_Content": "reducing embodied construction mean housing price go wealthy afford im control want peasant never able afford anything obamas keeping five largeass mansion guaranteed fraud"
            }
        ],
        "labels": {
            "Energy and Industry": 2,
            "Land Use and Agriculture": 1,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 1,
            "Displacement and Migration": 0,
            "Technological Solutions": 5,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 1,
            "Lifestyle Solutions": 3,
            "Nature-Based Solutions": 2
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 1,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 2,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 1,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1hjek2i",
        "Title": "Scaling Innovative Farming Practices: A Blueprint for Low-Emission Agriculture?",
        "Author": "ramakrishnasurathu",
        "Upvotes": 11,
        "Created": "2024-12-21 18:26:55",
        "Content": "Agriculture accounts for a significant portion of global emissions, yet some practices are showing promise in reducing this impact. Methods like agroforestry, regenerative farming, and permaculture are gaining traction. What actionable steps can policymakers, farmers, and consumers take to make these solutions mainstream? Share ideas or examples of pilot programs that deserve attention.",
        "Processed_Content": "agriculture account significant portion global emission yet practice showing promise reducing impact method like agroforestry regenerative farming permaculture gaining traction actionable step policymakers farmer consumer take make solution mainstream share idea example pilot program deserve attention",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hjek2i/scaling_innovative_farming_practices_a_blueprint/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 3,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 1
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1gyu7ol",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 8,
        "Created": "2024-11-24 17:00:12",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "please use thread post current action oriented discussion concern comment action general victory concern material abide normal forum post guideline open discussion please stick current subreddit rule keep thing polite cordial nonpolitical still allow doomism propaganda discus mean working combat fact action",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1gyu7ol/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 9,
        "Comments": [
            {
                "ID": "lyri8gc",
                "Author": "Coal121",
                "Upvotes": 5,
                "Content": "I'm hearing a lot of talk about how renewable energy is exploding (not literally) all over the world, being economically viable. Good stuff.",
                "Processed_Content": "im hearing lot talk renewable energy exploding literally world economically viable good stuff"
            },
            {
                "ID": "lyrt6zd",
                "Author": "TheBelievingAtheist",
                "Upvotes": 5,
                "Content": "It's a potentially good start. For example, in India, the explosion of renewable energy is quite evident with the government going all in for Solar energy. They are offering heavy rebates, even going as far as offering a way to sell it back to them.",
                "Processed_Content": "potentially good start example india explosion renewable energy quite evident government going solar energy offering heavy rebate even going far offering way sell back"
            },
            {
                "ID": "m0l10e4",
                "Author": "JackoClubs5545",
                "Upvotes": 3,
                "Content": "The fact that peaking emissions is even an idea now is great. Shows how far climate action has gone since twenty years ago.",
                "Processed_Content": "fact peaking emission even idea great show far action gone since twenty year ago"
            },
            {
                "ID": "m0l5zs1",
                "Author": "TSLsmokey",
                "Upvotes": 3,
                "Content": "Not gonna lie. I’m glad I found this subreddit because I was in a self destructive spiral. I was rationalizing as best I could but the thought loop continued. This sub is good for showing everything that people are doing for climate action.",
                "Processed_Content": "gon na lie glad found subreddit self destructive spiral rationalizing best could thought loop continued sub good showing everything people action"
            },
            {
                "ID": "lysb67m",
                "Author": "JackoClubs5545",
                "Upvotes": 2,
                "Content": "Can anyone verify if global emissions are set to peak in 2025? I've heard that tidbit passed around, but I don't know if it's true or not.",
                "Processed_Content": "anyone verify global emission set peak 2025 ive heard tidbit passed around dont know true"
            },
            {
                "ID": "m0kw540",
                "Author": "TSLsmokey",
                "Upvotes": 2,
                "Content": "I heard that from an article discussing the cop29 conference. Fingers crossed it’s true because then we can bring them down.",
                "Processed_Content": "heard article discussing cop29 conference finger crossed true bring"
            },
            {
                "ID": "lyxuzfm",
                "Author": "Glassprotist",
                "Upvotes": 1,
                "Content": "Keep fighting, if we give up, they win.",
                "Processed_Content": "keep fighting give win"
            },
            {
                "ID": "lzi1hxl",
                "Author": "ramakrishnasurathu",
                "Upvotes": 1,
                "Content": "Let's chat climate change, and work toward a brighter stage.",
                "Processed_Content": "let chat work toward brighter stage"
            },
            {
                "ID": "lzrrflj",
                "Author": "Zetman20",
                "Upvotes": 1,
                "Content": "https://youtu.be/D1MYZ6RUjMQ?si=mHJf6TSLu35sXelO An organization worth looking into.",
                "Processed_Content": "httpsyoutubed1myz6rujmqsimhjf6tslu35sxelo organization worth looking"
            }
        ],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 1,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 1,
            "Governance and Policy (Solutions)": 1,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1gtgng3",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 9,
        "Created": "2024-11-17 17:00:13",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "please use thread post current action oriented discussion concern comment action general victory concern material abide normal forum post guideline open discussion please stick current subreddit rule keep thing polite cordial nonpolitical still allow doomism propaganda discus mean working combat fact action",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1gtgng3/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1hnecse",
        "Title": "Talking points for local, state, and national government ",
        "Author": "Floopoo32",
        "Upvotes": 7,
        "Created": "2024-12-27 13:59:59",
        "Content": "Hi everyone. I just started volunteering with the Sierra club (against climate change). I'm working on creating some general talking points about climate change, it's effects, alternative power sources to gas and coal, etc.\n\nI'd love to point to some paper or website or pamphlet that proves that renewables are cheaper (or similarly priced)and capable of giving us all of the energy we need. I know the needed mix between wind and solar is dependant on location (I'm in WI). \n\nOur state utilities are asking to build several more natural gas plants because Microsoft is trying to build large data centers here and will need a ton of energy.\n\nAnyway, I was looking to see if there were any talking points about natural gas vs renewable so that I don't need to recreate the wheel. \n\nAlso I'm curious what other states have done to force more investment in renewable energy. I know Iowa had created a law to require a certain amount of energy be produced from wind...any other laws I should look up?",
        "Processed_Content": "hi everyone started volunteering sierra club im working creating general talking point effect alternative power source gas coal etc id love point paper website pamphlet prof renewables cheaper similarly pricedand capable giving u energy need know needed mix wind solar dependant location im wi state utility asking build several natural gas plant microsoft trying build large data center need ton energy anyway looking see talking point natural gas v renewable dont need recreate wheel also im curious state done force investment renewable energy know iowa created law require certain amount energy produced windany law look",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hnecse/talking_points_for_local_state_and_national/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 6,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 1,
            "Displacement and Migration": 0,
            "Technological Solutions": 2,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1giq4eu",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 5,
        "Created": "2024-11-03 17:00:12",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "please use thread post current action oriented discussion concern comment action general victory concern material abide normal forum post guideline open discussion please stick current subreddit rule keep thing polite cordial nonpolitical still allow doomism propaganda discus mean working combat fact action",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1giq4eu/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1hk1bar",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 4,
        "Created": "2024-12-22 17:00:12",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "please use thread post current action oriented discussion concern comment action general victory concern material abide normal forum post guideline open discussion please stick current subreddit rule keep thing polite cordial nonpolitical still allow doomism propaganda discus mean working combat fact action",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hk1bar/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1h46e0i",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 4,
        "Created": "2024-12-01 17:00:19",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "please use thread post current action oriented discussion concern comment action general victory concern material abide normal forum post guideline open discussion please stick current subreddit rule keep thing polite cordial nonpolitical still allow doomism propaganda discus mean working combat fact action",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1h46e0i/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "lzyfj9b",
                "Author": "Confident_Home487",
                "Upvotes": 1,
                "Content": "In 1972, Prince Philip colluded with Maurice Strong and they devised a plan to collapse Western countries and make China the economic leader of the world.\n\nIt's all garbage. Totally made up bs originally based on overpopulation but was tweaked and tweaked to include CO2 emissions and cow farts.\n\nJust get some truth and go look it up.",
                "Processed_Content": "1972 prince philip colluded maurice strong devised plan collapse western country make china economic leader world garbage totally made b originally based overpopulation tweaked tweaked include co2 emission cow fart get truth go look"
            }
        ],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1go3tbg",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 5,
        "Created": "2024-11-10 17:00:12",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "please use thread post current action oriented discussion concern comment action general victory concern material abide normal forum post guideline open discussion please stick current subreddit rule keep thing polite cordial nonpolitical still allow doomism propaganda discus mean working combat fact action",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1go3tbg/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1hevjyr",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 3,
        "Created": "2024-12-15 17:00:13",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "please use thread post current action oriented discussion concern comment action general victory concern material abide normal forum post guideline open discussion please stick current subreddit rule keep thing polite cordial nonpolitical still allow doomism propaganda discus mean working combat fact action",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1hevjyr/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 0,
        "Comments": [],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    },
    {
        "ID": "1h9lvzf",
        "Title": "Weekly /r/ClimateActionPlan Discussion Thread",
        "Author": "AutoModerator",
        "Upvotes": 1,
        "Created": "2024-12-08 17:00:11",
        "Content": "Please use this thread to post your current Climate Action oriented discussions and any other concerns or comments about climate change action in general. Any victories, concerns, or other material that does not abide by normal forum post guidelines is open for discussion here.   \n\n\nPlease stick to current subreddit rules and keep things polite, cordial, and non-political. We still do not allow doomism or climate change propaganda, but you can discuss it as a means of working to combat it with facts or actions.",
        "Processed_Content": "please use thread post current action oriented discussion concern comment action general victory concern material abide normal forum post guideline open discussion please stick current subreddit rule keep thing polite cordial nonpolitical still allow doomism propaganda discus mean working combat fact action",
        "Selfpost": true,
        "URL": "https://www.reddit.com/r/ClimateActionPlan/comments/1h9lvzf/weekly_rclimateactionplan_discussion_thread/",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "m2gts1v",
                "Author": "FrecklePeach",
                "Upvotes": 1,
                "Content": "We hit 1.5c this year. I thought that was the tipping point? Genuinely have lost all hope and am trying desperately not to fall into a panicking spiral. Is there any reason to hold onto hope..?",
                "Processed_Content": "hit 15c year thought tipping point genuinely lost hope trying desperately fall panicking spiral reason hold onto hope"
            },
            {
                "ID": "m2z0owr",
                "Author": "TSLsmokey",
                "Upvotes": 1,
                "Content": "It’s not considered that yet though it is sobering. In order for it to count, it has to be multiple years in a decade. We’re actually predicted to have a cooler 2025.",
                "Processed_Content": "considered yet though sobering order count multiple year decade actually predicted cooler 2025"
            }
        ],
        "labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        },
        "comment_labels": {
            "Energy and Industry": 0,
            "Land Use and Agriculture": 0,
            "Governance and Policy (Causes)": 0,
            "Personal Consumption": 0,
            "Ecosystem Disruption": 0,
            "Extreme Weather Events": 0,
            "Health Risks": 0,
            "Economic Impact": 0,
            "Displacement and Migration": 0,
            "Technological Solutions": 0,
            "Governance and Policy (Solutions)": 0,
            "Adaptation and Resilience": 0,
            "Lifestyle Solutions": 0,
            "Nature-Based Solutions": 0
        }
    }
]