[
    {
        "ID": "b49xgi",
        "Title": "How to get involved with a local group to create the political will for climate action",
        "Author": "silence7",
        "Upvotes": 1442,
        "Created": 1553286025.0,
        "Content": "There are several groups with reasonably widespread chapters trying to push climate action:\n\n* Sunrise — youth-oriented, pushing the Green New Deal. US only. Find a local hub [here](https://sunrisemovement.org/hubs).  Email the hub organizer to get involved.  They're volunteers, and often busy, so follow up if you don't hear back.\n* Citizens Climate Lobby — broader age range, studiously bipartisan.  In the US CCL is pushing a revenue-neutral carbon tax and dividend bill,  [H.R. 763](https://www.congress.gov/bill/116th-congress/house-bill/763)You can find a signup form for Citizens Climate Lobby [here](https://citizensclimatelobby.org/join-citizens-climate-lobby/?tfa_3590416195188=reddit-silence7&utm_source=reddit&utm_medium=referral&utm_campaign=silence7).Make sure you figure out where the monthly meeting is and attend.\n* 350.org — This is the biggest and oldest climate group.  They're involved in a variety of actions, ranging from divestment to lobbying for state/province level and municipal legislation. Broad age range.  Local groups can be found [here](https://350.org/get-involved/)\n* [Extinction Rebellion](https://rebellion.earth/) believes in the use of nonviolent civil disobedience, including a willingness of large number of people to be arrested, on a large scale to create political change.  They are most active in the UK, but also have a significant number of active local chapters in the US and other countries.  Local chapters are mostly listed [here](https://rebellion.earth/act-now/local-groups/) but some in the US are only listed at [the bottom of this page](https://extinctionrebellion.us/).\n\nIf you want to find one that works for you, go down the list (and check the comments) and find out which ones are active near you.  Attend a meeting or action or two to get a sense of what the group is like, and then start doing more to help.\n\nThere are others, and depending on you and your community, another group might be the best choice.  If you don't feel that one of these group is a good fit for you, tell us where you are and what your community is like, and ask for help.\n\nIf you think there's something significant that one of the big groups isn't handling, ask about it.  Maybe somebody can help you figure out how to get it done.",
        "URL": "https://www.reddit.com/r/climate/comments/b49xgi/how_to_get_involved_with_a_local_group_to_create/",
        "CommCount": 308,
        "Comments": [
            {
                "ID": "ekreeut",
                "Author": "ILikeNeurons",
                "Upvotes": 276,
                "Content": "If I may, I'd like to take a moment to share my experience volunteering with [Citizens' Climate Lobby](http://citizensclimatelobby.org/). \n\n* I've talked with friends and family about a [carbon tax](https://en.wikipedia.org/wiki/Carbon_price). I've convinced several that a carbon tax is a good idea. I've convinced a few to start volunteering for carbon taxes. [34% of Americans would be willing to volunteer for an organization to convince elected officials to act on climate change](http://climatecommunication.yale.edu/wp-content/uploads/2018/05/Global-Warming-Policy-Politics-March-2018.pdf). If you feel like you're up against a wall in your own political conversations, [here's some short trainings on how to have better political conversations](https://community.citizensclimatelobby.org/learn/communications/how-to-have-better-political-conversations/). \n\n* It took a few tries, but I published [a Letter to the Editor](https://community.citizensclimate.org/resources/item/19/111) to the largest local paper in my area espousing the need for and benefits of a carbon tax. Maybe you don't read LTEs, but [Congress does](https://www.aclu.org/other/letters-editor-how-write-them-and-why-they-work). \n\n* I wrote to [my favorite podcast](https://www.theskepticsguide.org/) about carbon taxes asking them to talk about [the scientific](http://bush.tamu.edu/istpp/scholarship/journals/ClimateScientistsPerspectives_ClimaticChange.pdf) and [economic](http://policyintegrity.org/files/publications/ExpertConsensusReport.pdf) consensus on their show. When nothing happened, I asked some fellow listeners to write, too. Eventually [they released this episode](https://www.theskepticsguide.org/podcast/sgu/573) (and [this blog post](https://theness.com/neurologicablog/index.php/economics-renewables-and-climate-change/)) lauding the benefits of carbon taxes.  \n\n* I've written literally dozens of [letters to my Rep and Senators](https://citizensclimatelobby.org/write-your-representative/) over the last few years asking them to support Carbon Fee & Dividend. I've seen their responses change over the years, too, so I suspect it's working (in fairness, [I'm not the only one](https://citizensclimatelobby.org/about-ccl/accomplishments/), of course). [Over 90% of members of Congress are swayed by contact from constituents](http://www.congressfoundation.org/projects/communicating-with-congress/citizen-centric-advocacy-2017). \n\n* I've hosted or co-hosted 4 letter-writing parties so that I could invite people I know to take [meaningful and effective action](http://www.congressfoundation.org/storage/documents/CMF_Pubs/cmf-citizen-centric-advocacy.pdf) on climate change.\n\n* At my request, 5 businesses and 2 non-profits have signed [Influencer's Letters to Congress](https://citizensclimatelobby.org/leaders/) calling for Carbon Fee & Dividend. \n\n* I recruited a friend to help me write a municipal Resolution for our municipality to publicly support Carbon Fee & Dividend. It took a lot of hard work recruiting volunteers from all over the city, sometimes meeting 2-3 times with the same Council member, but eventually it passed unanimously. [Over 100 municipalities have passed similar Resolutions in support of Carbon Fee & Dividend that call on Congress to pass the legislation](https://citizensclimatelobby.org/endorsements/municipal/). \n\n* I started a Meetup in my area to help recruit and train more volunteers who are interested in making this dream a reality. The group now has hundreds of members. I've invited on several new co-leaders who are doing pretty much all the work at this point. \n\n* I gave two [presentations](https://community.citizensclimate.org/resources/item/19/159) to groups of ~20 or so on Carbon Fee & Dividend and why it's a good idea that we should all be advocating for. I [arranged these presentations](https://community.citizensclimate.org/resources/item/19/160) myself. \n\n* I co-hosted two screenings of [Season 2, Episode 7 of Years of Living Dangerously \"Safe Passage\"](https://community.citizensclimatelobby.org/take-action/host-a-screening/#1485986882331-9e38cb79-9c5e1492-21fb7dd6-03b9bd85-3e3cce1f-2786706c-ee83)\n\n* I attended two meetings in my Representatives' home office to discuss Carbon Fee & Dividend and try to get their support. \n\nIt may be that at least some of these things are having an impact. [Just five years ago, only 30% of Americans supported a carbon tax](http://closup.umich.edu/issues-in-energy-and-environmental-policy/13/public-views-on-a-carbon-tax-depend-on-the-proposed-use-of-revenue/). Today, [it's over half](https://news.gallup.com/poll/232007/americans-want-government-more-environment.aspx). If you think Congress doesn't care about public support, [think again](https://www.tandfonline.com/doi/abs/10.1080/09644016.2016.1116651). \n\nFurthermore, the [evidence clearly shows](https://sociology.stanford.edu/sites/default/files/publications/friends_or_foes-how_social_movement_allies_affect_the_passage_of_legislation_in_the_u._s._congress.pdf) that [lobbing works](https://community.citizensclimatelobby.org/wp-content/uploads/2017/11/june-2017-meeting-analysis-1127.pdf), and [you don't need a lot of money to be effective](https://www.jstor.org/stable/41759323?seq=1#page_scan_tab_contents). \n\nAnd the IPCC has been clear that [carbon pricing is **necessary**](https://www.ipcc.ch/site/assets/uploads/sites/2/2018/12/SR15_TS_High_Res.pdf) if we're going to make our 1.5 ºC target. \n\nFor these reasons and more, [becoming an active volunteer with Citizens' Climate Lobby](https://citizensclimatelobby.org/join-citizens-climate-lobby/?tfa_3414=reddit-carbontax&utm_source=reddit&utm_medium=referral&utm_campaign=carbontax) is [the most important thing you can do for climate change](https://www.youtube.com/watch?v=q4DAW1A6Ca8), according to climatologist and climate activist [Dr. James Hansen](https://en.wikipedia.org/wiki/James_Hansen)."
            },
            {
                "ID": "ejgkn93",
                "Author": "atimska",
                "Upvotes": 97,
                "Content": "[Extinction Rebellion](https://extinctionrebellion.us/) is getting ramped up in the US. The group is committed to using non-violent civil disobedience to raise awareness of the urgency of action on the climate."
            },
            {
                "ID": "elpwstz",
                "Author": "navegar",
                "Upvotes": 36,
                "Content": "Excellent Post"
            },
            {
                "ID": "ej7naqv",
                "Author": "Splenda",
                "Upvotes": 31,
                "Content": "Good list. However, for the benefit of anyone thinking of starting a chapter in a city or town where climate action is relatively new, it pays to start with the right group.\n\nCCL's tight focus on getting the US House of Representatives to pass a small revenue-neutral carbon tax can burn out volunteers who want local action, and who tire of fruitlessly beseeching the lower-level staffers of distant, science-denying House dweebs.\n\nSunrise, as a student movement, does well in larger cities and university towns, although those are not the places that need convincing.\n\nIn my experience, 350 seems to be the best, largest network of local climate activists for less liberal cities and towns to throw in with. Divestment is merely one of 350's many areas of focus, and most of its chapters seem to focus on local actions such as pushing for renewable power and electric transportation, shutting down nearby coal plants, and generally making climate a more visible issue in local politics.\n\nShout-outs as well to the Sierra Club, the Climate Reality Project, Greenpeace, the Unitarian Church, Physicians for Social Responsibility, and more.  [Here's a list.](https://climatestore.com/take-action/get-involved/non-profit-organizations-working-on-climate-change)"
            },
            {
                "ID": "esej9ng",
                "Author": "ChrisBolman",
                "Upvotes": 30,
                "Content": "I don't agree with the statement lobbying is failing. I lobbied and was part of the coalition that passed the [CLCPA](https://grist.org/article/green-new-deal-new-york-climate-community-protection-act-agreement/) in New York this year (New York state's \"Green New Deal\"). lobbying from XR NYC and other climate groups also just got NYC's city council to declare climate emergency.\n\n&#x200B;\n\nyes, New York is fairly progressive (NYC certainly is, many parts of NY state less so), federal law is a disaster, and the CLCPA is still too conservative (need to update it again to make the targets much more aggressive), but you'd be surprised how much power you can have in state and local politics if you can build an active political coalition of a few hundred of few thousand people. and the US economy is the #1 source of climate change and 66% of the economy is blue states so a state-by-state strategy could do a lot, even if the President and Congress remain morally absent.\n\n&#x200B;\n\nhappy to answer questions or talk more about the process. I used to be really jaded about politics but the new climate movement is strategic, effective, and actually getting things done. which it needs to be because we need a lot of wins very, very fast."
            },
            {
                "ID": "eqlm7dt",
                "Author": "--_-_o_-_--",
                "Upvotes": 21,
                "Content": "Nobody is doing anything despite being well aware of the problem.  Lobbying is therefore failing. Lobbying is not the solution.  Hoping the government will respond to climate change is not working out."
            },
            {
                "ID": "ep3em63",
                "Author": "ILikeNeurons",
                "Upvotes": 20,
                "Content": "The IPCC (AR5, WGIII) [Summary for Policymakers](https://www.ipcc.ch/site/assets/uploads/2018/02/ipcc_wg3_ar5_summary-for-policymakers.pdf) states with \"high confidence\" that tax-based policies are effective at decoupling GHG emissions from GDP (see p. 28). [Ch. 15](https://www.ipcc.ch/site/assets/uploads/2018/02/ipcc_wg3_ar5_chapter15.pdf) has a more complete discussion. The U.S. [National Academy of Sciences, one of the most respected scientific bodies in the world, has also called for a carbon tax](https://www.nap.edu/download/21712). According to [IMF research](https://www.theatlantic.com/science/archive/2019/05/how-much-does-world-subsidize-oil-coal-and-gas/589000/), most of the $5.2 trillion in subsidies for fossil fuels come from not taxing carbon as we should. There is general agreement among economists on carbon taxes whether you consider [economists with expertise in climate economics](http://policyintegrity.org/files/publications/ExpertConsensusReport.pdf), [economists with expertise in resource economics](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.381.484&rep=rep1&type=pdf), or [economists from all sectors](https://www.researchgate.net/profile/Doris_Geide-Stevenson/publication/261884738_Consensus_Among_Economists-An_Update/links/56a7f3fa08ae860e0255a8e3.pdf). It is [Econ 101](http://www2.econ.iastate.edu/classes/econ101/herriges/Lectures10/Chapter%2017H%20-%20Externalities.pdf).\n\nIt's also [trivially easy](http://www.nber.org/papers/w6546) to design a carbon tax that doesn't hurt the poor. [Returning the revenue as an equitable dividend to households](https://mpra.ub.uni-muenchen.de/65919/1/MPRA_paper_65919.pdf) would [do the trick](http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0081648#s7)."
            },
            {
                "ID": "elg0ej4",
                "Author": "CalClimate",
                "Upvotes": 16,
                "Content": "Hey graphic design & other artists, there needs to be an \"artists for climate action\" group (subreddit?).   Not everyone has your skills.  It seems strange that there's so very little online activity around this - where are you people?   (If I was inclined to be a climate doubter, this is the sort of thing that I would find most doubt-inducing.)"
            },
            {
                "ID": "ekmgmbv",
                "Author": "Unknown",
                "Upvotes": 15,
                "Content": "[deleted]"
            },
            {
                "ID": "ivjskia",
                "Author": "ILikeNeurons",
                "Upvotes": 15,
                "Content": "Yes. \n\nhttps://www.reddit.com/r/CitizensClimateLobby/comments/vzaamh/canada_ramps_up_its_carbon_pricing_policy/\n\nhttps://www.theatlantic.com/science/archive/2022/10/inflation-reduction-act-climate-economy/671659/\n\nhttps://citizensclimatelobby.org/about-ccl/accomplishments/"
            },
            {
                "ID": "eob50ny",
                "Author": "--_-_o_-_--",
                "Upvotes": 14,
                "Content": "Lobbying and informing people had no effect at the last federal election in Australia.  The country returned a coal-fondler in chief to the prime ministership.  This was while there was no mention of a carbon tax by the main opposition party.\n\nIn the meantime we can cross our fingers and have hope that at the next election something might be done.   🙄"
            },
            {
                "ID": "j1bwf3a",
                "Author": "ILikeNeurons",
                "Upvotes": 14,
                "Content": "[Over 20% of global emissions are now covered by a carbon price](https://carbonpricingdashboard.worldbank.org/). Obviously we need more. Are you ready to [volunteer](https://cclusa.org/x)?"
            },
            {
                "ID": "exl77ub",
                "Author": "ILikeNeurons",
                "Upvotes": 12,
                "Content": "[Clathrates aren't damning in the foreseeable future](https://www.reddit.com/r/science/comments/7c0fpz/hi_reddit_were_radley_horton_and_sarah_doherty/dpmpd1k/).\n\nAnd [cutting pollution won't cause a global warming spike](https://phys.org/news/2019-08-pollution-wont-global-spike.html).\n\nAre you just looking for excuses to do nothing?"
            },
            {
                "ID": "elqre87",
                "Author": "ILikeNeurons",
                "Upvotes": 11,
                "Content": "CCL's added nearly 70,000 volunteers so far in 2019, so you might have a different experience getting involved now than you did before. Even Mississippi's more than doubled. Many hands make light work. \n\nBut yeah, it's not a sprint, rather a long hike."
            },
            {
                "ID": "evfry6o",
                "Author": "_portman_",
                "Upvotes": 11,
                "Content": "Agreed. Most of the political systems around the world are hopelessly obsolete. They only serve to make rich even richer, while keeping the rest of the people divided into parties so that to occupy them with a constant struggle for power. The \"elite\" is not making any attempts to solve the problem because they would have to say goodbye to their profit margins. The only solution is to **restructure the political system** so that it advances decent people who care about the future of the planet, instead of promoting bigots and crooks who \"run for office\" in hope for quick profits. This may take a long time, maybe several decades. With the accelerating speed of the climate change, it is important to realize this and start acting as soon as possible."
            },
            {
                "ID": "ev44obc",
                "Author": "HowardWittAustralia",
                "Upvotes": 11,
                "Content": "We are coming up to our 5th National Conference 2 day conference & 2 days lobbying in Canberra.  \n[https://au.citizensclimatelobby.org/2019-wa-ipcc-forum/](https://au.citizensclimatelobby.org/2019-wa-ipcc-forum/)  \nWe will get about 70 participants again this year.  \nWe are building local groups across the country.  \nEncourage Aussies to join - Aussie web page www.ccl.org.au"
            },
            {
                "ID": "ek6ra1x",
                "Author": "CalClimate",
                "Upvotes": 10,
                "Content": "The Al Gore-founded Climate Reality Project is now forming local chapters (https://www.climaterealityproject.org/blog/take-action-join-local-chapter), apparently - though it wasn't clear to me how they plan to be different from other groups, particularly 350.org."
            },
            {
                "ID": "enz2xg1",
                "Author": "Capn_Underpants",
                "Upvotes": 10,
                "Content": "Agreed but that doesn't mean you can't do the right  thing, cut your emissions, vote Green and normalise low emisions lifestyles.\n\nYou don't have to choose to be an asshole and deliberately help make it worse.  Just be stoic and accept that others will."
            },
            {
                "ID": "exkwzle",
                "Author": "ILikeNeurons",
                "Upvotes": 10,
                "Content": "[Climatologist explains why \"it's too late\" is a silly argument to make](https://www.theguardian.com/environment/2018/jul/27/extreme-global-weather-climate-change-michael-mann)"
            },
            {
                "ID": "ek15se8",
                "Author": "childeofentropy",
                "Upvotes": 9,
                "Content": "There is also Earthstrike! you can find it on subreddit: reddit.com/r/earthstrike\n\nThis movement tries to organize people on an international strike/protest for the climate (there are three upcoming major international events for 2019), and advocates for ecological justice, plurality and change towards a sustainable future, throught social visibility (local actions, outreach) and political pressure (global strikes, etc).\n\nThere are several local chapters around the globe, so check 'em out!\n"
            }
        ]
    },
    {
        "ID": "1hrs84i",
        "Title": "BoM data finds 2024 was Australia’s second-hottest year on record. Rise in greenhouse gases responsible for average temperatures rising to 1.46C above average, with one climate scientist saying this is ‘the norm now’.",
        "Author": "The_Weekend_Baker",
        "Upvotes": 63,
        "Created": 1735819486.0,
        "Content": "",
        "URL": "https://www.theguardian.com/australia-news/2025/jan/02/bom-data-2024-australia-second-hottest-year-on-record",
        "CommCount": 2,
        "Comments": [
            {
                "ID": "m4zwy6m",
                "Author": "The_Weekend_Baker",
                "Upvotes": 2,
                "Content": "It's interesting to note that in Australia, the average 1.46C is being compared to is the period 1961-1990, as opposed to the pre-industrial average that climate scientists use for the world."
            }
        ]
    },
    {
        "ID": "1hr6vx3",
        "Title": "Climate progress screeched to a halt this year. One country had its foot on the brake. ",
        "Author": "castro67v",
        "Upvotes": 842,
        "Created": 1735750561.0,
        "Content": "",
        "URL": "https://edition.cnn.com/2024/12/31/climate/climate-negotiations-obstruction-saudi-arabia/",
        "CommCount": 114,
        "Comments": [
            {
                "ID": "m4vipbu",
                "Author": "bustedbuddha",
                "Upvotes": 367,
                "Content": "It's Saudi Arabia. I wish someone would point out to them that Global Warming is what's making the Hajj deadlier every year, and that by contributing to it they're betraying their covenant with the Hajj."
            },
            {
                "ID": "m4vv8sl",
                "Author": "dumnezero",
                "Upvotes": 115,
                "Content": "They'll probably end up  building a giant dome over it."
            },
            {
                "ID": "m4vpir9",
                "Author": "bustedbuddha",
                "Upvotes": 72,
                "Content": "Nice unrelated fact, but the article is referring to Saudi Arabia's efforts to stem any response to climate change that involves moving away from oil."
            },
            {
                "ID": "m4wjw08",
                "Author": "dumblederp6",
                "Upvotes": 50,
                "Content": "With AC."
            },
            {
                "ID": "m4w05by",
                "Author": "IntrepidGentian",
                "Upvotes": 42,
                "Content": "Quote from wikipedia [Conservative nature of IPCC reports](https://en.wikipedia.org/wiki/Intergovernmental_Panel_on_Climate_Change#Conservative_nature_of_IPCC_reports) :\n\n\"Climate scientist James E. Hansen argues that the IPCC's conservativeness seriously underestimates the risk of sea-level rise on the order of meters—enough to inundate many low-lying areas, such as the southern third of Florida. In January 2024, he told the Guardian, *We are now in the process of moving into the 1.5C world.* He added that, *passing through the 1.5C world is a significant milestone because it shows that the story being told by the United Nations, with the acquiescence of its scientific advisory body, the IPCC, is a load of bullshit.* \""
            },
            {
                "ID": "m4wwwcz",
                "Author": "dumnezero",
                "Upvotes": 37,
                "Content": "And hyped up stuff for investors."
            },
            {
                "ID": "m4vpvfy",
                "Author": "bustedbuddha",
                "Upvotes": 33,
                "Content": "The article is referring to Saudi Arabia's efforts to stop responses to climate change. This is really bringing the trolls out of the woodwork."
            },
            {
                "ID": "m4xe3t1",
                "Author": "IamblichusSneezed",
                "Upvotes": 24,
                "Content": "It takes extreme neoliberal brain rot to single out only one country. The U.S. were probably the biggest offender in precluding the possibility of progress, and it can only get worse under Trump."
            },
            {
                "ID": "m4wc1gb",
                "Author": "identicalBadger",
                "Upvotes": 24,
                "Content": "Yes, but on a per capita basis they’re far from the worst offenders last I checked. People talk about the level of pollution and omit they have 4 times more people than us. The world would be far past the brink if another 1.3 million people living “American” lives existed on top of the first world population we already have"
            },
            {
                "ID": "m4vqu7c",
                "Author": "Konradleijon",
                "Upvotes": 23,
                "Content": "Saudi Arabia is supported by the US. So it’s America’s fault"
            },
            {
                "ID": "m4vvi0n",
                "Author": "xdr567",
                "Upvotes": 19,
                "Content": "Yes, but the Saudi govt is not a complex body with many think tanks or policy makers. Saudi policy on any matter is whatever the big guy in charge and his trusted few want."
            },
            {
                "ID": "m4w4gxd",
                "Author": "Splenda",
                "Upvotes": 13,
                "Content": "Billions in sweetheart arms deals. Free logistical and intelligence support. A large trade deficit about which we make no objections. And, of course, we spent trillions in the Iraq debacle largely to appease Saudis and other Gulf states, while we also aid Saudi opposition against Iran."
            },
            {
                "ID": "m4w1fkr",
                "Author": "Benjamin_Stark",
                "Upvotes": 12,
                "Content": "They have historically used a ton of coal, have they not? And have they not also been rapidly reducing the amount of coal they use?"
            },
            {
                "ID": "m4vyhnr",
                "Author": "merkurmaniac",
                "Upvotes": 12,
                "Content": "Electric viking on you tube pointed out that China canceled all coal plant permits for next year. I haven't seen it other places, but they are installing so much solar that it would make sense."
            },
            {
                "ID": "m4xpbms",
                "Author": "AllenIll",
                "Upvotes": 11,
                "Content": "Saudi Arabia is, in essence, a U.S. *[client state](https://en.wikipedia.org/wiki/Client_state)*. In this regard, it is not a completely independent sovereign nation making decisions alone. Anyone arguing otherwise here is likely either lying, an agent working at an information warfare/PR desk, or ignorant. As the U.S. has been essentially running a protection racket for the *[House of Saud](https://en.wikipedia.org/wiki/House_of_Saud)*, the controlling family of Saudi Arabia, for well over half a century.\n\nThe U.S. supplies them with weapons, and who knows what other security and intelligence-related services, and they in turn manipulate oil market conditions on behalf of the U.S. Whether that be [selling the vast majority of their oil in U.S. Treasury-denominated debt instruments](https://archive.ph/pOaX1) like Treasury Bonds or [constricting/glutting global oil markets](https://archive.is/Wv63m#selection-1277.0-1293.222). \n\nAs an example: the U.S. and other states consume and sell the oil they produce nearly instantaneously. What Saudi Arabia has, no one else does; extremely high volumes of reserves that can be drilled, basically, on command:\n\n> [...] what matters most for stabilizing global oil prices is “spare production capacity”—defined as how much a producer can ramp up oil production within 30 days. That spare production capacity allows a producer to ramp up—or slow down—oil production basically at will, shifting global prices.\n> \n> Saudi Arabia has a huge amount of spare production capacity: around [2 million barrels of oil](https://archive.ph/gDnRs) a day. Once, the United States did have spare production capacity that was managed by the [Texas Railroad Commission](https://www.reuters.com/article/us-opec-meeting-factbox/factbox-opec-still-standing-among-the-ruins-of-former-cartels-idUSKCN0YO243/). But as more easily reached oil dried up—to be replaced by harder-to-reach shale oil—that power disappeared. Today, the United States’ spare production capacity is zero. U.S. oil producers, many of whom are beholden to their shareholders, can’t hold on to spare capacity in the same way as their Middle East counterparts.\n>  \n> Spare production capacity “is expensive to maintain, which is why no other producers maintain it,” said Hittle. In the U.S., she added, investors would never put up with spending capital to develop production and then letting it sit idle until the right moment.\n>  \n> Source: [The U.S. is the world’s largest oil producer. You’ll still pay more for gas.](https://archive.ph/BM0we#selection-1085.20-1155.261)—By  Shannon Osaka | Oct. 8, 2022 (*The Washington Post*)\n\nTheir decisions can, and often do, set the market price for oil. Just based on how much they decide to produce, or most often, not produce. They don't even need OPEC to move it.\n\nIn this way, Saudi Arabia really acts as a kind of back door Federal Reserve. Because they sell their oil almost exclusively in dollars, if their decisions shoot the price of oil to the moon because they restricted supply, a lot of the dollar money supply is going to be sucked out of circulation. And this is exactly what happened during the 1970s oil shocks, and leading up to the 2008 financial crisis, where oil topped out at $150 a barrel in the Summer of that year. They can pull a lot of money out of the system. Almost overnight. **Single-handedly**. So, anyone arguing here that Saudi Arabia is acting purely in its own self-interest in regard to impeding climate change-related policy that could potentially place supply and demand restrictions on oil is 100% full of it.\n\nAs stated above, the U.S. has been using it's protection racket \"relationship\" with the House of Saud now for half a century, and more fundamentally, [since World War II](https://archive.ph/fsg85). This isn't some rogue state acting all on it's own... because muhhnayyy. **This is about U.S. power and leverage over the geopolitical landscape.**"
            },
            {
                "ID": "m4xk9dy",
                "Author": "Infamous_Employer_85",
                "Upvotes": 11,
                "Content": "Global emissions need be be cut by 50% for atmospheric CO2 to stop increasing\n\nhttps://www.ipcc.ch/report/ar6/wg1/downloads/faqs/IPCC_AR6_WGI_FAQ_Chapter_05.pdf\n\n>These land and ocean removals or\n‘sinks’ have grown largely in proportion to the increase\nin CO2 emissions, taking up 31% (land) and 23%\n(ocean) of the emissions in 2010–2019, respectively\n(FAQ 5.1, Figure 1). Therefore, the average proportion\nof yearly CO2 emissions staying in the atmosphere\nhas remained roughly stable at 44% over the last six\ndecades\n\nChina has more renewables than Europe and the US combined, and has lower per capita emissions than the US.  China also has more high speed rail than the rest of the world combined, avoiding aviation emissions."
            },
            {
                "ID": "m4wr2tv",
                "Author": "WantDebianThanks",
                "Upvotes": 10,
                "Content": "I like when any country does anything they shouldn't, it's still America's fault. \n\nSorry Saudi government: I know you *think* you're real people able to think, plan, and act on your own for your own purposes to advance your own goals, but that's actually a trick played on you by the Americans who secretly control your brains."
            },
            {
                "ID": "m4xhb00",
                "Author": "Thannk",
                "Upvotes": 9,
                "Content": "The Saudi billionaires also own American politicians. \n\nThe two are kinda inextricable. Two rich men with their hands in each other’s pants."
            },
            {
                "ID": "m4vgqwi",
                "Author": "SniffingDelphi",
                "Upvotes": 8,
                "Content": "I was able to access it by selecting reader mode."
            },
            {
                "ID": "m4xq2sy",
                "Author": "Sabertooth512",
                "Upvotes": 8,
                "Content": "Build a dome over the WHOLE Hajj??"
            }
        ]
    },
    {
        "ID": "1hrsqvf",
        "Title": "At Extinction Rebellion, we aimed for UK net zero in 2025. That won’t happen – so here’s what to do instead | Rupert Read",
        "Author": "GeraldKutney",
        "Upvotes": 18,
        "Created": 1735821393.0,
        "Content": "",
        "URL": "https://www.theguardian.com/commentisfree/2025/jan/01/extinction-rebellion-uk-net-zero-2025-climate",
        "CommCount": 3,
        "Comments": [
            {
                "ID": "m504zd5",
                "Author": "michaelrch",
                "Upvotes": 1,
                "Content": "You can tell how successful Read's \"Climate Majority Project\" has been by all the achievements it has had on policy, publicity and outreach.\n\ni.e. none\n\nHe doesn't like radical tactics even though they worked when he was at XR in 2019.\n\nMeanwhile JSO gets attention on the subject with every action, it puts pressure on politicians, its people are in the media routinely, the prison sentences for its activists are the subject of challenges by the UN Human Rights agency.\n\nRead's milquetoast softly-softly stuff might please chin-stroking Guardian readers but it's having no effect in the real world."
            },
            {
                "ID": "m50j5u4",
                "Author": "RandyBobandyMarsh",
                "Upvotes": 1,
                "Content": "Yup. They need to stop having their movement commandeered by these limp-wristed distractions that only enable more environmental destruction by diverting real effort towards empty platitudes."
            }
        ]
    },
    {
        "ID": "1hraaj9",
        "Title": "Three-quarters of the world's land is drying out, 'redefining life on Earth'",
        "Author": "Splenda",
        "Upvotes": 399,
        "Created": 1735759568.0,
        "Content": "",
        "URL": "https://grist.org/international/three-quarters-of-the-worlds-land-is-drying-out-redefining-life-on-earth/",
        "CommCount": 13,
        "Comments": [
            {
                "ID": "m4xj5l2",
                "Author": "uguu777",
                "Upvotes": 63,
                "Content": "drying out also involves the complete destruction of the Amazon and huge swaths of tundra/swamplands releasing their gigantic carbon stores (which will further speed up climate change in a positive feedback loop till we are deep into the +3C world)\n\nthe solution was to start elimination of fossil fuel emissions 50 years ago but now we're 50 years deep and our rate of emissions is still GROWING not decreasing\n\nlol we're gonna do much more than \"redefine life on earth\" we're going to end most of it"
            },
            {
                "ID": "m4xv5qk",
                "Author": "Hanuman_Jr",
                "Upvotes": 20,
                "Content": "Yeah we're not gonna recover from this.  We blew it."
            },
            {
                "ID": "m4wb2rb",
                "Author": "SniffingDelphi",
                "Upvotes": 14,
                "Content": "One of the many, many reasons why I’m so hopeful for new and old/new tech for dry land and saline agriculture."
            },
            {
                "ID": "m4y76m4",
                "Author": "SunDaysOnly",
                "Upvotes": 11,
                "Content": "I read that humans only occupy 4% of the planets surface. You’d think we’d be smart about not letting that quantity get smaller. 🤏"
            },
            {
                "ID": "m4yxbrm",
                "Author": "milleniumhandyshrimp",
                "Upvotes": 8,
                "Content": "We would, except planaria are a lifeform and not a habitat."
            },
            {
                "ID": "m4xvgoo",
                "Author": "Hanuman_Jr",
                "Upvotes": 5,
                "Content": "There are going to be planaria deep underground that will survive until the greenhouse gases bring us up past the boiling point of water.   All bets are off after that point."
            },
            {
                "ID": "m4y89f0",
                "Author": "bgaffney8787",
                "Upvotes": 5,
                "Content": "Are we allowed dogs in your planaria? I’m only doing dog-friendly planarias."
            },
            {
                "ID": "m4x9eb2",
                "Author": "mag2041",
                "Upvotes": 4,
                "Content": "Fingers crossed"
            },
            {
                "ID": "m4zoait",
                "Author": "topsyturvy76",
                "Upvotes": 2,
                "Content": "All guests bringing dinner will be allowed to stay an extra day"
            },
            {
                "ID": "m4zxonk",
                "Author": "ghost_in_shale",
                "Upvotes": 1,
                "Content": "It’s over"
            },
            {
                "ID": "m4zcgez",
                "Author": "dumnezero",
                "Upvotes": 1,
                "Content": "` = null`"
            }
        ]
    }
]